{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "AHardwareBuffer_Plane [4]",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "type-401",
   "self_type" : "type-404",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-9",
   "self_type" : "type-155",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-452",
   "self_type" : "type-573",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-14",
   "self_type" : "type-33",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [4]",
   "name" : "int [4]",
   "referenced_type" : "type-14",
   "self_type" : "type-1371",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [7]",
   "name" : "int [7]",
   "referenced_type" : "type-14",
   "self_type" : "type-605",
   "size" : 28,
   "source_file" : "/hardware/libhardware/include/hardware/fb.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",

   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-25",
   "self_type" : "type-82",
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::shared_ptr<C2Allocator> *const",
   "name" : "std::shared_ptr<C2Allocator> *const",
   "referenced_type" : "type-1764",
   "self_type" : "type-1766",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::shared_ptr<C2Allocator> *const",
   "name" : "std::shared_ptr<C2Allocator> *const",
   "referenced_type" : "type-2363",
   "self_type" : "type-2365",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::shared_ptr<C2Allocator> *const",
   "name" : "std::shared_ptr<C2Allocator> *const",
   "referenced_type" : "type-75",
   "self_type" : "type-77",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > > *const",
   "name" : "std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > > *const",
   "referenced_type" : "type-1023",
   "self_type" : "type-1025",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > > *const",
   "name" : "std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > > *const",
   "referenced_type" : "type-2705",
   "self_type" : "type-2707",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > > *const",
   "referenced_type" : "type-1017",
   "self_type" : "type-1019",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > > *const",
   "referenced_type" : "type-2700",
   "self_type" : "type-2702",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "referenced_type" : "type-1074",
   "self_type" : "type-1076",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "referenced_type" : "type-2682",
   "self_type" : "type-2684",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "referenced_type" : "type-2750",
   "self_type" : "type-2752",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "referenced_type" : "type-998",
   "self_type" : "type-1001",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Desc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 32,
     "referenced_type" : "type-404"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 52,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Planes"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-405"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "stride",
     "field_offset" : 320,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "format",
     "field_offset" : 352,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 384,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 448,
     "referenced_type" : "type-413"
    },
    {
     "field_name" : "handle",
     "field_offset" : 480,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "usage",
     "field_offset" : 512,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 576,
     "referenced_type" : "type-414"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1489"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-1478"
    }
   ],
   "linker_set_key" : "C2BasicGraphicBlockPool",
   "name" : "C2BasicGraphicBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-1488",
   "self_type" : "type-1488",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BufferPriv.h",
   "unique_id" : "_ZTS23C2BasicGraphicBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI23C2BasicGraphicBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK23C2BasicGraphicBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK23C2BasicGraphicBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN23C2BasicGraphicBlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN23C2BasicGraphicBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN23C2BasicGraphicBlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1480"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-1478"
    }
   ],
   "linker_set_key" : "C2BasicLinearBlockPool",
   "name" : "C2BasicLinearBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-1477",
   "self_type" : "type-1477",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BufferPriv.h",
   "unique_id" : "_ZTS22C2BasicLinearBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI22C2BasicLinearBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK22C2BasicLinearBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK22C2BasicLinearBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN22C2BasicLinearBlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BasicLinearBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BasicLinearBlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-185"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-124"
    },
    {
     "access" : "private",
     "field_name" : "mLocalId",
     "field_offset" : 128,
     "referenced_type" : "type-183"
    },
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 192,
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "C2BufferQueueBlockPool",
   "name" : "C2BufferQueueBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BqBufferPriv.h",
   "unique_id" : "_ZTS22C2BufferQueueBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI22C2BufferQueueBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK22C2BufferQueueBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK22C2BufferQueueBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPoolD0Ev"
    },
    {
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPool17setRenderCallbackERKNSt3__18functionIFvyixEEE"
    },
    {
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPool17configureProducerERKN7android2spINS0_8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2ComponentFactory",
   "name" : "C2ComponentFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1308",
   "self_type" : "type-1308",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ComponentFactory.h",
   "unique_id" : "_ZTS18C2ComponentFactory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18C2ComponentFactory"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2ComponentFactory15createComponentEjPNSt3__110shared_ptrI11C2ComponentEENS0_8functionIFvPS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2ComponentFactory15createInterfaceEjPNSt3__110shared_ptrI20C2ComponentInterfaceEENS0_8functionIFvPS2_EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18C2ComponentFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18C2ComponentFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-880"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<char>",
   "name" : "C2FieldSupportedValuesHelper<char>",
   "record_kind" : "class",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-904"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<float>",
   "name" : "C2FieldSupportedValuesHelper<float>",
   "record_kind" : "class",
   "referenced_type" : "type-903",
   "self_type" : "type-903",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-888"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<int>",
   "name" : "C2FieldSupportedValuesHelper<int>",
   "record_kind" : "class",
   "referenced_type" : "type-887",
   "self_type" : "type-887",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-896"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<long long>",
   "name" : "C2FieldSupportedValuesHelper<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-895",
   "self_type" : "type-895",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIxE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-884"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<unsigned char>",
   "name" : "C2FieldSupportedValuesHelper<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-892"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<unsigned int>",
   "name" : "C2FieldSupportedValuesHelper<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-891",
   "self_type" : "type-891",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-900"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<unsigned long long>",
   "name" : "C2FieldSupportedValuesHelper<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-899",
   "self_type" : "type-899",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2FieldUtils",
   "name" : "C2FieldUtils",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS12C2FieldUtils"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-254"
    }
   ],
   "linker_set_key" : "C2FieldUtils::Info",
   "name" : "C2FieldUtils::Info",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTSN12C2FieldUtils4InfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "C2FieldUtils::Iterator",
   "name" : "C2FieldUtils::Iterator",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTSN12C2FieldUtils8IteratorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN12C2FieldUtils8IteratorE"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils8IteratordeEv"
    },
    {
     "mangled_component_name" : "_ZN12C2FieldUtils8IteratorppEv"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils8IteratoreqERKS0_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils8IteratorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils8IteratorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2FieldUtils::List",
   "name" : "C2FieldUtils::List",
   "referenced_type" : "type-263",
   "self_type" : "type-263",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTSN12C2FieldUtils4ListE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN12C2FieldUtils4ListE"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils4List5beginEv"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils4List3endEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils4ListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils4ListD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-283"
    },
    {
     "access" : "protected",
     "field_name" : "mReflector",
     "field_offset" : 64,
     "referenced_type" : "type-284"
    },
    {
     "access" : "protected",
     "field_name" : "_mFactory",
     "field_offset" : 128,
     "referenced_type" : "type-285"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper",
   "name" : "C2InterfaceHelper",
   "record_kind" : "class",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTS17C2InterfaceHelper",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2InterfaceHelper"
    },
    {
     "mangled_component_name" : "_ZN17C2InterfaceHelper6configERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEE13c2_blocking_tPNS1_INS0_10unique_ptrI15C2SettingResultNS0_14default_deleteISB_EEEENS4_ISE_EEEEbPNS1_INS0_10shared_ptrIS2_EENS4_ISJ_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelperD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2InterfaceHelper::Factory",
   "name" : "C2InterfaceHelper::Factory",
   "record_kind" : "class",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper7FactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN17C2InterfaceHelper7FactoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2InterfaceHelper7Factory12getReflectorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2InterfaceHelper7Factory14getParamHelperERKNS_8ParamRefE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelper7FactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelper7FactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mParam",
     "referenced_type" : "type-286"
    },
    {
     "access" : "protected",
     "field_name" : "mFieldId",
     "field_offset" : 32,
     "referenced_type" : "type-297"
    },
    {
     "access" : "protected",
     "field_name" : "mPossible",
     "field_offset" : 96,
     "referenced_type" : "type-298"
    },
    {
     "access" : "protected",
     "field_name" : "mSupported",
     "field_offset" : 128,
     "referenced_type" : "type-299"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::FieldHelper",
   "name" : "C2InterfaceHelper::FieldHelper",
   "record_kind" : "class",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper11FieldHelperE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "type-301"
    },
    {
     "access" : "private",
     "field_name" : "_mTypedParam",
     "field_offset" : 32,
     "referenced_type" : "type-304"
    },
    {
     "access" : "private",
     "field_name" : "_mHelper",
     "field_offset" : 96,
     "referenced_type" : "type-305"
    },
    {
     "access" : "private",
     "field_name" : "_mReflector",
     "field_offset" : 160,
     "referenced_type" : "type-306"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::Param<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "name" : "C2InterfaceHelper::Param<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 28,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-307" ],
   "unique_id" : "_ZTSN17C2InterfaceHelper5ParamI13C2GlobalParamI6C2Info21C2StoreIonUsageStructLi16386EvEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-319"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mTypedParam",
     "field_offset" : 32,
     "referenced_type" : "type-322"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::ParamBuilder<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "name" : "C2InterfaceHelper::ParamBuilder<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "record_kind" : "class",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-324" ],
   "unique_id" : "_ZTSN17C2InterfaceHelper12ParamBuilderI13C2GlobalParamI6C2Info21C2StoreIonUsageStructLi16386EvEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "referenced_type" : "type-320"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::ParamHelper",
   "name" : "C2InterfaceHelper::ParamHelper",
   "record_kind" : "class",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper11ParamHelperE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mRef",
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::ParamRef",
   "name" : "C2InterfaceHelper::ParamRef",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper8ParamRefE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-956"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<char>",
   "name" : "C2ParamFieldValuesBuilder<char>",
   "record_kind" : "class",
   "referenced_type" : "type-955",
   "self_type" : "type-955",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIcE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIcE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIcED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIcED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-961"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<float>",
   "name" : "C2ParamFieldValuesBuilder<float>",
   "record_kind" : "class",
   "referenced_type" : "type-960",
   "self_type" : "type-960",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIfE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIfED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIfED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-233"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<int>",
   "name" : "C2ParamFieldValuesBuilder<int>",
   "record_kind" : "class",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIiE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIiE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIiED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIiED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-959"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<long long>",
   "name" : "C2ParamFieldValuesBuilder<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-958",
   "self_type" : "type-958",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIxE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIxE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIxED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIxED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-954"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<unsigned char>",
   "name" : "C2ParamFieldValuesBuilder<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-953",
   "self_type" : "type-953",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIhE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIhE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIhED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIhED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<unsigned int>",
   "name" : "C2ParamFieldValuesBuilder<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIjE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIjE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIjED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<unsigned long long>",
   "name" : "C2ParamFieldValuesBuilder<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIyED0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2ParamUtils",
   "name" : "C2ParamUtils",
   "record_kind" : "class",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2ParamUtils.h",
   "unique_id" : "_ZTS12C2ParamUtils"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLibHandle",
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mCreateBlockPool",
     "field_offset" : 32,
     "referenced_type" : "type-58"
    },
    {
     "access" : "private",
     "field_name" : "mCreateAllocator",
     "field_offset" : 64,
     "referenced_type" : "type-62"
    }
   ],
   "linker_set_key" : "C2PlatformStorePluginLoader",
   "name" : "C2PlatformStorePluginLoader",
   "record_kind" : "class",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h",
   "unique_id" : "_ZTS27C2PlatformStorePluginLoader"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1498"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-1478"
    },
    {
     "access" : "private",
     "field_name" : "mLocalId",
     "field_offset" : 128,
     "referenced_type" : "type-183"
    },
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 192,
     "referenced_type" : "type-1497"
    }
   ],
   "linker_set_key" : "C2PooledBlockPool",
   "name" : "C2PooledBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-1496",
   "self_type" : "type-1496",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BufferPriv.h",
   "unique_id" : "_ZTS17C2PooledBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2PooledBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK17C2PooledBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK17C2PooledBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN17C2PooledBlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN17C2PooledBlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2PooledBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2PooledBlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-278"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-276"
    },
    {
     "access" : "private",
     "field_name" : "_mStructs",
     "field_offset" : 64,
     "referenced_type" : "type-277"
    }
   ],
   "linker_set_key" : "C2ReflectorHelper",
   "name" : "C2ReflectorHelper",
   "record_kind" : "class",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTS17C2ReflectorHelper",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2ReflectorHelper"
    },
    {
     "mangled_component_name" : "_ZNK17C2ReflectorHelper8describeEN7C2Param9CoreIndexE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2ReflectorHelperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2ReflectorHelperD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mConflicts",
     "referenced_type" : "type-240"
    }
   ],
   "linker_set_key" : "C2SettingConflictsBuilder",
   "name" : "C2SettingConflictsBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS25C2SettingConflictsBuilder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mParamField",
     "referenced_type" : "type-244"
    },
    {
     "access" : "private",
     "field_name" : "_mResult",
     "field_offset" : 96,
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "C2SettingResultBuilder",
   "name" : "C2SettingResultBuilder",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 44,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS22C2SettingResultBuilder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mStatus",
     "referenced_type" : "type-247"
    },
    {
     "access" : "private",
     "field_name" : "_mResults",
     "field_offset" : 32,
     "referenced_type" : "type-248"
    }
   ],
   "linker_set_key" : "C2SettingResultsBuilder",
   "name" : "C2SettingResultsBuilder",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS23C2SettingResultsBuilder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-850"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<char>",
   "name" : "C2SupportedFlags<char>",
   "record_kind" : "class",
   "referenced_type" : "type-849",
   "self_type" : "type-849",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-868"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<float>",
   "name" : "C2SupportedFlags<float>",
   "record_kind" : "class",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-212"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<int>",
   "name" : "C2SupportedFlags<int>",
   "record_kind" : "class",
   "referenced_type" : "type-211",
   "self_type" : "type-211",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-862"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<long long>",
   "name" : "C2SupportedFlags<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-861",
   "self_type" : "type-861",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIxE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-854"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<unsigned char>",
   "name" : "C2SupportedFlags<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-853",
   "self_type" : "type-853",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-210"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<unsigned int>",
   "name" : "C2SupportedFlags<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-209",
   "self_type" : "type-209",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<unsigned long long>",
   "name" : "C2SupportedFlags<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIyE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 8,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 16,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 24,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "C2SupportedRange<char>",
   "name" : "C2SupportedRange<char>",
   "record_kind" : "class",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 5,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTS16C2SupportedRangeIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-452"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 32,
     "referenced_type" : "type-452"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 64,
     "referenced_type" : "type-452"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 96,
     "referenced_type" : "type-452"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 128,
     "referenced_type" : "type-452"
    }
   ],
   "linker_set_key" : "C2SupportedRange<float>",
   "name" : "C2SupportedRange<float>",
   "record_kind" : "class",
   "referenced_type" : "type-846",
   "self_type" : "type-846",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTS16C2SupportedRangeIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "C2SupportedRange<int>",
   "name" : "C2SupportedRange<int>",
   "record_kind" : "class",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS16C2SupportedRangeIiE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 64,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 128,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 256,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "C2SupportedRange<long long>",
   "name" : "C2SupportedRange<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-841",
   "self_type" : "type-841",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTS16C2SupportedRangeIxE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 8,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 16,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 24,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "C2SupportedRange<unsigned char>",
   "name" : "C2SupportedRange<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-834",
   "self_type" : "type-834",
   "size" : 5,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTS16C2SupportedRangeIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2SupportedRange<unsigned int>",
   "name" : "C2SupportedRange<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS16C2SupportedRangeIjE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 64,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 192,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 256,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "C2SupportedRange<unsigned long long>",
   "name" : "C2SupportedRange<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS16C2SupportedRangeIyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-872"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<char>",
   "name" : "C2SupportedValueSet<char>",
   "record_kind" : "class",
   "referenced_type" : "type-871",
   "self_type" : "type-871",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-878"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<float>",
   "name" : "C2SupportedValueSet<float>",
   "record_kind" : "class",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-222"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<int>",
   "name" : "C2SupportedValueSet<int>",
   "record_kind" : "class",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<long long>",
   "name" : "C2SupportedValueSet<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-875",
   "self_type" : "type-875",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIxE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-874"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<unsigned char>",
   "name" : "C2SupportedValueSet<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-220"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<unsigned int>",
   "name" : "C2SupportedValueSet<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<unsigned long long>",
   "name" : "C2SupportedValueSet<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pData",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "iWidth",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "iHeight",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "iStride",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "EGLClientPixmapHI",
   "name" : "EGLClientPixmapHI",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 16,
   "source_file" : "/frameworks/native/opengl/include/EGL/eglext.h",
   "unique_id" : "EGLClientPixmapHI"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<char>",
   "name" : "_C2FieldValueHelper<char>",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIcE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<float>",
   "name" : "_C2FieldValueHelper<float>",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIfE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<int>",
   "name" : "_C2FieldValueHelper<int>",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIiE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<long long>",
   "name" : "_C2FieldValueHelper<long long>",
   "referenced_type" : "type-829",
   "self_type" : "type-829",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIxE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<uint8_t>",
   "name" : "_C2FieldValueHelper<uint8_t>",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIhE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<unsigned int>",
   "name" : "_C2FieldValueHelper<unsigned int>",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIjE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<unsigned long long>",
   "name" : "_C2FieldValueHelper<unsigned long long>",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<12, 13, 22>",
   "name" : "_c2_map_errno_impl<12, 13, 22>",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi12ELi13ELi22EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<13, 22>",
   "name" : "_c2_map_errno_impl<13, 22>",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi13ELi22EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<13>",
   "name" : "_c2_map_errno_impl<13>",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi13EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<22>",
   "name" : "_c2_map_errno_impl<22>",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi22EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<>",
   "name" : "_c2_map_errno_impl<>",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_reduce_enum_to_underlying_type<int, false>",
   "name" : "_c2_reduce_enum_to_underlying_type<int, false>",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTS34_c2_reduce_enum_to_underlying_typeIiLb0EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_reduce_enum_to_underlying_type<unsigned int, false>",
   "name" : "_c2_reduce_enum_to_underlying_type<unsigned int, false>",
   "referenced_type" : "type-273",
   "self_type" : "type-273",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS34_c2_reduce_enum_to_underlying_typeIjLb0EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_reduce_enum_to_underlying_type<unsigned long long, false>",
   "name" : "_c2_reduce_enum_to_underlying_type<unsigned long long, false>",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTS34_c2_reduce_enum_to_underlying_typeIyLb0EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 512,
     "referenced_type" : "type-1333"
    },
    {
     "field_name" : "free",
     "field_offset" : 544,
     "referenced_type" : "type-1337"
    },
    {
     "field_name" : "dump",
     "field_offset" : 576,
     "referenced_type" : "type-1339"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 608,
     "referenced_type" : "type-1341"
    }
   ],
   "linker_set_key" : "alloc_device_t",
   "name" : "alloc_device_t",
   "referenced_type" : "type-1332",
   "self_type" : "type-1332",
   "size" : 104,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "alloc_device_t"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-412"
    },
    {
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "name" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "record_kind" : "class",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 104,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ANativeObjectBase.h",
   "template_args" : [ "type-412", "type-420", "type-350", "type-405" ],
   "unique_id" : "_ZTSN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-361"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 32,
     "referenced_type" : "type-682"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::BBinder",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "type-681",
   "self_type" : "type-681",
   "size" : 20,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android7BBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-691"
    }
   ],
   "linker_set_key" : "android::BnGraphicBufferProducer",
   "name" : "android::BnGraphicBufferProducer",
   "record_kind" : "class",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android23BnGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android23BnGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android23BnGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13requestBufferEiPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13dequeueBufferEPiPNS_2spINS_5FenceEEEjjiyPyPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer16detachNextBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer11queueBufferEiRKNS0_16QueueBufferInputEPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12cancelBufferEiRKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer5queryEiPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer7connectERKNS_2spINS_17IProducerListenerEEEibPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer10disconnectEiNS0_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setSidebandStreamERKNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allocateBuffersEjjiy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer15getConsumerNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setDequeueTimeoutEx"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setLegacyBufferDropEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19getLastQueuedBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEEPf"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18getFrameTimestampsEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer11getUniqueIdEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer16getConsumerUsageEPy"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14exportToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android23BnGraphicBufferProducer10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnGraphicBufferProducerE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android23BnGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android23BnGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android23BnGraphicBufferProducer10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android23BnGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android23BnGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-380"
    },
    {
     "referenced_type" : "type-681"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IGraphicBufferProducer>",
   "name" : "android::BnInterface<android::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-691",
   "self_type" : "type-691",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-380" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_22IGraphicBufferProducerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13requestBufferEiPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13dequeueBufferEPiPNS_2spINS_5FenceEEEjjiyPyPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer16detachNextBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer11queueBufferEiRKNS0_16QueueBufferInputEPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12cancelBufferEiRKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer5queryEiPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer7connectERKNS_2spINS_17IProducerListenerEEEibPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer10disconnectEiNS0_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setSidebandStreamERKNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allocateBuffersEjjiy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer15getConsumerNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setDequeueTimeoutEx"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setLegacyBufferDropEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19getLastQueuedBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEEPf"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18getFrameTimestampsEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer11getUniqueIdEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer16getConsumerUsageEPy"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14exportToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-684"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-685"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-687"
    }
   ],
   "linker_set_key" : "android::BpRefBase",
   "name" : "android::BpRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android9BpRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mGraphicBuffer",
     "referenced_type" : "type-506"
    },
    {
     "field_name" : "mEglDisplay",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "mBufferState",
     "field_offset" : 64,
     "referenced_type" : "type-501"
    },
    {
     "field_name" : "mRequestBufferCalled",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "mFrameNumber",
     "field_offset" : 256,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "mEglFence",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "mFence",
     "field_offset" : 352,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "mAcquireCalled",
     "field_offset" : 384,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "mNeedsReallocation",
     "field_offset" : 392,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::BufferSlot",
   "name" : "android::BufferSlot",
   "referenced_type" : "type-505",
   "self_type" : "type-505",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferSlot.h",
   "unique_id" : "_ZTSN7android10BufferSlotE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDequeueCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mQueueCount",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mAcquireCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mShared",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::BufferState",
   "name" : "android::BufferState",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferSlot.h",
   "unique_id" : "_ZTSN7android11BufferStateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1302"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-1300"
    }
   ],
   "linker_set_key" : "android::C2AllocatorGralloc",
   "name" : "android::C2AllocatorGralloc",
   "record_kind" : "class",
   "referenced_type" : "type-1299",
   "self_type" : "type-1299",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2AllocatorGralloc.h",
   "unique_id" : "_ZTSN7android18C2AllocatorGrallocE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18C2AllocatorGrallocE"
    },
    {
     "mangled_component_name" : "_ZNK7android18C2AllocatorGralloc7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK7android18C2AllocatorGralloc5getIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android18C2AllocatorGralloc9getTraitsEv"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator19newLinearAllocationEj13C2MemoryUsagePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator21priorLinearAllocationEPK13native_handlePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN7android18C2AllocatorGralloc20newGraphicAllocationEjjj13C2MemoryUsagePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN7android18C2AllocatorGralloc22priorGraphicAllocationEPK13native_handlePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18C2AllocatorGrallocD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18C2AllocatorGrallocD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1410"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mInit",
     "field_offset" : 32,
     "referenced_type" : "type-1404"
    },
    {
     "access" : "private",
     "field_name" : "mIonFd",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapperLock",
     "field_offset" : 96,
     "referenced_type" : "type-1405"
    },
    {
     "access" : "private",
     "field_name" : "mTraits",
     "field_offset" : 128,
     "referenced_type" : "type-1406"
    },
    {
     "access" : "private",
     "field_name" : "mBlockSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapper",
     "field_offset" : 256,
     "referenced_type" : "type-1407"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapperLru",
     "field_offset" : 448,
     "referenced_type" : "type-1408"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapperCache",
     "field_offset" : 544,
     "referenced_type" : "type-1409"
    }
   ],
   "linker_set_key" : "android::C2AllocatorIon",
   "name" : "android::C2AllocatorIon",
   "record_kind" : "class",
   "referenced_type" : "type-1403",
   "self_type" : "type-1403",
   "size" : 88,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2AllocatorIon.h",
   "unique_id" : "_ZTSN7android14C2AllocatorIonE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14C2AllocatorIonE"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon5getIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon9getTraitsEv"
    },
    {
     "mangled_component_name" : "_ZN7android14C2AllocatorIon19newLinearAllocationEj13C2MemoryUsagePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN7android14C2AllocatorIon21priorLinearAllocationEPK13native_handlePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator20newGraphicAllocationEjjj13C2MemoryUsagePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator22priorGraphicAllocationEPK13native_handlePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14C2AllocatorIonD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14C2AllocatorIonD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon6statusEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "android::C2AllocatorIon::MapperKeyHash",
   "name" : "android::C2AllocatorIon::MapperKeyHash",
   "referenced_type" : "type-1568",
   "self_type" : "type-1568",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2AllocatorIon.h",
   "unique_id" : "_ZTSN7android14C2AllocatorIon13MapperKeyHashE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1311"
    }
   ],
   "linker_set_key" : "android::C2PlatformAllocatorStore",
   "name" : "android::C2PlatformAllocatorStore",
   "record_kind" : "class",
   "referenced_type" : "type-1310",
   "self_type" : "type-1310",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformSupport.h",
   "unique_id" : "_ZTSN7android24C2PlatformAllocatorStoreE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android24C2PlatformAllocatorStoreE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore17listAllocators_nbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2AllocatorStore14fetchAllocatorEjPNSt3__110shared_ptrI11C2AllocatorEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android24C2PlatformAllocatorStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android24C2PlatformAllocatorStoreD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deadline",
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "interval",
     "field_offset" : 64,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "presentLatency",
     "field_offset" : 128,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "android::CompositorTiming",
   "name" : "android::CompositorTiming",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android16CompositorTimingE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFramesDirty",
     "field_offset" : 6912,
     "referenced_type" : "type-733"
    },
    {
     "access" : "private",
     "field_name" : "mQueueOffset",
     "field_offset" : 7168,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mCompositionOffset",
     "field_offset" : 7200,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mReleaseOffset",
     "field_offset" : 7232,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentConnectId",
     "field_offset" : 7264,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mProducerWantsEvents",
     "field_offset" : 7296,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::ConsumerFrameEventHistory",
   "name" : "android::ConsumerFrameEventHistory",
   "record_kind" : "class",
   "referenced_type" : "type-732",
   "self_type" : "type-732",
   "size" : 920,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android25ConsumerFrameEventHistoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android25ConsumerFrameEventHistoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android25ConsumerFrameEventHistoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android25ConsumerFrameEventHistoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-392"
    },
    {
     "referenced_type" : "type-394"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFenceFd",
     "field_offset" : 32,
     "referenced_type" : "type-391"
    }
   ],
   "linker_set_key" : "android::Fence",
   "name" : "android::Fence",
   "record_kind" : "class",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Fence.h",
   "unique_id" : "_ZTSN7android5FenceE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mState",
     "referenced_type" : "type-698"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-700"
    },
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 64,
     "referenced_type" : "type-508"
    },
    {
     "access" : "private",
     "field_name" : "mSignalTime",
     "field_offset" : 128,
     "referenced_type" : "type-701"
    }
   ],
   "linker_set_key" : "android::FenceTime",
   "name" : "android::FenceTime",
   "record_kind" : "class",
   "referenced_type" : "type-697",
   "self_type" : "type-697",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTimeE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "fence",
     "field_offset" : 32,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "signalTime",
     "field_offset" : 64,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "android::FenceTime::Snapshot",
   "name" : "android::FenceTime::Snapshot",
   "referenced_type" : "type-562",
   "self_type" : "type-562",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTime8SnapshotE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-708"
    },
    {
     "access" : "private",
     "field_name" : "mQueue",
     "field_offset" : 32,
     "referenced_type" : "type-709"
    }
   ],
   "linker_set_key" : "android::FenceTimeline",
   "name" : "android::FenceTimeline",
   "record_kind" : "class",
   "referenced_type" : "type-707",
   "self_type" : "type-707",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android13FenceTimelineE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-711"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-712"
    }
   ],
   "linker_set_key" : "android::FenceToFenceTimeMap",
   "name" : "android::FenceToFenceTimeMap",
   "record_kind" : "class",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android19FenceToFenceTimeMapE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-390" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FenceTime::Snapshot>",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-562" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_9FenceTime8SnapshotEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "name" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22FrameEventHistoryDeltaEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FrameEventsDelta>",
   "name" : "android::Flattenable<android::FrameEventsDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-567" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_16FrameEventsDeltaEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::GraphicBuffer>",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-420" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "record_kind" : "class",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-585" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22IGraphicBufferProducer16QueueBufferInputEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "record_kind" : "class",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-602" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22IGraphicBufferProducer17QueueBufferOutputEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-452"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-452"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-452"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-452"
    }
   ],
   "linker_set_key" : "android::FloatRect",
   "name" : "android::FloatRect",
   "record_kind" : "class",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FloatRect.h",
   "unique_id" : "_ZTSN7android9FloatRectE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBitset",
     "referenced_type" : "type-727"
    }
   ],
   "linker_set_key" : "android::FrameEventDirtyFields",
   "name" : "android::FrameEventDirtyFields",
   "record_kind" : "class",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android21FrameEventDirtyFieldsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFrames",
     "field_offset" : 64,
     "referenced_type" : "type-720"
    },
    {
     "access" : "protected",
     "field_name" : "mCompositorTiming",
     "field_offset" : 6720,
     "referenced_type" : "type-583"
    }
   ],
   "linker_set_key" : "android::FrameEventHistory",
   "name" : "android::FrameEventHistory",
   "record_kind" : "class",
   "referenced_type" : "type-719",
   "self_type" : "type-719",
   "size" : 864,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android17FrameEventHistoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17FrameEventHistoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17FrameEventHistoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17FrameEventHistoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-580"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDeltas",
     "referenced_type" : "type-582"
    },
    {
     "access" : "private",
     "field_name" : "mCompositorTiming",
     "field_offset" : 128,
     "referenced_type" : "type-583"
    }
   ],
   "linker_set_key" : "android::FrameEventHistoryDelta",
   "name" : "android::FrameEventHistoryDelta",
   "record_kind" : "class",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android22FrameEventHistoryDeltaE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "valid",
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "connectId",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "frameNumber",
     "field_offset" : 64,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "addPostCompositeCalled",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "addReleaseCalled",
     "field_offset" : 136,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "postedTime",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "requestedPresentTime",
     "field_offset" : 256,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "latchTime",
     "field_offset" : 320,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "firstRefreshStartTime",
     "field_offset" : 384,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "lastRefreshStartTime",
     "field_offset" : 448,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "dequeueReadyTime",
     "field_offset" : 512,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "acquireFence",
     "field_offset" : 576,
     "referenced_type" : "type-715"
    },
    {
     "field_name" : "gpuCompositionDoneFence",
     "field_offset" : 640,
     "referenced_type" : "type-716"
    },
    {
     "field_name" : "displayPresentFence",
     "field_offset" : 704,
     "referenced_type" : "type-717"
    },
    {
     "field_name" : "releaseFence",
     "field_offset" : 768,
     "referenced_type" : "type-718"
    }
   ],
   "linker_set_key" : "android::FrameEvents",
   "name" : "android::FrameEvents",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 104,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android11FrameEventsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mIndex",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFrameNumber",
     "field_offset" : 64,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "mAddPostCompositeCalled",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mAddReleaseCalled",
     "field_offset" : 136,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mPostedTime",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mRequestedPresentTime",
     "field_offset" : 256,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mLatchTime",
     "field_offset" : 320,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mFirstRefreshStartTime",
     "field_offset" : 384,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mLastRefreshStartTime",
     "field_offset" : 448,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mDequeueReadyTime",
     "field_offset" : 512,
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mGpuCompositionDoneFence",
     "field_offset" : 576,
     "referenced_type" : "type-562"
    },
    {
     "access" : "private",
     "field_name" : "mDisplayPresentFence",
     "field_offset" : 704,
     "referenced_type" : "type-562"
    },
    {
     "access" : "private",
     "field_name" : "mReleaseFence",
     "field_offset" : 832,
     "referenced_type" : "type-562"
    }
   ],
   "linker_set_key" : "android::FrameEventsDelta",
   "name" : "android::FrameEventsDelta",
   "record_kind" : "class",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 120,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android16FrameEventsDeltaE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-419"
    },
    {
     "referenced_type" : "type-428"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 832,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mBufferMapper",
     "field_offset" : 864,
     "referenced_type" : "type-421"
    },
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 896,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumFds",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumInts",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mId",
     "field_offset" : 1024,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "mBufferId",
     "field_offset" : 1088,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mGenerationNumber",
     "field_offset" : 1120,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDeathCallbacks",
     "field_offset" : 1152,
     "referenced_type" : "type-426"
    },
    {
     "access" : "private",
     "field_name" : "mBufferHubBuffer",
     "field_offset" : 1248,
     "referenced_type" : "type-427"
    }
   ],
   "linker_set_key" : "android::GraphicBuffer",
   "name" : "android::GraphicBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-420",
   "self_type" : "type-420",
   "size" : 160,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBuffer.h",
   "unique_id" : "_ZTSN7android13GraphicBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13GraphicBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-425"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "referenced_type" : "type-423"
    },
    {
     "access" : "private",
     "field_name" : "mMapperVersion",
     "field_offset" : 32,
     "referenced_type" : "type-424"
    }
   ],
   "linker_set_key" : "android::GraphicBufferMapper",
   "name" : "android::GraphicBufferMapper",
   "record_kind" : "class",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBufferMapper.h",
   "unique_id" : "_ZTSN7android19GraphicBufferMapperE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-596"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "validTypes",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "smpte2086",
     "field_offset" : 32,
     "referenced_type" : "type-592"
    },
    {
     "field_name" : "cta8613",
     "field_offset" : 352,
     "referenced_type" : "type-594"
    },
    {
     "field_name" : "hdr10plus",
     "field_offset" : 416,
     "referenced_type" : "type-595"
    }
   ],
   "linker_set_key" : "android::HdrMetadata",
   "name" : "android::HdrMetadata",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/gui/include/gui/HdrMetadata.h",
   "unique_id" : "_ZTSN7android11HdrMetadataE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::IBinder",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::IBinder::DeathRecipient",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-364",
   "self_type" : "type-364",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "android::IGraphicBufferProducer",
   "name" : "android::IGraphicBufferProducer",
   "record_kind" : "class",
   "referenced_type" : "type-380",
   "self_type" : "type-380",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/gui/include/gui/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android22IGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13requestBufferEiPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13dequeueBufferEPiPNS_2spINS_5FenceEEEjjiyPyPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer16detachNextBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer11queueBufferEiRKNS0_16QueueBufferInputEPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12cancelBufferEiRKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer5queryEiPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer7connectERKNS_2spINS_17IProducerListenerEEEibPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer10disconnectEiNS0_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setSidebandStreamERKNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allocateBuffersEjjiy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer15getConsumerNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setDequeueTimeoutEx"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setLegacyBufferDropEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19getLastQueuedBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEEPf"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18getFrameTimestampsEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer11getUniqueIdEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer16getConsumerUsageEPy"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14exportToParcelEPNS_6ParcelE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android22IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android22IGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-584"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "isAutoTimestamp",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-432"
    },
    {
     "field_name" : "crop",
     "field_offset" : 128,
     "referenced_type" : "type-481"
    },
    {
     "field_name" : "scalingMode",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "transform",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stickyTransform",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fence",
     "field_offset" : 352,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "surfaceDamage",
     "field_offset" : 384,
     "referenced_type" : "type-586"
    },
    {
     "field_name" : "getFrameTimestamps",
     "field_offset" : 544,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "hdrMetadata",
     "field_offset" : 576,
     "referenced_type" : "type-591"
    }
   ],
   "linker_set_key" : "android::IGraphicBufferProducer::QueueBufferInput",
   "name" : "android::IGraphicBufferProducer::QueueBufferInput",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 136,
   "source_file" : "/frameworks/native/libs/gui/include/gui/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android22IGraphicBufferProducer16QueueBufferInputE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-601"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformHint",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numPendingBuffers",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nextFrameNumber",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "frameTimestamps",
     "field_offset" : 192,
     "referenced_type" : "type-581"
    },
    {
     "field_name" : "bufferReplaced",
     "field_offset" : 512,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::IGraphicBufferProducer::QueueBufferOutput",
   "name" : "android::IGraphicBufferProducer::QueueBufferOutput",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 72,
   "source_file" : "/frameworks/native/libs/gui/include/gui/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android22IGraphicBufferProducer17QueueBufferOutputE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::IInterface",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "unique_id" : "_ZTSN7android10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::HdrMetadata>",
   "name" : "android::LightFlattenable<android::HdrMetadata>",
   "record_kind" : "class",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-591" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_11HdrMetadataEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Point>",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-460" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Rect>",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-483",
   "self_type" : "type-483",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Region>",
   "name" : "android::LightFlattenable<android::Region>",
   "record_kind" : "class",
   "referenced_type" : "type-590",
   "self_type" : "type-590",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-586" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_6RegionEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-462"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Point>",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-461",
   "self_type" : "type-461",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-460" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-483"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Rect>",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_4RectEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-393"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::Fence>",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-390" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-1113"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-1112",
   "self_type" : "type-1112",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1114" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-1097"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1096",
   "self_type" : "type-1096",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1098" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1112"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-802"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-1114",
   "self_type" : "type-1114",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "postedTime",
     "field_offset" : 64,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "requestedPresentTime",
     "field_offset" : 128,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "acquireFence",
     "field_offset" : 192,
     "referenced_type" : "type-725"
    }
   ],
   "linker_set_key" : "android::NewFrameEventsEntry",
   "name" : "android::NewFrameEventsEntry",
   "referenced_type" : "type-724",
   "self_type" : "type-724",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android19NewFrameEventsEntryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 32,
     "referenced_type" : "type-109"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 160,
     "referenced_type" : "type-748"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 288,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 296,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 352,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 360,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 368,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 384,
     "referenced_type" : "type-749"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 416,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::Parcel",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 60,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "referenced_type" : "type-14"
    },
    {
     "access" : "protected",
     "field_name" : "mData",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mMutable",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::Parcel::Blob",
   "name" : "android::Parcel::Blob",
   "record_kind" : "class",
   "referenced_type" : "type-754",
   "self_type" : "type-754",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel4BlobE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "linker_set_key" : "android::Parcel::FlattenableHelperInterface",
   "name" : "android::Parcel::FlattenableHelperInterface",
   "record_kind" : "class",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel26FlattenableHelperInterfaceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface16getFlattenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface10getFdCountEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface7flattenEPvjPij"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Parcel26FlattenableHelperInterface9unflattenEPKvjPKij"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-754"
    }
   ],
   "linker_set_key" : "android::Parcel::ReadableBlob",
   "name" : "android::Parcel::ReadableBlob",
   "record_kind" : "class",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel12ReadableBlobE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-754"
    }
   ],
   "linker_set_key" : "android::Parcel::WritableBlob",
   "name" : "android::Parcel::WritableBlob",
   "record_kind" : "class",
   "referenced_type" : "type-763",
   "self_type" : "type-763",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel12WritableBlobE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::Parcelable",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "type-743",
   "self_type" : "type-743",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcelable.h",
   "unique_id" : "_ZTSN7android10ParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-461"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::Point",
   "name" : "android::Point",
   "record_kind" : "class",
   "referenced_type" : "type-460",
   "self_type" : "type-460",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "unique_id" : "_ZTSN7android5PointE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mAcquireOffset",
     "field_offset" : 6912,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mAcquireTimeline",
     "field_offset" : 6944,
     "referenced_type" : "type-707"
    },
    {
     "access" : "protected",
     "field_name" : "mGpuCompositionDoneTimeline",
     "field_offset" : 7168,
     "referenced_type" : "type-707"
    },
    {
     "access" : "protected",
     "field_name" : "mPresentTimeline",
     "field_offset" : 7392,
     "referenced_type" : "type-707"
    },
    {
     "access" : "protected",
     "field_name" : "mReleaseTimeline",
     "field_offset" : 7616,
     "referenced_type" : "type-707"
    }
   ],
   "linker_set_key" : "android::ProducerFrameEventHistory",
   "name" : "android::ProducerFrameEventHistory",
   "record_kind" : "class",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 984,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h",
   "unique_id" : "_ZTSN7android25ProducerFrameEventHistoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android25ProducerFrameEventHistoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android25ProducerFrameEventHistoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android25ProducerFrameEventHistoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android25ProducerFrameEventHistory18updateAcquireFenceEyONSt3__110shared_ptrINS_9FenceTimeEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android25ProducerFrameEventHistory15createFenceTimeERKNS_2spINS_5FenceEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-397"
    },
    {
     "referenced_type" : "type-482"
    }
   ],
   "linker_set_key" : "android::Rect",
   "name" : "android::Rect",
   "record_kind" : "class",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "unique_id" : "_ZTSN7android4RectE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-351"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-350",
   "self_type" : "type-350",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-1206",
   "self_type" : "type-1206",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-1201",
   "self_type" : "type-1201",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-590"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "referenced_type" : "type-587"
    }
   ],
   "linker_set_key" : "android::Region",
   "name" : "android::Region",
   "record_kind" : "class",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 20,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Region.h",
   "unique_id" : "_ZTSN7android6RegionE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Singleton<android::GraphicBufferMapper>",
   "name" : "android::Singleton<android::GraphicBufferMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Singleton.h",
   "template_args" : [ "type-422" ],
   "unique_id" : "_ZTSN7android9SingletonINS_19GraphicBufferMapperEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-588"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-666"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-665",
   "self_type" : "type-665",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-657",
   "self_type" : "type-657",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-588"
    }
   ],
   "linker_set_key" : "android::Vector<android::Rect>",
   "name" : "android::Vector<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN7android6VectorINS_4RectEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_4RectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-589"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-589"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-588",
   "self_type" : "type-588",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1096"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-388",
   "self_type" : "type-388",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<bool, bool>",
   "name" : "android::base::EagerEvaluator<bool, bool>",
   "referenced_type" : "type-941",
   "self_type" : "type-941",
   "size" : 2,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-68", "type-68" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIbbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, char *>",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-89", "type-89" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, const char *>",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-89", "type-7" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcPKcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, char *>",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-89" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcPcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, const char *>",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-7" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-127", "type-127" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-127", "type-171" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaPaEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-101", "type-101" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-101", "type-109" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhPhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-171", "type-127" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaPKaEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-171", "type-171" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-109", "type-101" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhPKhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-109", "type-109" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "name" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIjjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "android::base::ErrnoRestorer",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base13ErrnoRestorerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-237"
    }
   ],
   "linker_set_key" : "android::base::LogMessage",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogMessageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "type-1590"
    }
   ],
   "linker_set_key" : "android::base::LogdLogger",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "type-1591",
   "self_type" : "type-1591",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogdLoggerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "type-280"
    }
   ],
   "linker_set_key" : "android::base::ScopedLogSeverity",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base17ScopedLogSeverityE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-388" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-1228",
   "self_type" : "type-1228",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-1212"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-1220",
   "self_type" : "type-1220",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-546"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::bufferqueue::V2_0::Status>",
   "name" : "android::hardware::Return<android::hardware::graphics::bufferqueue::V2_0::Status>",
   "record_kind" : "class",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-545" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_8graphics11bufferqueue4V2_06StatusEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-546"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1032"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error>",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error>",
   "record_kind" : "class",
   "referenced_type" : "type-1031",
   "self_type" : "type-1031",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1033" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_8graphics6mapper4V2_05ErrorEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-546"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::hardware::Return<unsigned long long>",
   "name" : "android::hardware::Return<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIyEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-546"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-548"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "type-1325"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "type-1326"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "type-1327"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-1324",
   "self_type" : "type-1324",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-1260",
   "self_type" : "type-1260",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-1271",
   "self_type" : "type-1271",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-1281",
   "self_type" : "type-1281",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-1443"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<int, 4>",
   "name" : "android::hardware::details::const_accessor<int, 4>",
   "referenced_type" : "type-1442",
   "self_type" : "type-1442",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIiLj4EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-1438"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "name" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "referenced_type" : "type-1437",
   "self_type" : "type-1437",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIjLj10EJEEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<FrameEventsDelta>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<FrameEventsDelta>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1227"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1226",
   "self_type" : "type-1226",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-533"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<Rect>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<Rect>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media4V1_04RectEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-1225",
   "self_type" : "type-1225",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-1228" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-517"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta>",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-519" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1368"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<int, 4> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<int, 4> >",
   "referenced_type" : "type-1367",
   "self_type" : "type-1367",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-1370" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIiLj4EJEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1240"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_handle>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_handle>",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-523" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_handleEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-532"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::V1_0::Rect>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::V1_0::Rect>",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-534" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media4V1_04RectEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1209"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-1208",
   "self_type" : "type-1208",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1209",
   "self_type" : "type-1209",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1369"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_array<int, 4> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<int, 4> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1368",
   "self_type" : "type-1368",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIiLj4EJEEEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1241"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1240",
   "self_type" : "type-1240",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_handleEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1313"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-1312",
   "self_type" : "type-1312",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-32" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-802"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1313",
   "self_type" : "type-1313",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>",
   "referenced_type" : "type-514",
   "self_type" : "type-514",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1231"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>",
   "referenced_type" : "type-1230",
   "self_type" : "type-1230",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1232"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1231",
   "self_type" : "type-1231",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-547"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<int, 4>",
   "name" : "android::hardware::details::std_array<int, 4>",
   "referenced_type" : "type-1436",
   "self_type" : "type-1436",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIiLj4EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned int, 10>",
   "name" : "android::hardware::details::std_array<unsigned int, 10>",
   "referenced_type" : "type-1435",
   "self_type" : "type-1435",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIjLj10EJEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer13requestBufferEiNSt3__18functionIFviRKNS0_5media4V1_09AnwBufferEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer13dequeueBufferEjjNS1_6common4V1_011PixelFormatEjbNSt3__18functionIFviiRKNS0_11hidl_handleERKNS4_22FrameEventHistoryDeltaEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16detachNextBufferENSt3__18functionIFviRKNS0_5media4V1_09AnwBufferERKNS0_11hidl_handleEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12attachBufferERKNS0_5media4V1_09AnwBufferENSt3__18functionIFviiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer11queueBufferEiRKNS4_16QueueBufferInputENSt3__18functionIFviRKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12cancelBufferEiRKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer5queryEiNSt3__18functionIFviiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer7connectERKNS_2spINS3_17IProducerListenerEEEibNSt3__18functionIFviRKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer10disconnectEiNS4_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17setSidebandStreamERKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer15allocateBuffersEjjNS1_6common4V1_011PixelFormatEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer15getConsumerNameENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17setDequeueTimeoutEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19getLastQueuedBufferENSt3__18functionIFviRKNS0_5media4V1_09AnwBufferERKNS0_11hidl_handleERKNS0_10hidl_arrayIfLj16EJEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer18getFrameTimestampsENSt3__18functionIFvRKNS4_22FrameEventHistoryDeltaEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer11getUniqueIdENSt3__18functionIFviyEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deadlineNs",
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "intervalNs",
     "field_offset" : 64,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "presentLatencyNs",
     "field_offset" : 128,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming",
   "referenced_type" : "type-774",
   "self_type" : "type-774",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16CompositorTimingE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "signalTimeNs",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot",
   "referenced_type" : "type-521",
   "self_type" : "type-521",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17FenceTimeSnapshotE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deltas",
     "referenced_type" : "type-577"
    },
    {
     "field_name" : "compositorTiming",
     "field_offset" : 128,
     "referenced_type" : "type-774"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta",
   "referenced_type" : "type-775",
   "self_type" : "type-775",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer22FrameEventHistoryDeltaE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "frameNumber",
     "field_offset" : 64,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "addPostCompositeCalled",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "addRetireCalled",
     "field_offset" : 136,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "addReleaseCalled",
     "field_offset" : 144,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "postedTimeNs",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "requestedPresentTimeNs",
     "field_offset" : 256,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "latchTimeNs",
     "field_offset" : 320,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "firstRefreshStartTimeNs",
     "field_offset" : 384,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "lastRefreshStartTimeNs",
     "field_offset" : 448,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "dequeueReadyTime",
     "field_offset" : 512,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "gpuCompositionDoneFence",
     "field_offset" : 576,
     "referenced_type" : "type-521"
    },
    {
     "field_name" : "displayPresentFence",
     "field_offset" : 832,
     "referenced_type" : "type-521"
    },
    {
     "field_name" : "displayRetireFence",
     "field_offset" : 1088,
     "referenced_type" : "type-521"
    },
    {
     "field_name" : "releaseFence",
     "field_offset" : 1344,
     "referenced_type" : "type-521"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 200,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "isAutoTimestamp",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-778"
    },
    {
     "field_name" : "crop",
     "field_offset" : 128,
     "referenced_type" : "type-534"
    },
    {
     "field_name" : "scalingMode",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "transform",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stickyTransform",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fence",
     "field_offset" : 384,
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "surfaceDamage",
     "field_offset" : 512,
     "referenced_type" : "type-574"
    },
    {
     "field_name" : "getFrameTimestamps",
     "field_offset" : 640,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 88,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16QueueBufferInputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformHint",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numPendingBuffers",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nextFrameNumber",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "bufferReplaced",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "frameTimestamps",
     "field_offset" : 256,
     "referenced_type" : "type-775"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput",
   "referenced_type" : "type-779",
   "self_type" : "type-779",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17QueueBufferOutputE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IProducerListener",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IProducerListener",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IProducerListener.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V1_017IProducerListener8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener16onBufferReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener18needsReleaseNotifyEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13requestBufferEiNSt3__18functionIFvNS3_6StatusERKNS1_6common4V1_214HardwareBufferEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13dequeueBufferERKNS4_18DequeueBufferInputENSt3__18functionIFvNS3_6StatusEiRKNS4_19DequeueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer16detachNextBufferENSt3__18functionIFvNS3_6StatusERKNS1_6common4V1_214HardwareBufferERKNS0_11hidl_handleEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12attachBufferERKNS1_6common4V1_214HardwareBufferEjNSt3__18functionIFvNS3_6StatusEibEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11queueBufferEiRKNS4_16QueueBufferInputENSt3__18functionIFvNS3_6StatusERKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12cancelBufferEiRKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer5queryEiNSt3__18functionIFviiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer7connectERKNS_2spINS3_17IProducerListenerEEENS3_14ConnectionTypeEbNSt3__18functionIFvNS3_6StatusERKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer10disconnectENS3_14ConnectionTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer15allocateBuffersEjjjy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer17setDequeueTimeoutEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11getUniqueIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer15getConsumerNameENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput",
   "referenced_type" : "type-1577",
   "self_type" : "type-1577",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer18DequeueBufferInputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufferAge",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "bufferNeedsReallocation",
     "field_offset" : 64,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "releaseAllBuffers",
     "field_offset" : 72,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "fence",
     "field_offset" : 128,
     "referenced_type" : "type-523"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput",
   "referenced_type" : "type-1578",
   "self_type" : "type-1578",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19DequeueBufferOutputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "isAutoTimestamp",
     "field_offset" : 64,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "crop",
     "field_offset" : 128,
     "referenced_type" : "type-1370"
    },
    {
     "field_name" : "transform",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "stickyTransform",
     "field_offset" : 288,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "fence",
     "field_offset" : 320,
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "surfaceDamage",
     "field_offset" : 448,
     "referenced_type" : "type-1432"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput",
   "referenced_type" : "type-1580",
   "self_type" : "type-1580",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer16QueueBufferInputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformHint",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "numPendingBuffers",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nextFrameNumber",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "bufferReplaced",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput",
   "referenced_type" : "type-1581",
   "self_type" : "type-1581",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer17QueueBufferOutputE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IProducerListener",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IProducerListener",
   "referenced_type" : "type-1399",
   "self_type" : "type-1399",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IProducerListener.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V2_017IProducerListener8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener17onBuffersReleasedEj"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-348"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mBase",
     "field_offset" : 32,
     "referenced_type" : "type-378"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::utils::B2HGraphicBufferProducer",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::utils::B2HGraphicBufferProducer",
   "record_kind" : "class",
   "referenced_type" : "type-804",
   "self_type" : "type-804",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/gui/include/gui/bufferqueue/2.0/B2HGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer13requestBufferEiNSt3__18functionIFvNS3_6StatusERKNS1_6common4V1_214HardwareBufferEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer13dequeueBufferERKNS3_22IGraphicBufferProducer18DequeueBufferInputENSt3__18functionIFvNS3_6StatusEiRKNS6_19DequeueBufferOutputEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer12detachBufferEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer16detachNextBufferENSt3__18functionIFvNS3_6StatusERKNS1_6common4V1_214HardwareBufferERKNS0_11hidl_handleEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer12attachBufferERKNS1_6common4V1_214HardwareBufferEjNSt3__18functionIFvNS3_6StatusEibEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer11queueBufferEiRKNS3_22IGraphicBufferProducer16QueueBufferInputENSt3__18functionIFvNS3_6StatusERKNS6_17QueueBufferOutputEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer12cancelBufferEiRKNS0_11hidl_handleE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer5queryEiNSt3__18functionIFviiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer7connectERKNS_2spINS3_17IProducerListenerEEENS3_14ConnectionTypeEbNSt3__18functionIFvNS3_6StatusERKNS3_22IGraphicBufferProducer17QueueBufferOutputEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer10disconnectENS3_14ConnectionTypeE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer15allocateBuffersEjjjy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer15allowAllocationEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer17setDequeueTimeoutEx"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer11getUniqueIdEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducer15getConsumerNameENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware8graphics11bufferqueue4V2_05utils24B2HGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mHandle",
     "referenced_type" : "type-802"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::utils::HFenceWrapper",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::utils::HFenceWrapper",
   "referenced_type" : "type-801",
   "self_type" : "type-801",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/gui/include/gui/bufferqueue/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_05utils13HFenceWrapperE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "description",
     "referenced_type" : "type-1447"
    },
    {
     "field_name" : "nativeHandle",
     "field_offset" : 320,
     "referenced_type" : "type-523"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::common::V1_2::HardwareBuffer",
   "name" : "android::hardware::graphics::common::V1_2::HardwareBuffer",
   "referenced_type" : "type-1559",
   "self_type" : "type-1559",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/1.2/android.hardware.graphics.common@1.2_genc++_headers/gen/android/hardware/graphics/common/1.2/types.h",
   "unique_id" : "_ZTSN7android8hardware8graphics6common4V1_214HardwareBufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1371"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<int, 4>",
   "name" : "android::hardware::hidl_array<int, 4>",
   "referenced_type" : "type-1370",
   "self_type" : "type-1370",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIiLj4EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1448"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned int, 10>",
   "name" : "android::hardware::hidl_array<unsigned int, 10>",
   "referenced_type" : "type-1447",
   "self_type" : "type-1447",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIjLj10EJEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-1254",
   "self_type" : "type-1254",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-524"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-523"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-1207"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-1212",
   "self_type" : "type-1212",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1208"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-1207",
   "self_type" : "type-1207",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1225"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-1224",
   "self_type" : "type-1224",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-1228" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-516"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta>",
   "name" : "android::hardware::hidl_vec<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta>",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-519" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1367"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_array<int, 4> >",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_array<int, 4> >",
   "referenced_type" : "type-1432",
   "self_type" : "type-1432",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-1370" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_10hidl_arrayIiLj4EJEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1239"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_handle>",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_handle>",
   "referenced_type" : "type-1238",
   "self_type" : "type-1238",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-523" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_11hidl_handleEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-531"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::media::V1_0::Rect>",
   "name" : "android::hardware::hidl_vec<android::hardware::media::V1_0::Rect>",
   "referenced_type" : "type-574",
   "self_type" : "type-574",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-534" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_5media4V1_04RectEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-514"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned char>",
   "name" : "android::hardware::hidl_vec<unsigned char>",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1230"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned int>",
   "name" : "android::hardware::hidl_vec<unsigned int>",
   "referenced_type" : "type-1229",
   "self_type" : "type-1229",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIjEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-1244",
   "self_type" : "type-1244",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nativeHandle",
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "attr",
     "field_offset" : 128,
     "referenced_type" : "type-771"
    }
   ],
   "linker_set_key" : "android::hardware::media::V1_0::AnwBuffer",
   "name" : "android::hardware::media::V1_0::AnwBuffer",
   "referenced_type" : "type-773",
   "self_type" : "type-773",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/1.0/android.hardware.media@1.0_genc++_headers/gen/android/hardware/media/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media4V1_09AnwBufferE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "generationNumber",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 192,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::hardware::media::V1_0::AnwBufferAttributes",
   "name" : "android::hardware::media::V1_0::AnwBufferAttributes",
   "referenced_type" : "type-771",
   "self_type" : "type-771",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/1.0/android.hardware.media@1.0_genc++_headers/gen/android/hardware/media/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media4V1_019AnwBufferAttributesE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::hardware::media::V1_0::Rect",
   "name" : "android::hardware::media::V1_0::Rect",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/1.0/android.hardware.media@1.0_genc++_headers/gen/android/hardware/media/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media4V1_04RectE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-523"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::Buffer",
   "name" : "android::hardware::media::bufferpool::V2_0::Buffer",
   "referenced_type" : "type-1458",
   "self_type" : "type-1458",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_06BufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "messageId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fromBufferId",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "toBufferId",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage",
   "name" : "android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage",
   "referenced_type" : "type-1461",
   "self_type" : "type-1461",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "transactionId",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "newStatus",
     "field_offset" : 96,
     "referenced_type" : "type-1459"
    },
    {
     "field_name" : "connectionId",
     "field_offset" : 128,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "targetConnectionId",
     "field_offset" : 192,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "timestampUs",
     "field_offset" : 256,
     "referenced_type" : "type-520"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::BufferStatusMessage",
   "name" : "android::hardware::media::bufferpool::V2_0::BufferStatusMessage",
   "referenced_type" : "type-1460",
   "self_type" : "type-1460",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IAccessor",
   "name" : "android::hardware::media::bufferpool::V2_0::IAccessor",
   "referenced_type" : "type-1393",
   "self_type" : "type-1393",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IAccessor.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_09IAccessorE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_09IAccessor8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessorD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor7connectERKNS_2spINS3_9IObserverEEENSt3__18functionIFvNS3_12ResultStatusERKNS5_INS3_11IConnectionEEExjRKNS0_12MQDescriptorINS3_19BufferStatusMessageELNS0_8MQFlavorE1EEERKNSH_INS3_25BufferInvalidationMessageELSJ_2EEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IAccessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IAccessorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IClientManager",
   "name" : "android::hardware::media::bufferpool::V2_0::IClientManager",
   "referenced_type" : "type-1415",
   "self_type" : "type-1415",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IClientManager.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_014IClientManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_014IClientManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_014IClientManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager14registerSenderERKNS_2spINS3_9IAccessorEEENSt3__18functionIFvNS3_12ResultStatusExEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_014IClientManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_014IClientManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_014IClientManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IConnection",
   "name" : "android::hardware::media::bufferpool::V2_0::IConnection",
   "referenced_type" : "type-1381",
   "self_type" : "type-1381",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IConnection.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_011IConnectionE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_011IConnection8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnectionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection5fetchEyjNSt3__18functionIFvNS3_12ResultStatusERKNS3_6BufferEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_011IConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_011IConnectionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IObserver",
   "name" : "android::hardware::media::bufferpool::V2_0::IObserver",
   "referenced_type" : "type-1387",
   "self_type" : "type-1387",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IObserver.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_09IObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_09IObserver8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver9onMessageExj"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-1259"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-1258",
   "self_type" : "type-1258",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-349",
   "self_type" : "type-349",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-1268",
   "self_type" : "type-1268",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-509"
    }
   ],
   "linker_set_key" : "android::sp<android::Fence>",
   "name" : "android::sp<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-390" ],
   "unique_id" : "_ZTSN7android2spINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-507"
    }
   ],
   "linker_set_key" : "android::sp<android::GraphicBuffer>",
   "name" : "android::sp<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-506",
   "self_type" : "type-506",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-420" ],
   "unique_id" : "_ZTSN7android2spINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-363"
    }
   ],
   "linker_set_key" : "android::sp<android::IBinder::DeathRecipient>",
   "name" : "android::sp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-364" ],
   "unique_id" : "_ZTSN7android2spINS_7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-360"
    }
   ],
   "linker_set_key" : "android::sp<android::IBinder>",
   "name" : "android::sp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-361" ],
   "unique_id" : "_ZTSN7android2spINS_7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-379"
    }
   ],
   "linker_set_key" : "android::sp<android::IGraphicBufferProducer>",
   "name" : "android::sp<android::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-380" ],
   "unique_id" : "_ZTSN7android2spINS_22IGraphicBufferProducerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "android::sp<android::IInterface>",
   "name" : "android::sp<android::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-357" ],
   "unique_id" : "_ZTSN7android2spINS_10IInterfaceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1354"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::allocator::V2_0::IAllocator>",
   "name" : "android::sp<android::hardware::graphics::allocator::V2_0::IAllocator>",
   "record_kind" : "class",
   "referenced_type" : "type-1353",
   "self_type" : "type-1353",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1356" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics9allocator4V2_010IAllocatorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-373"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer>",
   "name" : "android::sp<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-372",
   "self_type" : "type-372",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-374" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-366"
    }
   ],
