{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-43",
   "self_type" : "type-175",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-237",
   "self_type" : "type-236",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-14",
   "self_type" : "type-15",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-146",
   "self_type" : "type-181",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [8]",
   "name" : "unsigned int [8]",
   "referenced_type" : "type-44",
   "self_type" : "type-227",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-282",
   "self_type" : "type-281",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-288",
   "self_type" : "type-287",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-51",
   "self_type" : "type-50",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-92",
   "self_type" : "type-91",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-146",
   "self_type" : "type-320",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-44",
   "self_type" : "type-189",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-16",
   "self_type" : "type-333",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-71",
   "self_type" : "type-324",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-77",
   "self_type" : "type-76",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameLines",
     "referenced_type" : "type-193"
    }
   ],
   "linker_set_key" : "android::CallStack",
   "name" : "android::CallStack",
   "record_kind" : "class",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStackE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CallStack::StackDeleter",
   "name" : "android::CallStack::StackDeleter",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStack12StackDeleterE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-125"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-126" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "android::Vector<android::String8>",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-165" ],
   "unique_id" : "_ZTSN7android6VectorINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-188"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-189"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-189"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-60"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-104"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "type-129"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "type-29"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "type-130"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mQueue",
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "android::hardware::details::TaskRunner",
   "name" : "android::hardware::details::TaskRunner",
   "record_kind" : "class",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/TaskRunner.h",
   "unique_id" : "_ZTSN7android8hardware7details10TaskRunnerE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-42" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-28"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-39"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-71"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::HidlMemory>",
   "name" : "android::sp<android::hardware::HidlMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware10HidlMemoryEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-237" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-292" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-277",
   "self_type" : "type-277",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-265" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-237" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-292" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-265" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-310",
   "self_type" : "type-310",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-237" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-213",
   "self_type" : "type-213",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-293",
   "self_type" : "type-293",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-292" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-269",
   "self_type" : "type-269",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-265" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-165" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-313",
   "self_type" : "type-313",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-237" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-299",
   "self_type" : "type-299",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-292" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-265" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-263",
   "self_type" : "type-263",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-290",
   "self_type" : "type-290",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-237"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-236"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-233"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-230"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-237"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-237"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-176"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-174"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-175"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-174",
   "self_type" : "type-174",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-175"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-175"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-175"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<void> &&",
   "name" : "android::hardware::Return<void> &&",
   "referenced_type" : "type-120",
   "self_type" : "type-122",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Status &&",
   "name" : "android::hardware::Status &&",
   "referenced_type" : "type-103",
   "self_type" : "type-109",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char> &&",
   "name" : "android::hardware::details::hidl_pointer<const char> &&",
   "referenced_type" : "type-39",
   "self_type" : "type-87",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::details::return_status &&",
   "name" : "android::hardware::details::return_status &&",
   "referenced_type" : "type-112",
   "self_type" : "type-114",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::hidl_handle &&",
   "name" : "android::hardware::hidl_handle &&",
   "referenced_type" : "type-28",
   "self_type" : "type-33",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::hidl_memory &&",
   "name" : "android::hardware::hidl_memory &&",
   "referenced_type" : "type-60",
   "self_type" : "type-65",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::hidl_string &&",
   "name" : "android::hardware::hidl_string &&",
   "referenced_type" : "type-38",
   "self_type" : "type-55",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::hardware::HidlMemory> &&",
   "name" : "android::sp<android::hardware::HidlMemory> &&",
   "referenced_type" : "type-93",
   "self_type" : "type-99",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  }
 ]
}
