{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-156",
   "self_type" : "type-735",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-24",
   "self_type" : "type-23",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-10",
   "self_type" : "type-159",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [4]",
   "name" : "int [4]",
   "referenced_type" : "type-10",
   "self_type" : "type-545",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-8",
   "self_type" : "type-1087",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [10]",
   "name" : "unsigned int [10]",
   "referenced_type" : "type-2",
   "self_type" : "type-1155",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [8]",
   "name" : "unsigned int [8]",

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-594",
   "self_type" : "type-593",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "name" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "referenced_type" : "type-871",
   "self_type" : "type-870",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-8",
   "self_type" : "type-374",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-195",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-41",
   "self_type" : "type-225",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-538",
   "self_type" : "type-889",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::shared_ptr<C2Allocator> *const",
   "name" : "std::shared_ptr<C2Allocator> *const",
   "referenced_type" : "type-1246",
   "self_type" : "type-1248",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::shared_ptr<C2Allocator> *const",
   "name" : "std::shared_ptr<C2Allocator> *const",
   "referenced_type" : "type-384",
   "self_type" : "type-386",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > > *const",
   "name" : "std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > > *const",
   "referenced_type" : "type-819",
   "self_type" : "type-821",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > > *const",
   "referenced_type" : "type-812",
   "self_type" : "type-814",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "referenced_type" : "type-792",
   "self_type" : "type-795",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "name" : "std::vector<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> >, std::allocator<std::unique_ptr<C2SettingResult, std::default_delete<C2SettingResult> > > > *const",
   "referenced_type" : "type-865",
   "self_type" : "type-868",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1199"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-1188"
    }
   ],
   "linker_set_key" : "C2BasicGraphicBlockPool",
   "name" : "C2BasicGraphicBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-1198",
   "self_type" : "type-1198",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BufferPriv.h",
   "unique_id" : "_ZTS23C2BasicGraphicBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI23C2BasicGraphicBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK23C2BasicGraphicBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK23C2BasicGraphicBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN23C2BasicGraphicBlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN23C2BasicGraphicBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN23C2BasicGraphicBlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1190"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-1188"
    }
   ],
   "linker_set_key" : "C2BasicLinearBlockPool",
   "name" : "C2BasicLinearBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-1187",
   "self_type" : "type-1187",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BufferPriv.h",
   "unique_id" : "_ZTS22C2BasicLinearBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI22C2BasicLinearBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK22C2BasicLinearBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK22C2BasicLinearBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN22C2BasicLinearBlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BasicLinearBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BasicLinearBlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-227"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-223"
    },
    {
     "access" : "private",
     "field_name" : "mLocalId",
     "field_offset" : 96,
     "referenced_type" : "type-225"
    },
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 160,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "C2BufferQueueBlockPool",
   "name" : "C2BufferQueueBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 28,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BqBufferPriv.h",
   "unique_id" : "_ZTS22C2BufferQueueBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI22C2BufferQueueBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK22C2BufferQueueBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK22C2BufferQueueBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPoolD0Ev"
    },
    {
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPool17setRenderCallbackERKNSt3__18functionIFvyixEEE"
    },
    {
     "mangled_component_name" : "_ZN22C2BufferQueueBlockPool17configureProducerERKN7android2spINS0_8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2ComponentFactory",
   "name" : "C2ComponentFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1022",
   "self_type" : "type-1022",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ComponentFactory.h",
   "unique_id" : "_ZTS18C2ComponentFactory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18C2ComponentFactory"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2ComponentFactory15createComponentEjPNSt3__110shared_ptrI11C2ComponentEENS0_8functionIFvPS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2ComponentFactory15createInterfaceEjPNSt3__110shared_ptrI20C2ComponentInterfaceEENS0_8functionIFvPS2_EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18C2ComponentFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18C2ComponentFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-623"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<char>",
   "name" : "C2FieldSupportedValuesHelper<char>",
   "record_kind" : "class",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-651"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<float>",
   "name" : "C2FieldSupportedValuesHelper<float>",
   "record_kind" : "class",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-632"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<int>",
   "name" : "C2FieldSupportedValuesHelper<int>",
   "record_kind" : "class",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-641"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<long long>",
   "name" : "C2FieldSupportedValuesHelper<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIxE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-628"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<unsigned char>",
   "name" : "C2FieldSupportedValuesHelper<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-636"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<unsigned int>",
   "name" : "C2FieldSupportedValuesHelper<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-645"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesHelper<unsigned long long>",
   "name" : "C2FieldSupportedValuesHelper<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS28C2FieldSupportedValuesHelperIyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2FieldUtils",
   "name" : "C2FieldUtils",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS12C2FieldUtils"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "C2FieldUtils::Info",
   "name" : "C2FieldUtils::Info",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTSN12C2FieldUtils4InfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "C2FieldUtils::Iterator",
   "name" : "C2FieldUtils::Iterator",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTSN12C2FieldUtils8IteratorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN12C2FieldUtils8IteratorE"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils8IteratordeEv"
    },
    {
     "mangled_component_name" : "_ZN12C2FieldUtils8IteratorppEv"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils8IteratoreqERKS0_"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils8IteratorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils8IteratorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "C2FieldUtils::List",
   "name" : "C2FieldUtils::List",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTSN12C2FieldUtils4ListE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN12C2FieldUtils4ListE"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils4List5beginEv"
    },
    {
     "mangled_component_name" : "_ZNK12C2FieldUtils4List3endEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils4ListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12C2FieldUtils4ListD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-50"
    },
    {
     "access" : "protected",
     "field_name" : "mReflector",
     "field_offset" : 64,
     "referenced_type" : "type-51"
    },
    {
     "access" : "protected",
     "field_name" : "_mFactory",
     "field_offset" : 128,
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper",
   "name" : "C2InterfaceHelper",
   "record_kind" : "class",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTS17C2InterfaceHelper",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2InterfaceHelper"
    },
    {
     "mangled_component_name" : "_ZN17C2InterfaceHelper6configERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEE13c2_blocking_tPNS1_INS0_10unique_ptrI15C2SettingResultNS0_14default_deleteISB_EEEENS4_ISE_EEEEbPNS1_INS0_10shared_ptrIS2_EENS4_ISJ_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelperD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2InterfaceHelper::Factory",
   "name" : "C2InterfaceHelper::Factory",
   "record_kind" : "class",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper7FactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN17C2InterfaceHelper7FactoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2InterfaceHelper7Factory12getReflectorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2InterfaceHelper7Factory14getParamHelperERKNS_8ParamRefE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelper7FactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2InterfaceHelper7FactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mParam",
     "referenced_type" : "type-53"
    },
    {
     "access" : "protected",
     "field_name" : "mFieldId",
     "field_offset" : 32,
     "referenced_type" : "type-63"
    },
    {
     "access" : "protected",
     "field_name" : "mPossible",
     "field_offset" : 96,
     "referenced_type" : "type-64"
    },
    {
     "access" : "protected",
     "field_name" : "mSupported",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::FieldHelper",
   "name" : "C2InterfaceHelper::FieldHelper",
   "record_kind" : "class",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper11FieldHelperE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "_mTypedParam",
     "field_offset" : 32,
     "referenced_type" : "type-71"
    },
    {
     "access" : "private",
     "field_name" : "_mHelper",
     "field_offset" : 96,
     "referenced_type" : "type-72"
    },
    {
     "access" : "private",
     "field_name" : "_mReflector",
     "field_offset" : 160,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::Param<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "name" : "C2InterfaceHelper::Param<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 28,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-74" ],
   "unique_id" : "_ZTSN17C2InterfaceHelper5ParamI13C2GlobalParamI6C2Info21C2StoreIonUsageStructLi16386EvEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-85"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mTypedParam",
     "field_offset" : 32,
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::ParamBuilder<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "name" : "C2InterfaceHelper::ParamBuilder<C2GlobalParam<C2Info, C2StoreIonUsageStruct, 16386, void> >",
   "record_kind" : "class",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN17C2InterfaceHelper12ParamBuilderI13C2GlobalParamI6C2Info21C2StoreIonUsageStructLi16386EvEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::ParamHelper",
   "name" : "C2InterfaceHelper::ParamHelper",
   "record_kind" : "class",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper11ParamHelperE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mRef",
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "C2InterfaceHelper::ParamRef",
   "name" : "C2InterfaceHelper::ParamRef",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTSN17C2InterfaceHelper8ParamRefE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-749"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<char>",
   "name" : "C2ParamFieldValuesBuilder<char>",
   "record_kind" : "class",
   "referenced_type" : "type-748",
   "self_type" : "type-748",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIcE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIcE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIcED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIcED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-754"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<float>",
   "name" : "C2ParamFieldValuesBuilder<float>",
   "record_kind" : "class",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIfE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIfED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIfED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-1318"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<int>",
   "name" : "C2ParamFieldValuesBuilder<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIiE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIiE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIiED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIiED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-751"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<long long>",
   "name" : "C2ParamFieldValuesBuilder<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIxE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIxE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIxED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIxED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<unsigned char>",
   "name" : "C2ParamFieldValuesBuilder<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-746",
   "self_type" : "type-746",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIhE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIhE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIhED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIhED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-1314"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<unsigned int>",
   "name" : "C2ParamFieldValuesBuilder<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-1313",
   "self_type" : "type-1313",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIjE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIjE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIjED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-1309"
    }
   ],
   "linker_set_key" : "C2ParamFieldValuesBuilder<unsigned long long>",
   "name" : "C2ParamFieldValuesBuilder<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-1308",
   "self_type" : "type-1308",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS25C2ParamFieldValuesBuilderIyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25C2ParamFieldValuesBuilderIyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25C2ParamFieldValuesBuilderIyED0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2ParamUtils",
   "name" : "C2ParamUtils",
   "record_kind" : "class",
   "referenced_type" : "type-917",
   "self_type" : "type-917",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2ParamUtils.h",
   "unique_id" : "_ZTS12C2ParamUtils"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLibHandle",
     "referenced_type" : "type-129"
    },
    {
     "access" : "private",
     "field_name" : "mCreateBlockPool",
     "field_offset" : 32,
     "referenced_type" : "type-1231"
    },
    {
     "access" : "private",
     "field_name" : "mCreateAllocator",
     "field_offset" : 64,
     "referenced_type" : "type-1234"
    }
   ],
   "linker_set_key" : "C2PlatformStorePluginLoader",
   "name" : "C2PlatformStorePluginLoader",
   "record_kind" : "class",
   "referenced_type" : "type-1230",
   "self_type" : "type-1230",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformStorePluginLoader.h",
   "unique_id" : "_ZTS27C2PlatformStorePluginLoader"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1208"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 32,
     "referenced_type" : "type-1188"
    },
    {
     "access" : "private",
     "field_name" : "mLocalId",
     "field_offset" : 96,
     "referenced_type" : "type-225"
    },
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 160,
     "referenced_type" : "type-1207"
    }
   ],
   "linker_set_key" : "C2PooledBlockPool",
   "name" : "C2PooledBlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-1206",
   "self_type" : "type-1206",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2BufferPriv.h",
   "unique_id" : "_ZTS17C2PooledBlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2PooledBlockPool"
    },
    {
     "mangled_component_name" : "_ZNK17C2PooledBlockPool10getLocalIdEv"
    },
    {
     "mangled_component_name" : "_ZNK17C2PooledBlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN17C2PooledBlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN17C2PooledBlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2PooledBlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2PooledBlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-47"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "_mStructs",
     "field_offset" : 64,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "C2ReflectorHelper",
   "name" : "C2ReflectorHelper",
   "record_kind" : "class",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "unique_id" : "_ZTS17C2ReflectorHelper",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2ReflectorHelper"
    },
    {
     "mangled_component_name" : "_ZNK17C2ReflectorHelper8describeEN7C2Param9CoreIndexE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2ReflectorHelperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2ReflectorHelperD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mConflicts",
     "referenced_type" : "type-855"
    }
   ],
   "linker_set_key" : "C2SettingConflictsBuilder",
   "name" : "C2SettingConflictsBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-854",
   "self_type" : "type-854",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS25C2SettingConflictsBuilder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mParamField",
     "referenced_type" : "type-1325"
    },
    {
     "access" : "private",
     "field_name" : "_mResult",
     "field_offset" : 96,
     "referenced_type" : "type-1326"
    }
   ],
   "linker_set_key" : "C2SettingResultBuilder",
   "name" : "C2SettingResultBuilder",
   "referenced_type" : "type-1324",
   "self_type" : "type-1324",
   "size" : 44,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS22C2SettingResultBuilder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mStatus",
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "_mResults",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "C2SettingResultsBuilder",
   "name" : "C2SettingResultsBuilder",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "unique_id" : "_ZTS23C2SettingResultsBuilder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-713"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<char>",
   "name" : "C2SupportedFlags<char>",
   "record_kind" : "class",
   "referenced_type" : "type-712",
   "self_type" : "type-712",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-610"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<float>",
   "name" : "C2SupportedFlags<float>",
   "record_kind" : "class",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-722"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<int>",
   "name" : "C2SupportedFlags<int>",
   "record_kind" : "class",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-729"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<long long>",
   "name" : "C2SupportedFlags<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-728",
   "self_type" : "type-728",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIxE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-717"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<unsigned char>",
   "name" : "C2SupportedFlags<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-716",
   "self_type" : "type-716",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-726"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<unsigned int>",
   "name" : "C2SupportedFlags<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-725",
   "self_type" : "type-725",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-607"
    }
   ],
   "linker_set_key" : "C2SupportedFlags<unsigned long long>",
   "name" : "C2SupportedFlags<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS16C2SupportedFlagsIyE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 8,
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 16,
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 24,
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 32,
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "C2SupportedRange<char>",
   "name" : "C2SupportedRange<char>",
   "record_kind" : "class",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 5,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTS16C2SupportedRangeIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "C2SupportedRange<float>",
   "name" : "C2SupportedRange<float>",
   "record_kind" : "class",
   "referenced_type" : "type-708",
   "self_type" : "type-708",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTS16C2SupportedRangeIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "C2SupportedRange<int>",
   "name" : "C2SupportedRange<int>",
   "record_kind" : "class",
   "referenced_type" : "type-694",
   "self_type" : "type-694",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS16C2SupportedRangeIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-619"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 64,
     "referenced_type" : "type-619"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 128,
     "referenced_type" : "type-619"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 192,
     "referenced_type" : "type-619"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 256,
     "referenced_type" : "type-619"
    }
   ],
   "linker_set_key" : "C2SupportedRange<long long>",
   "name" : "C2SupportedRange<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-701",
   "self_type" : "type-701",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTS16C2SupportedRangeIxE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 8,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 24,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2SupportedRange<unsigned char>",
   "name" : "C2SupportedRange<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-690",
   "self_type" : "type-690",
   "size" : 5,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS16C2SupportedRangeIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2SupportedRange<unsigned int>",
   "name" : "C2SupportedRange<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-697",
   "self_type" : "type-697",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS16C2SupportedRangeIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mMin",
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "_mMax",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "_mStep",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "_mNum",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "_mDenom",
     "field_offset" : 256,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "C2SupportedRange<unsigned long long>",
   "name" : "C2SupportedRange<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-706",
   "self_type" : "type-706",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS16C2SupportedRangeIyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-614"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<char>",
   "name" : "C2SupportedValueSet<char>",
   "record_kind" : "class",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIcE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-621"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<float>",
   "name" : "C2SupportedValueSet<float>",
   "record_kind" : "class",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIfE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-1307"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<int>",
   "name" : "C2SupportedValueSet<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1306",
   "self_type" : "type-1306",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIiE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-618"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<long long>",
   "name" : "C2SupportedValueSet<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIxE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-616"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<unsigned char>",
   "name" : "C2SupportedValueSet<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIhE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-1305"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<unsigned int>",
   "name" : "C2SupportedValueSet<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-1304",
   "self_type" : "type-1304",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIjE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mValues",
     "referenced_type" : "type-1303"
    }
   ],
   "linker_set_key" : "C2SupportedValueSet<unsigned long long>",
   "name" : "C2SupportedValueSet<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS19C2SupportedValueSetIyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<char>",
   "name" : "_C2FieldValueHelper<char>",
   "referenced_type" : "type-1294",
   "self_type" : "type-1294",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIcE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<float>",
   "name" : "_C2FieldValueHelper<float>",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIfE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<int>",
   "name" : "_C2FieldValueHelper<int>",
   "referenced_type" : "type-1292",
   "self_type" : "type-1292",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIiE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<long long>",
   "name" : "_C2FieldValueHelper<long long>",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIxE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<uint8_t>",
   "name" : "_C2FieldValueHelper<uint8_t>",
   "referenced_type" : "type-1293",
   "self_type" : "type-1293",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIhE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<unsigned int>",
   "name" : "_C2FieldValueHelper<unsigned int>",
   "referenced_type" : "type-1291",
   "self_type" : "type-1291",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIjE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FieldValueHelper<unsigned long long>",
   "name" : "_C2FieldValueHelper<unsigned long long>",
   "referenced_type" : "type-1290",
   "self_type" : "type-1290",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS19_C2FieldValueHelperIyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<12, 13, 22>",
   "name" : "_c2_map_errno_impl<12, 13, 22>",
   "referenced_type" : "type-1172",
   "self_type" : "type-1172",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi12ELi13ELi22EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<13, 22>",
   "name" : "_c2_map_errno_impl<13, 22>",
   "referenced_type" : "type-1180",
   "self_type" : "type-1180",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi13ELi22EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<13>",
   "name" : "_c2_map_errno_impl<13>",
   "referenced_type" : "type-1200",
   "self_type" : "type-1200",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi13EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<22>",
   "name" : "_c2_map_errno_impl<22>",
   "referenced_type" : "type-1191",
   "self_type" : "type-1191",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJLi22EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_map_errno_impl<>",
   "name" : "_c2_map_errno_impl<>",
   "referenced_type" : "type-1210",
   "self_type" : "type-1210",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2ErrnoUtils.h",
   "unique_id" : "_ZTS18_c2_map_errno_implIJEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_reduce_enum_to_underlying_type<int, false>",
   "name" : "_c2_reduce_enum_to_underlying_type<int, false>",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTS34_c2_reduce_enum_to_underlying_typeIiLb0EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_reduce_enum_to_underlying_type<unsigned int, false>",
   "name" : "_c2_reduce_enum_to_underlying_type<unsigned int, false>",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS34_c2_reduce_enum_to_underlying_typeIjLb0EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_reduce_enum_to_underlying_type<unsigned long long, false>",
   "name" : "_c2_reduce_enum_to_underlying_type<unsigned long long, false>",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTS34_c2_reduce_enum_to_underlying_typeIyLb0EE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1015"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 32,
     "referenced_type" : "type-1013"
    }
   ],
   "linker_set_key" : "android::C2AllocatorGralloc",
   "name" : "android::C2AllocatorGralloc",
   "record_kind" : "class",
   "referenced_type" : "type-1012",
   "self_type" : "type-1012",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2AllocatorGralloc.h",
   "unique_id" : "_ZTSN7android18C2AllocatorGrallocE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18C2AllocatorGrallocE"
    },
    {
     "mangled_component_name" : "_ZNK7android18C2AllocatorGralloc7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK7android18C2AllocatorGralloc5getIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android18C2AllocatorGralloc9getTraitsEv"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator19newLinearAllocationEj13C2MemoryUsagePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator21priorLinearAllocationEPK13native_handlePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN7android18C2AllocatorGralloc20newGraphicAllocationEjjj13C2MemoryUsagePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN7android18C2AllocatorGralloc22priorGraphicAllocationEPK13native_handlePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18C2AllocatorGrallocD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18C2AllocatorGrallocD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-94"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mInit",
     "field_offset" : 32,
     "referenced_type" : "type-88"
    },
    {
     "access" : "private",
     "field_name" : "mIonFd",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapperLock",
     "field_offset" : 96,
     "referenced_type" : "type-89"
    },
    {
     "access" : "private",
     "field_name" : "mTraits",
     "field_offset" : 128,
     "referenced_type" : "type-90"
    },
    {
     "access" : "private",
     "field_name" : "mBlockSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapper",
     "field_offset" : 256,
     "referenced_type" : "type-91"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapperLru",
     "field_offset" : 448,
     "referenced_type" : "type-92"
    },
    {
     "access" : "private",
     "field_name" : "mUsageMapperCache",
     "field_offset" : 544,
     "referenced_type" : "type-93"
    }
   ],
   "linker_set_key" : "android::C2AllocatorIon",
   "name" : "android::C2AllocatorIon",
   "record_kind" : "class",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 88,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2AllocatorIon.h",
   "unique_id" : "_ZTSN7android14C2AllocatorIonE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14C2AllocatorIonE"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon7getNameEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon5getIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon9getTraitsEv"
    },
    {
     "mangled_component_name" : "_ZN7android14C2AllocatorIon19newLinearAllocationEj13C2MemoryUsagePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN7android14C2AllocatorIon21priorLinearAllocationEPK13native_handlePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator20newGraphicAllocationEjjj13C2MemoryUsagePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator22priorGraphicAllocationEPK13native_handlePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14C2AllocatorIonD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14C2AllocatorIonD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android14C2AllocatorIon6statusEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "android::C2AllocatorIon::MapperKeyHash",
   "name" : "android::C2AllocatorIon::MapperKeyHash",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2AllocatorIon.h",
   "unique_id" : "_ZTSN7android14C2AllocatorIon13MapperKeyHashE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1025"
    }
   ],
   "linker_set_key" : "android::C2PlatformAllocatorStore",
   "name" : "android::C2PlatformAllocatorStore",
   "record_kind" : "class",
   "referenced_type" : "type-1024",
   "self_type" : "type-1024",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/C2PlatformSupport.h",
   "unique_id" : "_ZTSN7android24C2PlatformAllocatorStoreE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android24C2PlatformAllocatorStoreE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore17listAllocators_nbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2AllocatorStore14fetchAllocatorEjPNSt3__110shared_ptrI11C2AllocatorEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android24C2PlatformAllocatorStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android24C2PlatformAllocatorStoreD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-137" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::GraphicBuffer>",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-133" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Point>",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Rect>",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-141" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Region>",
   "name" : "android::LightFlattenable<android::Region>",
   "record_kind" : "class",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_6RegionEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-138"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Point>",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-145" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Rect>",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-147" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_4RectEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-236"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::Fence>",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-237" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-464"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-465" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-449"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-450" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1225"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-1224",
   "self_type" : "type-1224",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1228"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-1227",
   "self_type" : "type-1227",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-463"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-209"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-928"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-927",
   "self_type" : "type-927",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-931",
   "self_type" : "type-931",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-935",
   "self_type" : "type-935",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-923",
   "self_type" : "type-923",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Singleton<android::GraphicBufferMapper>",
   "name" : "android::Singleton<android::GraphicBufferMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Singleton.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android9SingletonINS_19GraphicBufferMapperEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-194"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-194"
    }
   ],
   "linker_set_key" : "android::Vector<android::Rect>",
   "name" : "android::Vector<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-200" ],
   "unique_id" : "_ZTSN7android6VectorINS_4RectEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_4RectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-129"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-195"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-195"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-448"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-450",
   "self_type" : "type-450",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<bool, bool>",
   "name" : "android::base::EagerEvaluator<bool, bool>",
   "referenced_type" : "type-743",
   "self_type" : "type-743",
   "size" : 2,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-106", "type-106" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIbbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, char *>",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "type-330",
   "self_type" : "type-330",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-155", "type-155" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, const char *>",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-155", "type-213" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcPKcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, char *>",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-213", "type-155" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcPcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, const char *>",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "type-290",
   "self_type" : "type-290",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-213", "type-213" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "type-936",
   "self_type" : "type-936",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-937", "type-937" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "type-984",
   "self_type" : "type-984",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-937", "type-985" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaPaEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "type-372",
   "self_type" : "type-372",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-373", "type-373" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-373", "type-7" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhPhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "type-1021",
   "self_type" : "type-1021",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-985", "type-937" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaPKaEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "type-1043",
   "self_type" : "type-1043",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-985", "type-985" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "type-804",
   "self_type" : "type-804",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-373" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhPKhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "type-906",
   "self_type" : "type-906",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-7" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "name" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "type-864",
   "self_type" : "type-864",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIjjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "type-259"
    }
   ],
   "linker_set_key" : "android::base::ErrnoRestorer",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base13ErrnoRestorerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-1065"
    }
   ],
   "linker_set_key" : "android::base::LogMessage",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogMessageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "android::base::LogdLogger",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogdLoggerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "type-1076"
    }
   ],
   "linker_set_key" : "android::base::ScopedLogSeverity",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base17ScopedLogSeverityE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-962",
   "self_type" : "type-962",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-943"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-927"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-954",
   "self_type" : "type-954",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-170"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-169"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::bufferqueue::V2_0::Status>",
   "name" : "android::hardware::Return<android::hardware::graphics::bufferqueue::V2_0::Status>",
   "record_kind" : "class",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-173" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_8graphics11bufferqueue4V2_06StatusEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-170"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-400"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error>",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error>",
   "record_kind" : "class",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-401" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_8graphics6mapper4V2_05ErrorEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-170"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::hardware::Return<unsigned long long>",
   "name" : "android::hardware::Return<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIyEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-170"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "type-1040"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "type-106"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "type-1041"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "type-1042"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-1039",
   "self_type" : "type-1039",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-996",
   "self_type" : "type-996",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-1008",
   "self_type" : "type-1008",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-1009",
   "self_type" : "type-1009",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-1148"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<int, 4>",
   "name" : "android::hardware::details::const_accessor<int, 4>",
   "referenced_type" : "type-1147",
   "self_type" : "type-1147",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIiLj4EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-1143"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "name" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "referenced_type" : "type-1142",
   "self_type" : "type-1142",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIjLj10EJEEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-961"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-960",
   "self_type" : "type-960",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-960"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-959",
   "self_type" : "type-959",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-962" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-542"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<int, 4> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<int, 4> >",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-544" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIiLj4EJEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-973"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_handle>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_handle>",
   "referenced_type" : "type-972",
   "self_type" : "type-972",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-944" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_handleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-940"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-939",
   "self_type" : "type-939",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-214" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-940",
   "self_type" : "type-940",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-946"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-945",
   "self_type" : "type-945",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-157" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-946",
   "self_type" : "type-946",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-543"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_array<int, 4> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<int, 4> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIiLj4EJEEEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-974"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-973",
   "self_type" : "type-973",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_handleEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1027"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-1026",
   "self_type" : "type-1026",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-158" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1027",
   "self_type" : "type-1027",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-965"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>",
   "referenced_type" : "type-964",
   "self_type" : "type-964",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-41"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-965",
   "self_type" : "type-965",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-981",
   "self_type" : "type-981",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-171"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<int, 4>",
   "name" : "android::hardware::details::std_array<int, 4>",
   "referenced_type" : "type-1141",
   "self_type" : "type-1141",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIiLj4EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned int, 10>",
   "name" : "android::hardware::details::std_array<unsigned int, 10>",
   "referenced_type" : "type-1140",
   "self_type" : "type-1140",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIjLj10EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mHandle",
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::utils::HFenceWrapper",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::utils::HFenceWrapper",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/types.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_05utils13HFenceWrapperE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<int, 4>",
   "name" : "android::hardware::hidl_array<int, 4>",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIiLj4EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1155"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned int, 10>",
   "name" : "android::hardware::hidl_array<unsigned int, 10>",
   "referenced_type" : "type-1154",
   "self_type" : "type-1154",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIjLj10EJEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-927"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-990",
   "self_type" : "type-990",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-945"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-944",
   "self_type" : "type-944",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-944"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-938"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-943",
   "self_type" : "type-943",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-939"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-938",
   "self_type" : "type-938",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-959"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-958",
   "self_type" : "type-958",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-962" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-541"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_array<int, 4> >",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_array<int, 4> >",
   "referenced_type" : "type-540",
   "self_type" : "type-540",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-544" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_10hidl_arrayIiLj4EJEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-972"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_handle>",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_handle>",
   "referenced_type" : "type-971",
   "self_type" : "type-971",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-944" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_11hidl_handleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-964"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned int>",
   "name" : "android::hardware::hidl_vec<unsigned int>",
   "referenced_type" : "type-963",
   "self_type" : "type-963",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIjEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-538"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-538"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-978",
   "self_type" : "type-978",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-944"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::Buffer",
   "name" : "android::hardware::media::bufferpool::V2_0::Buffer",
   "referenced_type" : "type-1167",
   "self_type" : "type-1167",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_06BufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "messageId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fromBufferId",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "toBufferId",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage",
   "name" : "android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage",
   "referenced_type" : "type-1170",
   "self_type" : "type-1170",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_025BufferInvalidationMessageE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "transactionId",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "newStatus",
     "field_offset" : 96,
     "referenced_type" : "type-1168"
    },
    {
     "field_name" : "connectionId",
     "field_offset" : 128,
     "referenced_type" : "type-619"
    },
    {
     "field_name" : "targetConnectionId",
     "field_offset" : 192,
     "referenced_type" : "type-619"
    },
    {
     "field_name" : "timestampUs",
     "field_offset" : 256,
     "referenced_type" : "type-619"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::BufferStatusMessage",
   "name" : "android::hardware::media::bufferpool::V2_0::BufferStatusMessage",
   "referenced_type" : "type-1169",
   "self_type" : "type-1169",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_019BufferStatusMessageE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IAccessor",
   "name" : "android::hardware::media::bufferpool::V2_0::IAccessor",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IAccessor.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_09IAccessorE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_09IAccessor8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessorD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IAccessor7connectERKNS_2spINS3_9IObserverEEENSt3__18functionIFvNS3_12ResultStatusERKNS5_INS3_11IConnectionEEExjRKNS0_12MQDescriptorINS3_19BufferStatusMessageELNS0_8MQFlavorE1EEERKNSH_INS3_25BufferInvalidationMessageELSJ_2EEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IAccessorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IAccessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IAccessorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IClientManager",
   "name" : "android::hardware::media::bufferpool::V2_0::IClientManager",
   "referenced_type" : "type-1113",
   "self_type" : "type-1113",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IClientManager.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_014IClientManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_014IClientManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_014IClientManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_014IClientManager14registerSenderERKNS_2spINS3_9IAccessorEEENSt3__18functionIFvNS3_12ResultStatusExEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_014IClientManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_014IClientManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_014IClientManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IConnection",
   "name" : "android::hardware::media::bufferpool::V2_0::IConnection",
   "referenced_type" : "type-1082",
   "self_type" : "type-1082",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IConnection.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_011IConnectionE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_011IConnection8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnectionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_011IConnection5fetchEyjNSt3__18functionIFvNS3_12ResultStatusERKNS3_6BufferEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_011IConnectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_011IConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_011IConnectionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "android::hardware::media::bufferpool::V2_0::IObserver",
   "name" : "android::hardware::media::bufferpool::V2_0::IObserver",
   "referenced_type" : "type-1092",
   "self_type" : "type-1092",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/bufferpool/2.0/android.hardware.media.bufferpool@2.0_genc++_headers/gen/android/hardware/media/bufferpool/2.0/IObserver.h",
   "unique_id" : "_ZTSN7android8hardware5media10bufferpool4V2_09IObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media10bufferpool4V2_09IObserver8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media10bufferpool4V2_09IObserver9onMessageExj"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media10bufferpool4V2_09IObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5media10bufferpool4V2_09IObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-995"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-994",
   "self_type" : "type-994",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-927"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-1002",
   "self_type" : "type-1002",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "android::sp<android::Fence>",
   "name" : "android::sp<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-253" ],
   "unique_id" : "_ZTSN7android2spINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-242"
    }
   ],
   "linker_set_key" : "android::sp<android::GraphicBuffer>",
   "name" : "android::sp<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-244" ],
   "unique_id" : "_ZTSN7android2spINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1061"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::allocator::V2_0::IAllocator>",
   "name" : "android::sp<android::hardware::graphics::allocator::V2_0::IAllocator>",
   "record_kind" : "class",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1063" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics9allocator4V2_010IAllocatorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer>",
   "name" : "android::sp<android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-269" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1103"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::bufferqueue::V2_0::IProducerListener>",
   "name" : "android::sp<android::hardware::graphics::bufferqueue::V2_0::IProducerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1105" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics11bufferqueue4V2_017IProducerListenerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::graphics::mapper::V2_0::IMapper>",
   "name" : "android::sp<android::hardware::graphics::mapper::V2_0::IMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-341" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware8graphics6mapper4V2_07IMapperEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-989"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-988",
   "self_type" : "type-988",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-990" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1097"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::media::bufferpool::V2_0::IAccessor>",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IAccessor>",
   "record_kind" : "class",
   "referenced_type" : "type-1096",
   "self_type" : "type-1096",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1098" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware5media10bufferpool4V2_09IAccessorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1112"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::media::bufferpool::V2_0::IClientManager>",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IClientManager>",
   "record_kind" : "class",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1113" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware5media10bufferpool4V2_014IClientManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1081"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::media::bufferpool::V2_0::IConnection>",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IConnection>",
   "record_kind" : "class",
   "referenced_type" : "type-1080",
   "self_type" : "type-1080",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1082" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware5media10bufferpool4V2_011IConnectionEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1091"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::media::bufferpool::V2_0::IObserver>",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::IObserver>",
   "record_kind" : "class",
   "referenced_type" : "type-1090",
   "self_type" : "type-1090",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1092" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware5media10bufferpool4V2_09IObserverEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1118"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::media::bufferpool::V2_0::implementation::ClientManager>",
   "name" : "android::sp<android::hardware::media::bufferpool::V2_0::implementation::ClientManager>",
   "record_kind" : "class",
   "referenced_type" : "type-1117",
   "self_type" : "type-1117",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1120" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware5media10bufferpool4V2_014implementation13ClientManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1051"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::base::V1_0::IBase>",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1002" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1056"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1005" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-834",
   "self_type" : "type-834",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-816" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-794",
   "self_type" : "type-794",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-736",
   "self_type" : "type-736",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-526" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-655" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-548",
   "self_type" : "type-548",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-538" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-815",
   "self_type" : "type-815",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-816" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-768",
   "self_type" : "type-768",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-704",
   "self_type" : "type-704",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-603",
   "self_type" : "type-603",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-526" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-742",
   "self_type" : "type-742",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-654",
   "self_type" : "type-654",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-655" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-538" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-816" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-785",
   "self_type" : "type-785",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-730",
   "self_type" : "type-730",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-526" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-655" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-538" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-491",
   "self_type" : "type-491",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-156" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-839",
   "self_type" : "type-839",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-816" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-805",
   "self_type" : "type-805",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-526" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-522",
   "self_type" : "type-522",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-655" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-538" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-484",
   "self_type" : "type-484",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-1310"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-1283",
   "self_type" : "type-1283",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1086"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-1085",
   "self_type" : "type-1085",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-1087"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-1006"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-1006"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-734"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-925"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-1088"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-1086",
   "self_type" : "type-1086",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-1282",
   "self_type" : "type-1282",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-735"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-1088",
   "self_type" : "type-1088",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-735"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-925",
   "self_type" : "type-925",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-735"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-734",
   "self_type" : "type-734",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-735"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-1006",
   "self_type" : "type-1006",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-159"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "C2InterfaceHelper::ParamHelper &&",
   "name" : "C2InterfaceHelper::ParamHelper &&",
   "referenced_type" : "type-85",
   "self_type" : "type-784",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2ParamFieldValues &&",
   "name" : "C2ParamFieldValues &&",
   "referenced_type" : "type-857",
   "self_type" : "type-856",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2SettingResult &&",
   "name" : "C2SettingResult &&",
   "referenced_type" : "type-863",
   "self_type" : "type-862",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2SettingResultsBuilder &&",
   "name" : "C2SettingResultsBuilder &&",
   "referenced_type" : "type-11",
   "self_type" : "type-15",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceUtils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2StructDescriptor &&",
   "name" : "C2StructDescriptor &&",
   "referenced_type" : "type-760",
   "self_type" : "type-759",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/vndk/include/util/C2InterfaceHelper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "type-149",
   "self_type" : "type-160",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::bufferqueue::V2_0::Status> &&",
   "name" : "android::hardware::Return<android::hardware::graphics::bufferqueue::V2_0::Status> &&",
   "referenced_type" : "type-168",
   "self_type" : "type-175",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error> &&",
   "name" : "android::hardware::Return<android::hardware::graphics::mapper::V2_0::Error> &&",
   "referenced_type" : "type-399",
   "self_type" : "type-409",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<unsigned long long> &&",
   "name" : "android::hardware::Return<unsigned long long> &&",
   "referenced_type" : "type-181",
   "self_type" : "type-183",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Return<void> &&",
   "name" : "android::hardware::Return<void> &&",
   "referenced_type" : "type-430",
   "self_type" : "type-434",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::Status &&",
   "name" : "android::hardware::Status &&",
   "referenced_type" : "type-171",
   "self_type" : "type-392",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hardware::details::return_status &&",
   "name" : "android::hardware::details::return_status &&",
   "referenced_type" : "type-170",
   "self_type" : "type-416",
   "size" : 4,
