{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "OMX_AUDIO_CHANNELTYPE [16]",
   "name" : "OMX_AUDIO_CHANNELTYPE [16]",
   "referenced_type" : "type-457",
   "self_type" : "type-459",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE []",
   "name" : "OMX_COMPONENTREGISTERTYPE []",
   "referenced_type" : "type-447",
   "self_type" : "type-448",
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE [1]",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE [1]",
   "referenced_type" : "type-389",
   "self_type" : "type-392",
   "size" : 264,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::AMessage::Item [64]",
   "name" : "android::AMessage::Item [64]",
   "referenced_type" : "type-104",
   "self_type" : "type-103",
   "size" : 1792,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::MediaImage2::PlaneInfo [4]",
   "name" : "android::MediaImage2::PlaneInfo [4]",
   "referenced_type" : "type-151",
   "self_type" : "type-150",
   "size" : 80,

   "name" : "const android::wp<android::ALooper>",
   "referenced_type" : "type-70",
   "self_type" : "type-618",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::wp<android::SimpleSoftOMXComponent>",
   "name" : "const android::wp<android::SimpleSoftOMXComponent>",
   "referenced_type" : "type-234",
   "self_type" : "type-741",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const bool",
   "name" : "const bool",
   "referenced_type" : "type-88",
   "self_type" : "type-383",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-79",
   "self_type" : "type-112",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const char *const",
   "name" : "const char *const",
   "referenced_type" : "type-111",
   "self_type" : "type-497",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const double",
   "name" : "const double",
   "referenced_type" : "type-107",
   "self_type" : "type-435",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-106",
   "self_type" : "type-432",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const hw_module_t",
   "name" : "const hw_module_t",
   "referenced_type" : "type-371",
   "self_type" : "type-370",
   "size" : 128,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftVideoEncoderOMXComponent.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-30",
   "self_type" : "type-426",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const log_msg",
   "name" : "const log_msg",
   "referenced_type" : "type-314",
   "self_type" : "type-313",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const long long",
   "name" : "const long long",
   "referenced_type" : "type-56",
   "self_type" : "type-428",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-193",
   "self_type" : "type-199",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-422",
   "self_type" : "type-421",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-408",
   "self_type" : "type-407",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-5",
   "self_type" : "type-311",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-101",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-136",
   "self_type" : "type-430",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-44",
   "self_type" : "type-424",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-100",
   "self_type" : "type-400",
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-99",
   "self_type" : "type-791",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SimpleSoftOMXComponent.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-88",
   "self_type" : "type-766",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBalance",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "name" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_BALANCETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nBass",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "name" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_BASSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "referenced_type" : "type-522",
   "self_type" : "type-522",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 160,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sDelay",
     "field_offset" : 128,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sModulationRate",
     "field_offset" : 224,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "nModulationDepth",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFeedback",
     "field_offset" : 352,
     "referenced_type" : "type-444"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "referenced_type" : "type-529",
   "self_type" : "type-529",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHORUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eEchoCancelation",
     "field_offset" : 96,
     "referenced_type" : "type-531"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sBandIndex",
     "field_offset" : 128,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sCenterFreq",
     "field_offset" : 224,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sBandLevel",
     "field_offset" : 320,
     "referenced_type" : "type-445"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "name" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLoudness",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "name" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sPitchTransposition",
     "field_offset" : 96,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "sPlayBackRate",
     "field_offset" : 192,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sTempo",
     "field_offset" : 288,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "nMaxPolyphony",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumRepeat",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStopTime",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannelMuteMask",
     "field_offset" : 480,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nChannelSoloMask",
     "field_offset" : 496,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nTrack0031MuteMask",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack3263MuteMask",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack0031SoloMask",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack3263SoloMask",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "referenced_type" : "type-510",
   "self_type" : "type-510",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMidiEventSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMidiEvents",
     "field_offset" : 128,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nData",
     "field_offset" : 160,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "referenced_type" : "type-514",
   "self_type" : "type-514",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetaEventType",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "referenced_type" : "type-513",
   "self_type" : "type-513",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIDProgram",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nIDSoundBank",
     "field_offset" : 144,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nUserSoundBankIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumTracks",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nDuration",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bVibra",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nNumMetaEvents",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumActiveVoices",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eMIDIPlayBackState",
     "field_offset" : 288,
     "referenced_type" : "type-511"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "referenced_type" : "type-512",
   "self_type" : "type-512",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "referenced_type" : "type-521",
   "self_type" : "type-521",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MUTETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bNoiseReduction",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sRoomLevel",
     "field_offset" : 128,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "sRoomHighFreqLevel",
     "field_offset" : 224,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "sReflectionsLevel",
     "field_offset" : 320,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "sReflectionsDelay",
     "field_offset" : 416,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sReverbLevel",
     "field_offset" : 512,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "sReverbDelay",
     "field_offset" : 608,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sDecayTime",
     "field_offset" : 704,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "nDecayHighFreqRatio",
     "field_offset" : 800,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "nDensity",
     "field_offset" : 896,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDiffusion",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sReferenceHighFreq",
     "field_offset" : 960,
     "referenced_type" : "type-444"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "referenced_type" : "type-530",
   "self_type" : "type-530",
   "size" : 132,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eWideningType",
     "field_offset" : 128,
     "referenced_type" : "type-527"
    },
    {
     "field_name" : "nStereoWidening",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "name" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nTreble",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "name" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_TREBLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 128,
     "referenced_type" : "type-445"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_VOLUMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameLength",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAACtools",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAACERtools",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eAACProfile",
     "field_offset" : 320,
     "referenced_type" : "type-465"
    },
    {
     "field_name" : "eAACStreamFormat",
     "field_offset" : 352,
     "referenced_type" : "type-463"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 384,
     "referenced_type" : "type-460"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "name" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_AACPROFILETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitsPerSample",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "name" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_ADPCMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eAMRBandMode",
     "field_offset" : 160,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "eAMRDTXMode",
     "field_offset" : 192,
     "referenced_type" : "type-487"
    },
    {
     "field_name" : "eAMRFrameFormat",
     "field_offset" : 224,
     "referenced_type" : "type-484"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_AMRTYPE",
   "name" : "OMX_AUDIO_PARAM_AMRTYPE",
   "referenced_type" : "type-488",
   "self_type" : "type-488",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_AMRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "name" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_EVRCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCompressionLevel",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_FLACTYPE",
   "name" : "OMX_AUDIO_PARAM_FLACTYPE",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_FLACTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-478"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G723TYPE",
   "name" : "OMX_AUDIO_PARAM_G723TYPE",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G723TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eG726Mode",
     "field_offset" : 128,
     "referenced_type" : "type-480"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G726TYPE",
   "name" : "OMX_AUDIO_PARAM_G726TYPE",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G726TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eBitType",
     "field_offset" : 160,
     "referenced_type" : "type-482"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G729TYPE",
   "name" : "OMX_AUDIO_PARAM_G729TYPE",
   "referenced_type" : "type-483",
   "self_type" : "type-483",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G729TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "referenced_type" : "type-491",
   "self_type" : "type-491",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMHRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDLSIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDLSSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDLSData",
     "field_offset" : 160,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "eMidiSoundBank",
     "field_offset" : 192,
     "referenced_type" : "type-505"
    },
    {
     "field_name" : "eMidiSoundBankLayout",
     "field_offset" : 224,
     "referenced_type" : "type-506"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "name" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "referenced_type" : "type-507",
   "self_type" : "type-507",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFileSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sMaxPolyphony",
     "field_offset" : 128,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "bLoadDefaultSound",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eMidiFormat",
     "field_offset" : 256,
     "referenced_type" : "type-503"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MIDITYPE",
   "name" : "OMX_AUDIO_PARAM_MIDITYPE",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MIDITYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 224,
     "referenced_type" : "type-460"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 256,
     "referenced_type" : "type-461"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MP3TYPE",
   "name" : "OMX_AUDIO_PARAM_MP3TYPE",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MP3TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eNumData",
     "field_offset" : 128,
     "referenced_type" : "type-443"
    },
    {
     "field_name" : "eEndian",
     "field_offset" : 160,
     "referenced_type" : "type-442"
    },
    {
     "field_name" : "bInterleaved",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nBitPerSample",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ePCMMode",
     "field_offset" : 288,
     "referenced_type" : "type-456"
    },
    {
     "field_name" : "eChannelMapping",
     "field_offset" : 320,
     "referenced_type" : "type-459"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "name" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "referenced_type" : "type-458",
   "self_type" : "type-458",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PCMMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "referenced_type" : "type-495",
   "self_type" : "type-495",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCHRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 128,
     "referenced_type" : "type-244"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-455",
   "self_type" : "type-455",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_QCELP13TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 160,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "referenced_type" : "type-499",
   "self_type" : "type-499",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_QCELP8TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitsPerFrame",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSamplePerFrame",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCouplingQuantBits",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCouplingStartRegion",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumRegions",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 320,
     "referenced_type" : "type-472"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_RATYPE",
   "name" : "OMX_AUDIO_PARAM_RATYPE",
   "referenced_type" : "type-473",
   "self_type" : "type-473",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_RATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBlocks",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSubbands",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitPool",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableBitrate",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 320,
     "referenced_type" : "type-460"
    },
    {
     "field_name" : "eSBCAllocType",
     "field_offset" : 352,
     "referenced_type" : "type-474"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_SBCTYPE",
   "name" : "OMX_AUDIO_PARAM_SBCTYPE",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_SBCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_SMVTYPE",
   "name" : "OMX_AUDIO_PARAM_SMVTYPE",
   "referenced_type" : "type-502",
   "self_type" : "type-502",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_SMVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_TDMAEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "referenced_type" : "type-492",
   "self_type" : "type-492",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_TDMAFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQuality",
     "field_offset" : 288,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "bManaged",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bDownmix",
     "field_offset" : 352,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "name" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "referenced_type" : "type-467",
   "self_type" : "type-467",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_VORBISTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 160,
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 192,
     "referenced_type" : "type-470"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBlockAlign",
     "field_offset" : 256,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nEncodeOptions",
     "field_offset" : 272,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nSuperBlockAlign",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_WMATYPE",
   "name" : "OMX_AUDIO_PARAM_WMATYPE",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_WMATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 96,
     "referenced_type" : "type-244"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "name" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BS32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "type-444",
   "self_type" : "type-444",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BU32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-212"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 192,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 224,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 256,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 288,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 320,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 352,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 416,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "type-211",
   "self_type" : "type-211",
   "size" : 72,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_BUFFERHEADERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 32,
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 64,
     "referenced_type" : "type-265"
    }
   ],
   "linker_set_key" : "OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_CALLBACKTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 32,
     "referenced_type" : "type-301"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_COMPONENTREGISTERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pComponentPrivate",
     "field_offset" : 64,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "pApplicationPrivate",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "GetComponentVersion",
     "field_offset" : 128,
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 160,
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "GetParameter",
     "field_offset" : 192,
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "SetParameter",
     "field_offset" : 224,
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "GetConfig",
     "field_offset" : 256,
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "SetConfig",
     "field_offset" : 288,
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "GetExtensionIndex",
     "field_offset" : 320,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 352,
     "referenced_type" : "type-282"
    },
    {
     "field_name" : "ComponentTunnelRequest",
     "field_offset" : 384,
     "referenced_type" : "type-285"
    },
    {
     "field_name" : "UseBuffer",
     "field_offset" : 416,
     "referenced_type" : "type-290"
    },
    {
     "field_name" : "AllocateBuffer",
     "field_offset" : 448,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "FreeBuffer",
     "field_offset" : 480,
     "referenced_type" : "type-294"
    },
    {
     "field_name" : "EmptyThisBuffer",
     "field_offset" : 512,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "FillThisBuffer",
     "field_offset" : 544,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "SetCallbacks",
     "field_offset" : 576,
     "referenced_type" : "type-298"
    },
    {
     "field_name" : "ComponentDeInit",
     "field_offset" : 608,
     "referenced_type" : "type-301"
    },
    {
     "field_name" : "UseEGLImage",
     "field_offset" : 640,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "ComponentRoleEnum",
     "field_offset" : 672,
     "referenced_type" : "type-305"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 88,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_COMPONENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cName",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 1120,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "nParamCount",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "param",
     "field_offset" : 1216,
     "referenced_type" : "type-392"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 416,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h",
   "unique_id" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cKey",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "eValueType",
     "field_offset" : 1024,
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "bSet",
     "field_offset" : 1056,
     "referenced_type" : "type-24"
    },
    {
     "field_offset" : 1088,
     "referenced_type" : "type-390"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 264,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h",
   "unique_id" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nInt32",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nInt64",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "cString",
     "referenced_type" : "type-20"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5",
   "record_kind" : "union",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 128,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h",
   "unique_id" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BACKLIGHTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BOOLEANTYPE",
   "name" : "OMX_CONFIG_BOOLEANTYPE",
   "referenced_type" : "type-659",
   "self_type" : "type-659",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_BOOLEANTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BRIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "type-573",
   "self_type" : "type-573",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CAPTUREMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "type-543"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "type-535"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORCONVERSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORENHANCEMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORKEYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumNodes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNodeIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNodeID",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cNodeName",
     "field_offset" : 192,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "bIsLeafType",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_CONTAINERNODEIDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CONTRASTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "type-571"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_DITHERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSURECONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "type-574"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSUREVALUETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FOCUSREGIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_FRAMERATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FRAMESTABTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_GAMMATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "type-539"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "type-540",
   "self_type" : "type-540",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_IMAGEFILTERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_INTRAREFRESHVOPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_LIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MBERRORREPORTINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "type-664"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetadataItemCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "name" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "referenced_type" : "type-666",
   "self_type" : "type-666",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_METADATAITEMCOUNTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "type-664"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetadataItemIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eSearchMode",
     "field_offset" : 160,
     "referenced_type" : "type-665"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 192,
     "referenced_type" : "type-663"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 224,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 232,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "eValueCharset",
     "field_offset" : 1280,
     "referenced_type" : "type-663"
    },
    {
     "field_name" : "sLanguageCountry",
     "field_offset" : 1312,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "nValueMaxSize",
     "field_offset" : 1344,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nValueSizeUsed",
     "field_offset" : 1376,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 1408,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_METADATAITEMTYPE",
   "name" : "OMX_CONFIG_METADATAITEMTYPE",
   "referenced_type" : "type-668",
   "self_type" : "type-668",
   "size" : 180,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_METADATAITEMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "type-547"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "type-548",
   "self_type" : "type-548",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_MIRRORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_PLANEBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_POINTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_RECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_ROTATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "type-562",
   "self_type" : "type-562",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SATURATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SCALEFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_TRANSITIONEFFECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "type-553"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_WHITEBALCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_FRAMESIZETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFocusControl",
     "field_offset" : 96,
     "referenced_type" : "type-624"
    },
    {
     "field_name" : "nFocusSteps",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFocusStepIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "name" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFlashControl",
     "field_offset" : 96,
     "referenced_type" : "type-622"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "name" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eHuffmanTable",
     "field_offset" : 96,
     "referenced_type" : "type-632"
    },
    {
     "field_name" : "nNumberOfHuffmanCodeOfLength",
     "field_offset" : 128,
     "referenced_type" : "type-634"
    },
    {
     "field_name" : "nHuffmanTable",
     "field_offset" : 256,
     "referenced_type" : "type-635"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "referenced_type" : "type-633",
   "self_type" : "type-633",
   "size" : 288,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-247"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "name" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQFactor",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "name" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_QFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eQuantizationTable",
     "field_offset" : 96,
     "referenced_type" : "type-629"
    },
    {
     "field_name" : "nQuantizationMatrix",
     "field_offset" : 128,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "referenced_type" : "type-630",
   "self_type" : "type-630",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 224,
     "referenced_type" : "type-247"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 288,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "name" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 32,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_MARKTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eNaluFormat",
     "field_offset" : 96,
     "referenced_type" : "type-159"
    }
   ],
   "linker_set_key" : "OMX_NALSTREAMFORMATTYPE",
   "name" : "OMX_NALSTREAMFORMATTYPE",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_NALSTREAMFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bEnablePM",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_OTHER_CONFIG_POWERTYPE",
   "name" : "OMX_OTHER_CONFIG_POWERTYPE",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_CONFIG_POWERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "OMX_OTHER_CONFIG_STATSTYPE",
   "name" : "OMX_OTHER_CONFIG_STATSTYPE",
   "referenced_type" : "type-651",
   "self_type" : "type-651",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_CONFIG_STATSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_OTHER_EXTRADATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 128,
     "referenced_type" : "type-249"
    }
   ],
   "linker_set_key" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "name" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eFormat",
     "referenced_type" : "type-249"
    }
   ],
   "linker_set_key" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "name" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "type-289"
    }
   ],
   "linker_set_key" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_BUFFERSUPPLIERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_COMPONENTROLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hPipe",
     "field_offset" : 64,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "OMX_PARAM_CONTENTPIPETYPE",
   "name" : "OMX_PARAM_CONTENTPIPETYPE",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_CONTENTPIPETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "contentURI",
     "field_offset" : 64,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "OMX_PARAM_CONTENTURITYPE",
   "name" : "OMX_PARAM_CONTENTURITYPE",
   "referenced_type" : "type-660",
   "self_type" : "type-660",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_CONTENTURITYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "type-569"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DATAUNITTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DEBLOCKINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "type-577"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_FOCUSSTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_INTERLEAVETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_PARAM_MACROBLOCKSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 96,
     "referenced_type" : "type-663"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "nLanguageCountrySizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nLanguageCountry",
     "field_offset" : 1216,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 2240,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_PARAM_METADATAFILTERTYPE",
   "name" : "OMX_PARAM_METADATAFILTERTYPE",
   "referenced_type" : "type-672",
   "self_type" : "type-672",
   "size" : 284,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_METADATAFILTERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 96,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "nBufferCountActual",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBufferCountMin",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBufferSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bPopulated",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eDomain",
     "field_offset" : 288,
     "referenced_type" : "type-241"
    },
    {
     "field_name" : "format",
     "field_offset" : 320,
     "referenced_type" : "type-242"
    },
    {
     "field_name" : "bBuffersContiguous",
     "field_offset" : 704,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nBufferAlignment",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 96,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "audio",
     "referenced_type" : "type-243"
    },
    {
     "field_name" : "video",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "image",
     "referenced_type" : "type-246"
    },
    {
     "field_name" : "other",
     "referenced_type" : "type-248"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5",
   "record_kind" : "union",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_SENSORMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ePolicy",
     "field_offset" : 64,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "name" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "referenced_type" : "type-655",
   "self_type" : "type-655",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_SUSPENSIONPOLICYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "type-657"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SUSPENSIONTYPE",
   "name" : "OMX_PARAM_SUSPENSIONTYPE",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_SUSPENSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nU32",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_U32TYPE",
   "name" : "OMX_PARAM_U32TYPE",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_U32TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PORT_PARAM_TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PRIORITYMGMTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bResourceConcealmentForbidden",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_RESOURCECONCEALMENTTYPE",
   "name" : "OMX_RESOURCECONCEALMENTTYPE",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_RESOURCECONCEALMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eClock",
     "field_offset" : 64,
     "referenced_type" : "type-642"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "name" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eState",
     "field_offset" : 64,
     "referenced_type" : "type-643"
    },
    {
     "field_name" : "nStartTime",
     "field_offset" : 96,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 160,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nWaitMask",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "name" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_CLOCKSTATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pClientPrivate",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "name" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_SCALETYPE",
   "name" : "OMX_TIME_CONFIG_SCALETYPE",
   "referenced_type" : "type-646",
   "self_type" : "type-646",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_SCALETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "type-637"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "name" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_SEEKMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimestamp",
     "field_offset" : 96,
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "name" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_TIMESTAMPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nClientPrivate",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eUpdateType",
     "field_offset" : 96,
     "referenced_type" : "type-641"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nWallTimeAtMediaTime",
     "field_offset" : 256,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 320,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "eState",
     "field_offset" : 352,
     "referenced_type" : "type-643"
    }
   ],
   "linker_set_key" : "OMX_TIME_MEDIATIMETYPE",
   "name" : "OMX_TIME_MEDIATIMETYPE",
   "referenced_type" : "type-645",
   "self_type" : "type-645",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_MEDIATIMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "type-289"
    }
   ],
   "linker_set_key" : "OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "type-288",
   "self_type" : "type-288",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_TUNNELSETUPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRefreshPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 96,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 224,
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 60,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_NALSIZE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nTileWidth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTileHeight",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGridRows",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGridCols",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eSupportedPatterns",
     "field_offset" : 96,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "nLayerCountMax",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBLayerCountMax",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 192,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 320,
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 72,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eTemporalPattern",
     "field_offset" : 128,
     "referenced_type" : "type-168"
    },
    {
     "field_name" : "nTemporalLayerCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTemporalLayerBitrateRatio",
     "field_offset" : 192,
     "referenced_type" : "type-170"
    },
    {
     "field_name" : "nMinQuantizer",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxQuantizer",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "type-616"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCSLICEFMO"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "type-605"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "type-606"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "type-607"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 108,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "type-581"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "type-583"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "type-582",
   "self_type" : "type-582",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "type-2"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "record_kind" : "union",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-591"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-592"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_H263TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-174"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "name" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_HEVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "type-586"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "type-588",
   "self_type" : "type-588",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "type-584"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-595"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-596"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG2TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "type-598"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "type-599"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 68,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG4TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-603"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "type-604",
   "self_type" : "type-604",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_RVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "type-590",
   "self_type" : "type-590",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VBSMCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "nDCTPartitions",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VP8TYPE",
   "name" : "OMX_VIDEO_PARAM_VP8TYPE",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_VP8TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nTileRows",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTileColumns",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableFrameParallelDecoding",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VP9TYPE",
   "name" : "OMX_VIDEO_PARAM_VP9TYPE",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_VP9TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-601"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_WMVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 352,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nMediaTimeUs",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "nSystemTimeNs",
     "field_offset" : 64,
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_RENDEREVENTTYPE",
   "name" : "OMX_VIDEO_RENDEREVENTTYPE",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_RENDEREVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDepedentSegments",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bEnableLoopFilterAcrossSlices",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "name" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_SLICESEGMENTSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bIsIntraFrame",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bIsGoldenOrAlternateFrame",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bPreviousFrameRefresh",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bGoldenFrameRefresh",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bAlternateFrameRefresh",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bUsePreviousFrame",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bUseGoldenFrame",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bUseAlternateFrame",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMeta",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mCapacity",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mRangeOffset",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mRangeLength",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mInt32Data",
     "field_offset" : 224,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsData",
     "field_offset" : 256,
     "referenced_type" : "type-88"
    }
   ],
   "linker_set_key" : "android::ABuffer",
   "name" : "android::ABuffer",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 36,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ABuffer.h",
   "unique_id" : "_ZTSN7android7ABufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7ABufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ABufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ABufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::AData<int, long long, unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::AData<int, long long, unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-915",
   "self_type" : "type-915",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h",
   "unique_id" : "_ZTSN7android5ADataIJixjfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ADebug",
   "name" : "android::ADebug",
   "referenced_type" : "type-794",
   "self_type" : "type-794",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ADebug.h",
   "unique_id" : "_ZTSN7android6ADebugE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mID",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 96,
     "referenced_type" : "type-70"
    },
    {
     "access" : "private",
     "field_name" : "mVerboseStats",
     "field_offset" : 160,
     "referenced_type" : "type-88"
    },
    {
     "access" : "private",
     "field_name" : "mMessageCounter",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMessages",
     "field_offset" : 224,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "android::AHandler",
   "name" : "android::AHandler",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AHandler.h",
   "unique_id" : "_ZTSN7android8AHandlerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8AHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AHandlerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8AHandler17onMessageReceivedERKNS_2spINS_8AMessageEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-69"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTarget",
     "field_offset" : 384,
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "android::AHandlerReflector<android::SimpleSoftOMXComponent>",
   "name" : "android::AHandlerReflector<android::SimpleSoftOMXComponent>",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 56,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AHandlerReflector.h",
   "template_args" : [ "type-229" ],
   "unique_id" : "_ZTSN7android17AHandlerReflectorINS_22SimpleSoftOMXComponentEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17AHandlerReflectorINS_22SimpleSoftOMXComponentEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17AHandlerReflectorINS_22SimpleSoftOMXComponentEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17AHandlerReflectorINS_22SimpleSoftOMXComponentEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android17AHandlerReflectorINS_22SimpleSoftOMXComponentEE17onMessageReceivedERKNS_2spINS_8AMessageEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "access" : "private",
     "field_name" : "mQueueChangedCondition",
     "field_offset" : 96,
     "referenced_type" : "type-75"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 128,
     "referenced_type" : "type-77"
    },
    {
     "access" : "private",
     "field_name" : "mEventQueue",
     "field_offset" : 224,
     "referenced_type" : "type-80"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 288,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "mRunningLocally",
     "field_offset" : 320,
     "referenced_type" : "type-88"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesLock",
     "field_offset" : 352,
     "referenced_type" : "type-73"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesCondition",
     "field_offset" : 384,
     "referenced_type" : "type-75"
    }
   ],
   "linker_set_key" : "android::ALooper",
   "name" : "android::ALooper",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 52,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7ALooperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mWhenUs",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::ALooper::Event",
   "name" : "android::ALooper::Event",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooper5EventE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mWhat",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mTarget",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mHandler",
     "field_offset" : 128,
     "referenced_type" : "type-67"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 192,
     "referenced_type" : "type-70"
    },
    {
     "access" : "private",
     "field_name" : "mItems",
     "field_offset" : 256,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mNumItems",
     "field_offset" : 14592,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::AMessage",
   "name" : "android::AMessage",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 1828,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8AMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AMessageD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "u",
     "referenced_type" : "type-105"
    },
    {
     "field_name" : "mName",
     "field_offset" : 128,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "mNameLength",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mType",
     "field_offset" : 192,
     "referenced_type" : "type-113"
    }
   ],
   "linker_set_key" : "android::AMessage::Item",
   "name" : "android::AMessage::Item",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 28,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4ItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "int32Value",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "int64Value",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "sizeValue",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "floatValue",
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "doubleValue",
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "ptrValue",
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "refValue",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "stringValue",
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "rectValue",
     "referenced_type" : "type-110"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::AMessage::Item::(anonymous union at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9) at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9",
   "name" : "android::AMessage::Item::(anonymous union at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9) at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9",
   "record_kind" : "union",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4ItemUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mLeft",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "mTop",
     "field_offset" : 32,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "mRight",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "mBottom",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "android::AMessage::Rect",
   "name" : "android::AMessage::Rect",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4RectE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 64,
     "referenced_type" : "type-70"
    },
    {
     "access" : "private",
     "field_name" : "mReply",
     "field_offset" : 128,
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "mReplied",
     "field_offset" : 160,
     "referenced_type" : "type-88"
    }
   ],
   "linker_set_key" : "android::AReplyToken",
   "name" : "android::AReplyToken",
   "referenced_type" : "type-916",
   "self_type" : "type-916",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android11AReplyTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AReplyTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "type-78"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::AString",
   "name" : "android::AString",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h",
   "unique_id" : "_ZTSN7android7AStringE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mProfile",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mLevel",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::CodecProfileLevel",
   "name" : "android::CodecProfileLevel",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SimpleSoftOMXComponent.h",
   "unique_id" : "_ZTSN7android17CodecProfileLevelE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::ColorAspects",
   "name" : "android::ColorAspects",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android12ColorAspectsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ColorUtils",
   "name" : "android::ColorUtils",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ColorUtils.h",
   "unique_id" : "_ZTSN7android10ColorUtilsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bTunneled",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nAudioHwSync",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSidebandWindow",
     "field_offset" : 160,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::ConfigureVideoTunnelModeParams",
   "name" : "android::ConfigureVideoTunnelModeParams",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android30ConfigureVideoTunnelModeParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bRequestingDataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bDataSpaceChanged",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nPixelFormat",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDataSpace",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sAspects",
     "field_offset" : 224,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::DescribeColorAspectsParams",
   "name" : "android::DescribeColorAspectsParams",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26DescribeColorAspectsParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bUsingNativeBuffers",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sMediaImage",
     "field_offset" : 256,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "android::DescribeColorFormat2Params",
   "name" : "android::DescribeColorFormat2Params",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26DescribeColorFormat2ParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bUsingNativeBuffers",
     "field_offset" : 224,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "sMediaImage",
     "field_offset" : 256,
     "referenced_type" : "type-143"
    }
   ],
   "linker_set_key" : "android::DescribeColorFormatParams",
   "name" : "android::DescribeColorFormatParams",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android25DescribeColorFormatParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nParamSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 160,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "android::DescribeHDR10PlusInfoParams",
   "name" : "android::DescribeHDR10PlusInfoParams",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android27DescribeHDR10PlusInfoParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sInfo",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "android::DescribeHDRStaticInfoParams",
   "name" : "android::DescribeHDRStaticInfoParams",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android27DescribeHDRStaticInfoParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "enable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::EnableAndroidNativeBuffersParams",
   "name" : "android::EnableAndroidNativeBuffersParams",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android32EnableAndroidNativeBuffersParamsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-402" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nUsage",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::GetAndroidNativeBufferUsageParams",
   "name" : "android::GetAndroidNativeBufferUsageParams",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android33GetAndroidNativeBufferUsageParamsE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "type-40"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 25,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "type-42"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "record_kind" : "union",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoUt_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Primaries1",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo10Primaries1E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Type1",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo5Type1E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "android::KeyedVector<unsigned int, unsigned int>",
   "name" : "android::KeyedVector<unsigned int, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Point>",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-404" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Rect>",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-406" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-403"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Point>",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-410" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-405"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Rect>",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-412" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_4RectEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-326"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::Fence>",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-325",
   "self_type" : "type-325",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-327" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-519"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-518",
   "self_type" : "type-518",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-520" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::List<BufferInfo *>::CONST_ITERATOR<android::SimpleSoftOMXComponent::BufferInfo *>",
   "name" : "android::List<BufferInfo *>::CONST_ITERATOR<android::SimpleSoftOMXComponent::BufferInfo *>",
   "referenced_type" : "type-713",
   "self_type" : "type-713",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEE14CONST_ITERATORIS3_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::List<BufferInfo *>::NON_CONST_ITERATOR<android::SimpleSoftOMXComponent::BufferInfo *>",
   "name" : "android::List<BufferInfo *>::NON_CONST_ITERATOR<android::SimpleSoftOMXComponent::BufferInfo *>",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEE18NON_CONST_ITERATORIS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-712"
    }
   ],
   "linker_set_key" : "android::List<BufferInfo *>::_ListIterator<android::SimpleSoftOMXComponent::BufferInfo *, android::List<BufferInfo *>::CONST_ITERATOR>",
   "name" : "android::List<BufferInfo *>::_ListIterator<android::SimpleSoftOMXComponent::BufferInfo *, android::List<BufferInfo *>::CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-722",
   "self_type" : "type-722",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEE13_ListIteratorIS3_NS4_14CONST_ITERATOREEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-253"
    }
   ],
   "linker_set_key" : "android::List<BufferInfo *>::_ListIterator<android::SimpleSoftOMXComponent::BufferInfo *, android::List<BufferInfo *>::NON_CONST_ITERATOR>",
   "name" : "android::List<BufferInfo *>::_ListIterator<android::SimpleSoftOMXComponent::BufferInfo *, android::List<BufferInfo *>::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEE13_ListIteratorIS3_NS4_18NON_CONST_ITERATOREEE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "type-255"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 32,
     "referenced_type" : "type-253"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 64,
     "referenced_type" : "type-253"
    }
   ],
   "linker_set_key" : "android::List<BufferInfo *>::_Node",
   "name" : "android::List<BufferInfo *>::_Node",
   "record_kind" : "class",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "unique_id" : "_ZTSN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEE5_NodeE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::List<android::ALooper::Event>",
   "name" : "android::List<android::ALooper::Event>",
   "record_kind" : "class",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN7android4ListINS_7ALooper5EventEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7ALooper5EventEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 32,
     "referenced_type" : "type-253"
    }
   ],
   "linker_set_key" : "android::List<android::SimpleSoftOMXComponent::BufferInfo *>",
   "name" : "android::List<android::SimpleSoftOMXComponent::BufferInfo *>",
   "record_kind" : "class",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListIPNS_22SimpleSoftOMXComponent10BufferInfoEED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::List<android::sp<android::ABuffer> >",
   "name" : "android::List<android::sp<android::ABuffer> >",
   "record_kind" : "class",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android4ListINS_2spINS_7ABufferEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_2spINS_7ABufferEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_2spINS_7ABufferEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_2spINS_7ABufferEEEED0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::List<sp<ABuffer> >::CONST_ITERATOR<android::sp<android::ABuffer> >",
   "name" : "android::List<sp<ABuffer> >::CONST_ITERATOR<android::sp<android::ABuffer> >",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android4ListINS_2spINS_7ABufferEEEE14CONST_ITERATORIS3_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::List<sp<ABuffer> >::NON_CONST_ITERATOR<android::sp<android::ABuffer> >",
   "name" : "android::List<sp<ABuffer> >::NON_CONST_ITERATOR<android::sp<android::ABuffer> >",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android4ListINS_2spINS_7ABufferEEEE18NON_CONST_ITERATORIS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "android::List<sp<ABuffer> >::_ListIterator<android::sp<android::ABuffer>, android::List<sp<ABuffer> >::CONST_ITERATOR>",
   "name" : "android::List<sp<ABuffer> >::_ListIterator<android::sp<android::ABuffer>, android::List<sp<ABuffer> >::CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android4ListINS_2spINS_7ABufferEEEE13_ListIteratorIS3_NS4_14CONST_ITERATOREEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::List<sp<ABuffer> >::_ListIterator<android::sp<android::ABuffer>, android::List<sp<ABuffer> >::NON_CONST_ITERATOR>",
   "name" : "android::List<sp<ABuffer> >::_ListIterator<android::sp<android::ABuffer>, android::List<sp<ABuffer> >::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android4ListINS_2spINS_7ABufferEEEE13_ListIteratorIS3_NS4_18NON_CONST_ITERATOREEE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 64,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::List<sp<ABuffer> >::_Node",
   "name" : "android::List<sp<ABuffer> >::_Node",
   "record_kind" : "class",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "unique_id" : "_ZTSN7android4ListINS_2spINS_7ABufferEEEE5_NodeE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 160,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "android::MediaImage",
   "name" : "android::MediaImage",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImageE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mBitDepthAllocated",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 192,
     "referenced_type" : "type-150"
    }
   ],
   "linker_set_key" : "android::MediaImage2",
   "name" : "android::MediaImage2",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage2E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::MediaImage2::PlaneInfo",
   "name" : "android::MediaImage2::PlaneInfo",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage29PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::MediaImage::PlaneInfo",
   "name" : "android::MediaImage::PlaneInfo",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImage9PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-74"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-774"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-773",
   "self_type" : "type-773",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::OMXPluginBase",
   "name" : "android::OMXPluginBase",
   "referenced_type" : "type-971",
   "self_type" : "type-971",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/OMXPluginBase.h",
   "unique_id" : "_ZTSN7android13OMXPluginBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13OMXPluginBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19enumerateComponentsEPcjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "nMaxFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::PrepareForAdaptivePlaybackParams",
   "name" : "android::PrepareForAdaptivePlaybackParams",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android32PrepareForAdaptivePlaybackParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::PrependSPSPPSToIDRFramesParams",
   "name" : "android::PrependSPSPPSToIDRFramesParams",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android30PrependSPSPPSToIDRFramesParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-779"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-778",
   "self_type" : "type-778",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-783"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-782",
   "self_type" : "type-782",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-783"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-785",
   "self_type" : "type-785",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-441",
   "self_type" : "type-441",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-257"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 256,
     "referenced_type" : "type-73"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 288,
     "referenced_type" : "type-230"
    },
    {
     "access" : "private",
     "field_name" : "mHandler",
     "field_offset" : 320,
     "referenced_type" : "type-231"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 352,
     "referenced_type" : "type-236"
    },
    {
     "access" : "private",
     "field_name" : "mTargetState",
     "field_offset" : 384,
     "referenced_type" : "type-236"
    },
    {
     "access" : "private",
     "field_name" : "mPorts",
     "field_offset" : 416,
     "referenced_type" : "type-237"
    },
    {
     "access" : "private",
     "field_name" : "mFrameConfig",
     "field_offset" : 576,
     "referenced_type" : "type-256"
    }
   ],
   "linker_set_key" : "android::SimpleSoftOMXComponent",
   "name" : "android::SimpleSoftOMXComponent",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 76,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SimpleSoftOMXComponent.h",
   "unique_id" : "_ZTSN7android22SimpleSoftOMXComponentE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22SimpleSoftOMXComponentE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZNK7android16SoftOMXComponent9initCheckEv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent21prepareForDestructionEv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent11sendCommandE15OMX_COMMANDTYPEjPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent12getParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent12setParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent9getConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent9setConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent9useBufferEPP20OMX_BUFFERHEADERTYPEjPvjPh"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent14allocateBufferEPP20OMX_BUFFERHEADERTYPEjPvj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent10freeBufferEjP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent15emptyThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent14fillThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent8getStateEP13OMX_STATETYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent20internalGetParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent20internalSetParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent17internalSetConfigE13OMX_INDEXTYPEPvPb"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent13onQueueFilledEj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent20onPortFlushCompletedEj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent21onPortEnableCompletedEjb"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent7onResetEv"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mHeader",
     "referenced_type" : "type-210"
    },
    {
     "field_name" : "mOwnedByUs",
     "field_offset" : 32,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "mFrameConfig",
     "field_offset" : 40,
     "referenced_type" : "type-88"
    }
   ],
   "linker_set_key" : "android::SimpleSoftOMXComponent::BufferInfo",
   "name" : "android::SimpleSoftOMXComponent::BufferInfo",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SimpleSoftOMXComponent.h",
   "unique_id" : "_ZTSN7android22SimpleSoftOMXComponent10BufferInfoE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDef",
     "referenced_type" : "type-239"
    },
    {
     "field_name" : "mBuffers",
     "field_offset" : 768,
     "referenced_type" : "type-250"
    },
    {
     "field_name" : "mQueue",
     "field_offset" : 928,
     "referenced_type" : "type-252"
    },
    {
     "field_name" : "mTransition",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::SimpleSoftOMXComponent::PortInfo",
   "name" : "android::SimpleSoftOMXComponent::PortInfo",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 128,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SimpleSoftOMXComponent.h",
   "unique_id" : "_ZTSN7android22SimpleSoftOMXComponent8PortInfoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Singleton<android::GraphicBufferMapper>",
   "name" : "android::Singleton<android::GraphicBufferMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Singleton.h",
   "template_args" : [ "type-414" ],
   "unique_id" : "_ZTSN7android9SingletonINS_19GraphicBufferMapperEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "access" : "private",
     "field_name" : "mCallbacks",
     "field_offset" : 160,
     "referenced_type" : "type-258"
    },
    {
     "access" : "private",
     "field_name" : "mComponent",
     "field_offset" : 192,
     "referenced_type" : "type-267"
    },
    {
     "access" : "private",
     "field_name" : "mLibHandle",
     "field_offset" : 224,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::SoftOMXComponent",
   "name" : "android::SoftOMXComponent",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftOMXComponent.h",
   "unique_id" : "_ZTSN7android16SoftOMXComponentE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SoftOMXComponentE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SoftOMXComponentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SoftOMXComponentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZNK7android16SoftOMXComponent9initCheckEv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent21prepareForDestructionEv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent11sendCommandE15OMX_COMMANDTYPEjPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent12getParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent12setParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent9getConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent9setConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent9useBufferEPP20OMX_BUFFERHEADERTYPEjPvjPh"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent14allocateBufferEPP20OMX_BUFFERHEADERTYPEjPvj"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent10freeBufferEjP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent15emptyThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent14fillThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent8getStateEP13OMX_STATETYPE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-971"
    }
   ],
   "linker_set_key" : "android::SoftOMXPlugin",
   "name" : "android::SoftOMXPlugin",
   "referenced_type" : "type-973",
   "self_type" : "type-973",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftOMXPlugin.h",
   "unique_id" : "_ZTSN7android13SoftOMXPluginE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13SoftOMXPluginE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13SoftOMXPluginD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13SoftOMXPluginD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin19enumerateComponentsEPcjj"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-229"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mIsAdaptive",
     "field_offset" : 584,
     "referenced_type" : "type-88"
    },
    {
     "access" : "protected",
     "field_name" : "mAdaptiveMaxWidth",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mAdaptiveMaxHeight",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mWidth",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mHeight",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mCropLeft",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mCropTop",
     "field_offset" : 768,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mCropWidth",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mCropHeight",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mOutputFormat",
     "field_offset" : 864,
     "referenced_type" : "type-15"
    },
    {
     "access" : "protected",
     "field_name" : "mHdrStaticInfo",
     "field_offset" : 896,
     "referenced_type" : "type-39"
    },
    {
     "access" : "protected",
     "field_name" : "mOutputPortSettingsChange",
     "field_offset" : 1120,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mUpdateColorAspects",
     "field_offset" : 1152,
     "referenced_type" : "type-88"
    },
    {
     "access" : "protected",
     "field_name" : "mColorAspectsLock",
     "field_offset" : 1184,
     "referenced_type" : "type-73"
    },
    {
     "access" : "protected",
     "field_name" : "mDefaultColorAspects",
     "field_offset" : 1216,
     "referenced_type" : "type-32"
    },
    {
     "access" : "protected",
     "field_name" : "mBitstreamColorAspects",
     "field_offset" : 1344,
     "referenced_type" : "type-32"
    },
    {
     "access" : "protected",
     "field_name" : "mFinalColorAspects",
     "field_offset" : 1472,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mMinInputBufferSize",
     "field_offset" : 1600,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMinCompressionRatio",
     "field_offset" : 1632,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mComponentRole",
     "field_offset" : 1664,
     "referenced_type" : "type-111"
    },
    {
     "access" : "private",
     "field_name" : "mCodingType",
     "field_offset" : 1696,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mProfileLevels",
     "field_offset" : 1728,
     "referenced_type" : "type-226"
    },
    {
     "access" : "private",
     "field_name" : "mNumProfileLevels",
     "field_offset" : 1760,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mHdr10PlusInputs",
     "field_offset" : 1792,
     "referenced_type" : "type-58"
    },
    {
     "access" : "private",
     "field_name" : "mHdr10PlusOutputs",
     "field_offset" : 1856,
     "referenced_type" : "type-58"
    }
   ],
   "linker_set_key" : "android::SoftVideoDecoderOMXComponent",
   "name" : "android::SoftVideoDecoderOMXComponent",
   "referenced_type" : "type-225",
   "self_type" : "type-225",
   "size" : 240,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftVideoDecoderOMXComponent.h",
   "unique_id" : "_ZTSN7android28SoftVideoDecoderOMXComponentE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android28SoftVideoDecoderOMXComponentE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZNK7android16SoftOMXComponent9initCheckEv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent21prepareForDestructionEv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent11sendCommandE15OMX_COMMANDTYPEjPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent12getParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent12setParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent9getConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent9setConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent9useBufferEPP20OMX_BUFFERHEADERTYPEjPvjPh"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent14allocateBufferEPP20OMX_BUFFERHEADERTYPEjPvj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent10freeBufferEjP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent15emptyThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent14fillThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent8getStateEP13OMX_STATETYPE"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent20internalGetParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent20internalSetParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent17internalSetConfigE13OMX_INDEXTYPEPvPb"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent13onQueueFilledEj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent20onPortFlushCompletedEj"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent21onPortEnableCompletedEjb"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent7onResetEv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent28supportsDescribeColorAspectsEv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent24getColorAspectPreferenceEv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent28supportDescribeHdrStaticInfoEv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent28supportDescribeHdr10PlusInfoEv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoDecoderOMXComponent21updatePortDefinitionsEbb"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-229"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInputDataIsMeta",
     "field_offset" : 584,
     "referenced_type" : "type-88"
    },
    {
     "access" : "protected",
     "field_name" : "mWidth",
     "field_offset" : 608,
     "referenced_type" : "type-30"
    },
    {
     "access" : "protected",
     "field_name" : "mHeight",
     "field_offset" : 640,
     "referenced_type" : "type-30"
    },
    {
     "access" : "protected",
     "field_name" : "mBitrate",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mFramerate",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mColorFormat",
     "field_offset" : 736,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mGrallocModule",
     "field_offset" : 768,
     "referenced_type" : "type-369"
    },
    {
     "access" : "private",
     "field_name" : "mMinOutputBufferSize",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMinCompressionRatio",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mComponentRole",
     "field_offset" : 864,
     "referenced_type" : "type-111"
    },
    {
     "access" : "private",
     "field_name" : "mCodingType",
     "field_offset" : 896,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mProfileLevels",
     "field_offset" : 928,
     "referenced_type" : "type-226"
    },
    {
     "access" : "private",
     "field_name" : "mNumProfileLevels",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::SoftVideoEncoderOMXComponent",
   "name" : "android::SoftVideoEncoderOMXComponent",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 124,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftVideoEncoderOMXComponent.h",
   "unique_id" : "_ZTSN7android28SoftVideoEncoderOMXComponentE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android28SoftVideoEncoderOMXComponentE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android28SoftVideoEncoderOMXComponentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android28SoftVideoEncoderOMXComponentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZNK7android16SoftOMXComponent9initCheckEv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent21prepareForDestructionEv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent11sendCommandE15OMX_COMMANDTYPEjPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent12getParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent12setParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android16SoftOMXComponent9getConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent9setConfigE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoEncoderOMXComponent17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent9useBufferEPP20OMX_BUFFERHEADERTYPEjPvjPh"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent14allocateBufferEPP20OMX_BUFFERHEADERTYPEjPvj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent10freeBufferEjP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent15emptyThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent14fillThisBufferEP20OMX_BUFFERHEADERTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent8getStateEP13OMX_STATETYPE"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoEncoderOMXComponent20internalGetParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android28SoftVideoEncoderOMXComponent20internalSetParameterE13OMX_INDEXTYPEPv"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent17internalSetConfigE13OMX_INDEXTYPEPvPb"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent13onQueueFilledEj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent20onPortFlushCompletedEj"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent21onPortEnableCompletedEjb"
    },
    {
     "mangled_component_name" : "_ZN7android22SimpleSoftOMXComponent7onResetEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-97"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::SimpleSoftOMXComponent::BufferInfo>",
   "name" : "android::SortedVector<android::SimpleSoftOMXComponent::BufferInfo>",
   "record_kind" : "class",
   "referenced_type" : "type-693",
   "self_type" : "type-693",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-251" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_22SimpleSoftOMXComponent10BufferInfoEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-97"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int> >",
   "record_kind" : "class",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-97",
   "self_type" : "type-97",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bStoreMetaData",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::StoreMetaDataInBuffersParams",
   "name" : "android::StoreMetaDataInBuffersParams",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android28StoreMetaDataInBuffersParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-960",
   "self_type" : "type-960",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-89"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-383"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-73"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-75"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-766"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-766"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-763"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "bufferHeader",
     "field_offset" : 128,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "nativeBuffer",
     "field_offset" : 160,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "android::UseAndroidNativeBufferParams",
   "name" : "android::UseAndroidNativeBufferParams",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android28UseAndroidNativeBufferParamsE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "android::Vector<android::SimpleSoftOMXComponent::BufferInfo>",
   "name" : "android::Vector<android::SimpleSoftOMXComponent::BufferInfo>",
   "record_kind" : "class",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-251" ],
   "unique_id" : "_ZTSN7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent10BufferInfoEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "android::Vector<android::SimpleSoftOMXComponent::PortInfo>",
   "name" : "android::Vector<android::SimpleSoftOMXComponent::PortInfo>",
   "record_kind" : "class",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-238" ],
   "unique_id" : "_ZTSN7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_22SimpleSoftOMXComponent8PortInfoEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "android::Vector<android::String8>",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-969",
   "self_type" : "type-969",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-960" ],
   "unique_id" : "_ZTSN7android6VectorINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-101"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-101"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::VideoDecoderOutputMetaData",
   "name" : "android::VideoDecoderOutputMetaData",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26VideoDecoderOutputMetaDataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eType",
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "pHandle",
     "field_offset" : 32,
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "android::VideoGrallocMetadata",
   "name" : "android::VideoGrallocMetadata",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android20VideoGrallocMetadataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eType",
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "pHandle",
     "field_offset" : 32,
     "referenced_type" : "type-207"
    }
   ],
   "linker_set_key" : "android::VideoNativeHandleMetadata",
   "name" : "android::VideoNativeHandleMetadata",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android25VideoNativeHandleMetadataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eType",
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 32,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "nFenceFd",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "android::VideoNativeMetadata",
   "name" : "android::VideoNativeMetadata",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android19VideoNativeMetadataE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-518"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::_AUnion_impl",
   "name" : "android::_AUnion_impl",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h",
   "unique_id" : "_ZTSN7android12_AUnion_implE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::_Flagged_helper",
   "name" : "android::_Flagged_helper",
   "referenced_type" : "type-913",
   "self_type" : "type-913",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/Flagged.h",
   "unique_id" : "_ZTSN7android15_Flagged_helperE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<unsigned int, unsigned int>",
   "name" : "android::aggregate_traits<unsigned int, unsigned int>",
   "referenced_type" : "type-804",
   "self_type" : "type-804",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIjjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-912"
    }
   ],
   "linker_set_key" : "android::are_unique<>",
   "name" : "android::are_unique<>",
   "referenced_type" : "type-911",
   "self_type" : "type-911",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-902"
    }
   ],
   "linker_set_key" : "android::are_unique<AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-901",
   "self_type" : "type-901",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_7AStringEPvNS_2spINS_8AMessageEEENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-899"
    }
   ],
   "linker_set_key" : "android::are_unique<Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-898",
   "self_type" : "type-898",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-897"
    }
   ],
   "linker_set_key" : "android::are_unique<double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-896",
   "self_type" : "type-896",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-895"
    }
   ],
   "linker_set_key" : "android::are_unique<float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-888"
    }
   ],
   "linker_set_key" : "android::are_unique<int, long long, unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<int, long long, unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-887",
   "self_type" : "type-887",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJixjfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-891"
    }
   ],
   "linker_set_key" : "android::are_unique<long long, unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<long long, unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-890",
   "self_type" : "type-890",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJxjfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-908"
    }
   ],
   "linker_set_key" : "android::are_unique<sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-907",
   "self_type" : "type-907",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_2spINS_7ABufferEEENS1_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-906"
    }
   ],
   "linker_set_key" : "android::are_unique<sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-905",
   "self_type" : "type-905",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_2spINS_8AMessageEEENS1_INS_7ABufferEEENS1_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-910"
    }
   ],
   "linker_set_key" : "android::are_unique<sp<RefBase> >",
   "name" : "android::are_unique<sp<RefBase> >",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_2spINS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-893"
    }
   ],
   "linker_set_key" : "android::are_unique<unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<unsigned int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-892",
   "self_type" : "type-892",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJjfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-904"
    }
   ],
   "linker_set_key" : "android::are_unique<void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-903",
   "self_type" : "type-903",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJPvNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-825"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AMessage::Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<android::AMessage::Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_8AMessage4RectEJNS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-828"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AMessage::Rect, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<android::AMessage::Rect, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-827",
   "self_type" : "type-827",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_8AMessage4RectEJNS_2spINS_7ABufferEEENS3_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-827"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AMessage::Rect, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<android::AMessage::Rect, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-826",
   "self_type" : "type-826",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_8AMessage4RectEJNS_2spIS1_EENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-829"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AMessage::Rect, sp<RefBase> >",
   "name" : "android::is_one_of<android::AMessage::Rect, sp<RefBase> >",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_8AMessage4RectEJNS_2spINS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-826"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AMessage::Rect, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<android::AMessage::Rect, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-825",
   "self_type" : "type-825",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_8AMessage4RectEJPvNS_2spIS1_EENS4_INS_7ABufferEEENS4_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-830"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AMessage::Rect>",
   "name" : "android::is_one_of<android::AMessage::Rect>",
   "referenced_type" : "type-829",
   "self_type" : "type-829",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_8AMessage4RectEJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-819"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AString, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<android::AString, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-818",
   "self_type" : "type-818",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_7AStringEJNS_2spINS_7ABufferEEENS2_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-818"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AString, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<android::AString, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-817",
   "self_type" : "type-817",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android9is_one_ofINS_7AStringEJNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-820"
    }
   ],
   "linker_set_key" : "android::is_one_of<android::AString, sp<RefBase> >",
   "name" : "android::is_one_of<android::AString, sp<RefBase> >",
   "referenced_type" : "type-819",
   "self_type" : "type-819",
   "size" : 1,
