{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "const char *[4]",
   "name" : "const char *[4]",
   "referenced_type" : "type-20",
   "self_type" : "type-19",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "std::__1::pair<std::__1::basic_string<char>, android::MediaCodecsXmlParser::CodecProperties> [2048]",
   "name" : "std::__1::pair<std::__1::basic_string<char>, android::MediaCodecsXmlParser::CodecProperties> [2048]",
   "referenced_type" : "type-12",
   "self_type" : "type-11",
   "size" : 278528,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned int",

   "linker_set_key" : "const char *",
   "name" : "const char *",
   "referenced_type" : "type-21",
   "self_type" : "type-20",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const char **",
   "name" : "const char **",
   "referenced_type" : "type-20",
   "self_type" : "type-51",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const char *const *",
   "name" : "const char *const *",
   "referenced_type" : "type-24",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-25",
   "self_type" : "type-50",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::MediaCodecsXmlParser",
   "name" : "const android::MediaCodecsXmlParser",
   "referenced_type" : "type-1",
   "self_type" : "type-42",
   "size" : 278760,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-22",
   "self_type" : "type-21",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const char *const",
   "name" : "const char *const",
   "referenced_type" : "type-20",
   "self_type" : "type-24",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const char *const[4]",
   "name" : "const char *const[4]",
   "referenced_type" : "type-19",
   "self_type" : "type-23",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties> > >",
   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties> > >",
   "referenced_type" : "type-46",
   "self_type" : "type-45",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties> > >",
   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties> > >",
   "referenced_type" : "type-49",
   "self_type" : "type-48",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > >",
   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > >",
   "referenced_type" : "type-41",
   "self_type" : "type-40",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParsingStatus",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentSection",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mUpdate",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mSectionStack",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mHrefBase",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mServiceAttributeMap",
     "field_offset" : 512,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentName",
     "field_offset" : 704,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mCodecSet",
     "field_offset" : 896,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mCodecListTemp",
     "field_offset" : 1088,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mCodecMap",
     "field_offset" : 2229312,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mCodecCounter",
     "field_offset" : 2229504,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentCodec",
     "field_offset" : 2229568,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentType",
     "field_offset" : 2229632,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mRoleMap",
     "field_offset" : 2229696,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mCommonPrefix",
     "field_offset" : 2229888,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser",
   "name" : "android::MediaCodecsXmlParser",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 278760,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParserE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "isEncoder",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "order",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "quirkSet",
     "field_offset" : 128,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "typeMap",
     "field_offset" : 320,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "aliases",
     "field_offset" : 512,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "rank",
     "field_offset" : 704,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser::CodecProperties",
   "name" : "android::MediaCodecsXmlParser::CodecProperties",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 112,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParser15CodecPropertiesE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "attributeList",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser::NodeInfo",
   "name" : "android::MediaCodecsXmlParser::NodeInfo",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParser8NodeInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "isEncoder",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "nodeList",
     "field_offset" : 256,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser::RoleProperties",
   "name" : "android::MediaCodecsXmlParser::RoleProperties",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 56,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParser14RolePropertiesE"
  }
 ],
 "rvalue_reference_types" : []
}
