{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "AHardwareBuffer_Plane [4]",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "type-2078",
   "self_type" : "type-2080",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "linker_set_key" : "C2ChromaOffsetStruct []",
   "name" : "C2ChromaOffsetStruct []",
   "referenced_type" : "type-3129",
   "self_type" : "type-3128",
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2PlaneInfo [4]",
   "name" : "C2PlaneInfo [4]",
   "referenced_type" : "type-62",
   "self_type" : "type-262",
   "size" : 176,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::MediaImage2::PlaneInfo [4]",
   "name" : "android::MediaImage2::PlaneInfo [4]",
   "referenced_type" : "type-2163",
   "self_type" : "type-2162",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::MediaImage::PlaneInfo [3]",
   "name" : "android::MediaImage::PlaneInfo [3]",
   "referenced_type" : "type-2158",
   "self_type" : "type-2157",
   "size" : 60,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",

   "linker_set_key" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "name" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "referenced_type" : "type-4409",
   "self_type" : "type-4408",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "name" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "referenced_type" : "type-768",
   "self_type" : "type-767",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > >",
   "name" : "const std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > >",
   "referenced_type" : "type-1974",
   "self_type" : "type-1973",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/hidl/1.0/utils/include/codec2/hidl/1.0/ComponentStore.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > >",
   "name" : "const std::vector<std::shared_ptr<C2ParamDescriptor>, std::allocator<std::shared_ptr<C2ParamDescriptor> > >",
   "referenced_type" : "type-4264",
   "self_type" : "type-4263",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/hidl/1.0/utils/include/codec2/hidl/1.0/ComponentStore.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::shared_ptr<const C2Info>, std::allocator<std::shared_ptr<const C2Info> > >",
   "name" : "const std::vector<std::shared_ptr<const C2Info>, std::allocator<std::shared_ptr<const C2Info> > >",
   "referenced_type" : "type-1289",
   "self_type" : "type-1288",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/hidl/1.0/utils/include/codec2/hidl/1.0/types.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > >",
   "name" : "const std::vector<std::unique_ptr<C2Param, std::default_delete<C2Param> >, std::allocator<std::unique_ptr<C2Param, std::default_delete<C2Param> > > >",
   "referenced_type" : "type-1286",
   "self_type" : "type-1285",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/hidl/1.0/utils/include/codec2/hidl/1.0/types.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::unique_ptr<C2Tuning, std::default_delete<C2Tuning> >, std::allocator<std::unique_ptr<C2Tuning, std::default_delete<C2Tuning> > > >",
   "name" : "const std::vector<std::unique_ptr<C2Tuning, std::default_delete<C2Tuning> >, std::allocator<std::unique_ptr<C2Tuning, std::default_delete<C2Tuning> > > >",
   "referenced_type" : "type-1292",
   "self_type" : "type-1291",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/hidl/1.0/utils/include/codec2/hidl/1.0/types.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-3",
   "self_type" : "type-3245",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-707",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-221",
   "self_type" : "type-1461",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-252",
   "self_type" : "type-3732",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-136",
   "self_type" : "type-286",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-27",
   "self_type" : "type-26",
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-21",
   "self_type" : "type-2230",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-2077",
   "self_type" : "type-2077",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Desc"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-1467"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-2078",
   "self_type" : "type-2078",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Plane"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-2080"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-2079",
   "self_type" : "type-2079",
   "size" : 72,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Planes"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2039"
    },
    {
     "field_name" : "width",
     "field_offset" : 448,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "height",
     "field_offset" : 480,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "stride",
     "field_offset" : 512,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 544,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 576,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 640,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 704,
     "referenced_type" : "type-2044"
    },
    {
     "field_name" : "handle",
     "field_offset" : 768,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "usage",
     "field_offset" : 832,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 896,
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-2038",
   "self_type" : "type-2038",
   "size" : 168,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-2001",
   "self_type" : "type-2001",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2Allocator",
   "name" : "C2Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-2835",
   "self_type" : "type-2835",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2Allocator",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI11C2Allocator"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2Allocator7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2Allocator5getIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2Allocator9getTraitsEv"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator19newLinearAllocationEj13C2MemoryUsagePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator21priorLinearAllocationEPK13native_handlePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator20newGraphicAllocationEjjj13C2MemoryUsagePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator22priorGraphicAllocationEPK13native_handlePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2AllocatorD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-2909"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportedTypes",
     "field_offset" : 224,
     "referenced_type" : "type-2884"
    },
    {
     "field_name" : "minimumUsage",
     "field_offset" : 256,
     "referenced_type" : "type-1364"
    },
    {
     "field_name" : "maximumUsage",
     "field_offset" : 320,
     "referenced_type" : "type-1364"
    }
   ],
   "linker_set_key" : "C2Allocator::Traits",
   "name" : "C2Allocator::Traits",
   "referenced_type" : "type-2908",
   "self_type" : "type-2908",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTSN11C2Allocator6TraitsE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2AllocatorStore",
   "name" : "C2AllocatorStore",
   "record_kind" : "class",
   "referenced_type" : "type-1793",
   "self_type" : "type-1793",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS16C2AllocatorStore",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16C2AllocatorStore"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore17listAllocators_nbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2AllocatorStore14fetchAllocatorEjPNSt3__110shared_ptrI11C2AllocatorEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16C2AllocatorStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16C2AllocatorStoreD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1930"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 128,
     "referenced_type" : "type-3541"
    }
   ],
   "linker_set_key" : "C2Block1D",
   "name" : "C2Block1D",
   "record_kind" : "class",
   "referenced_type" : "type-3540",
   "self_type" : "type-3540",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS9C2Block1D"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-376"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 192,
     "referenced_type" : "type-1080"
    }
   ],
   "linker_set_key" : "C2Block2D",
   "name" : "C2Block2D",
   "record_kind" : "class",
   "referenced_type" : "type-1079",
   "self_type" : "type-1079",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS9C2Block2D"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2BlockPool",
   "name" : "C2BlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-3309",
   "self_type" : "type-3309",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2BlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI11C2BlockPool"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2BlockPool10getLocalIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2BlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2BlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2BlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 64,
     "referenced_type" : "type-1617"
    }
   ],
   "linker_set_key" : "C2Buffer",
   "name" : "C2Buffer",
   "record_kind" : "class",
   "referenced_type" : "type-1616",
   "self_type" : "type-1616",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS8C2Buffer",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8C2Buffer"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8C2BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8C2BufferD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-1445"
    }
   ],
   "linker_set_key" : "C2BufferData",
   "name" : "C2BufferData",
   "record_kind" : "class",
   "referenced_type" : "type-1444",
   "self_type" : "type-1444",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS12C2BufferData"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2ChromaOffsetStruct",
   "name" : "C2ChromaOffsetStruct",
   "referenced_type" : "type-3129",
   "self_type" : "type-3129",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2ChromaOffsetStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3540"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReserved",
     "field_offset" : 256,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mCommitted",
     "field_offset" : 320,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mUsed",
     "field_offset" : 384,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mFree",
     "field_offset" : 448,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "C2CircularBlock",
   "name" : "C2CircularBlock",
   "record_kind" : "class",
   "referenced_type" : "type-3910",
   "self_type" : "type-3910",
   "size" : 64,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS15C2CircularBlock"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1801"
    }
   ],
   "linker_set_key" : "C2CircularWriteView",
   "name" : "C2CircularWriteView",
   "record_kind" : "class",
   "referenced_type" : "type-3966",
   "self_type" : "type-3966",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS19C2CircularWriteView"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3937"
    }
   ],
   "linker_set_key" : "C2CircularWriter",
   "name" : "C2CircularWriter",
   "record_kind" : "class",
   "referenced_type" : "type-4023",
   "self_type" : "type-4023",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS16C2CircularWriter"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2Color",
   "name" : "C2Color",
   "referenced_type" : "type-3235",
   "self_type" : "type-3235",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS7C2Color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "range",
     "referenced_type" : "type-3239"
    },
    {
     "field_name" : "primaries",
     "field_offset" : 32,
     "referenced_type" : "type-3240"
    },
    {
     "field_name" : "transfer",
     "field_offset" : 64,
     "referenced_type" : "type-3241"
    },
    {
     "field_name" : "matrix",
     "field_offset" : 96,
     "referenced_type" : "type-3242"
    }
   ],
   "linker_set_key" : "C2ColorAspectsStruct",
   "name" : "C2ColorAspectsStruct",
   "referenced_type" : "type-3243",
   "self_type" : "type-3243",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2ColorAspectsStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitDepth",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "subsampling",
     "field_offset" : 32,
     "referenced_type" : "type-3236"
    },
    {
     "field_name" : "locations",
     "field_offset" : 64,
     "referenced_type" : "type-3128"
    }
   ],
   "linker_set_key" : "C2ColorInfoStruct",
   "name" : "C2ColorInfoStruct",
   "referenced_type" : "type-3237",
   "self_type" : "type-3237",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS17C2ColorInfoStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2ColorXyStruct",
   "name" : "C2ColorXyStruct",
   "referenced_type" : "type-3247",
   "self_type" : "type-3247",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS15C2ColorXyStruct"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2Component",
   "name" : "C2Component",
   "record_kind" : "class",
   "referenced_type" : "type-1752",
   "self_type" : "type-1752",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS11C2Component",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI11C2Component"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component14setListener_vbERKNSt3__110shared_ptrINS_8ListenerEEE13c2_blocking_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8queue_nbEPNSt3__14listINS0_10unique_ptrI6C2WorkNS0_14default_deleteIS3_EEEENS0_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component11announce_nbERKNSt3__16vectorI13C2WorkOutlineNS0_9allocatorIS2_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8flush_smENS_12flush_mode_tEPNSt3__14listINS1_10unique_ptrI6C2WorkNS1_14default_deleteIS4_EEEENS1_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8drain_nbENS_12drain_mode_tE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component7releaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component4intfEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2ComponentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2ComponentD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2Component::Listener",
   "name" : "C2Component::Listener",
   "record_kind" : "class",
   "referenced_type" : "type-1755",
   "self_type" : "type-1755",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTSN11C2Component8ListenerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11C2Component8ListenerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8Listener13onWorkDone_nbENSt3__18weak_ptrIS_EENS1_4listINS1_10unique_ptrI6C2WorkNS1_14default_deleteIS6_EEEENS1_9allocatorIS9_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8Listener12onTripped_nbENSt3__18weak_ptrIS_EENS1_6vectorINS1_10shared_ptrI15C2SettingResultEENS1_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8Listener10onError_nbENSt3__18weak_ptrIS_EEj"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2Component8ListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2Component8ListenerD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-1232"
    },
    {
     "field_name" : "domain",
     "field_offset" : 192,
     "referenced_type" : "type-1233"
    },
    {
     "field_name" : "kind",
     "field_offset" : 224,
     "referenced_type" : "type-1234"
    },
    {
     "field_name" : "rank",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mediaType",
     "field_offset" : 320,
     "referenced_type" : "type-1235"
    },
    {
     "field_name" : "owner",
     "field_offset" : 512,
     "referenced_type" : "type-1236"
    },
    {
     "field_name" : "aliases",
     "field_offset" : 704,
     "referenced_type" : "type-1237"
    }
   ],
   "linker_set_key" : "C2Component::Traits",
   "name" : "C2Component::Traits",
   "referenced_type" : "type-1231",
   "self_type" : "type-1231",
   "size" : 112,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTSN11C2Component6TraitsE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2ComponentInterface",
   "name" : "C2ComponentInterface",
   "record_kind" : "class",
   "referenced_type" : "type-1749",
   "self_type" : "type-1749",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS20C2ComponentInterface",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI20C2ComponentInterface"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface5getIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface8query_vbERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEERKNS1_INS2_5IndexENS4_IS9_EEEE13c2_blocking_tPNS1_INS0_10unique_ptrIS2_NS0_14default_deleteIS2_EEEENS4_ISI_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN20C2ComponentInterface9config_vbERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEE13c2_blocking_tPNS1_INS0_10unique_ptrI15C2SettingResultNS0_14default_deleteISB_EEEENS4_ISE_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN20C2ComponentInterface15createTunnel_smEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN20C2ComponentInterface16releaseTunnel_smEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface23querySupportedParams_nbEPNSt3__16vectorINS0_10shared_ptrI17C2ParamDescriptorEENS0_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface23querySupportedValues_vbERNSt3__16vectorI27C2FieldSupportedValuesQueryNS0_9allocatorIS2_EEEE13c2_blocking_t"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN20C2ComponentInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN20C2ComponentInterfaceD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2ComponentStore",
   "name" : "C2ComponentStore",
   "record_kind" : "class",
   "referenced_type" : "type-1798",
   "self_type" : "type-1798",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS16C2ComponentStore",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16C2ComponentStore"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore15createComponentENSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEEPNS0_10shared_ptrI11C2ComponentEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore15createInterfaceENSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEEPNS0_10shared_ptrI20C2ComponentInterfaceEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore14listComponentsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore10copyBufferENSt3__110shared_ptrI15C2GraphicBufferEES3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore8query_smERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEERKNS1_INS2_5IndexENS4_IS9_EEEEPNS1_INS0_10unique_ptrIS2_NS0_14default_deleteIS2_EEEENS4_ISH_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore9config_smERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEEPNS1_INS0_10unique_ptrI15C2SettingResultNS0_14default_deleteISA_EEEENS4_ISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore17getParamReflectorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore23querySupportedParams_nbEPNSt3__16vectorINS0_10shared_ptrI17C2ParamDescriptorEENS0_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore23querySupportedValues_smERNSt3__16vectorI27C2FieldSupportedValuesQueryNS0_9allocatorIS2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ComponentStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ComponentStoreD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2Config",
   "name" : "C2Config",
   "referenced_type" : "type-3162",
   "self_type" : "type-3162",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS8C2Config"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1079"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 320,
     "referenced_type" : "type-1278"
    }
   ],
   "linker_set_key" : "C2ConstGraphicBlock",
   "name" : "C2ConstGraphicBlock",
   "record_kind" : "class",
   "referenced_type" : "type-1277",
   "self_type" : "type-1277",
   "size" : 56,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS19C2ConstGraphicBlock"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3540"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 256,
     "referenced_type" : "type-1278"
    }
   ],
   "linker_set_key" : "C2ConstLinearBlock",
   "name" : "C2ConstLinearBlock",
   "record_kind" : "class",
   "referenced_type" : "type-3748",
   "self_type" : "type-3748",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS18C2ConstLinearBlock"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-3119"
    }
   ],
   "linker_set_key" : "C2EasyEnum<c2_bool_t>",
   "name" : "C2EasyEnum<c2_bool_t>",
   "referenced_type" : "type-3118",
   "self_type" : "type-3118",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Enum.h",
   "template_args" : [ "type-3119" ],
   "unique_id" : "_ZTS10C2EasyEnumI9c2_bool_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-1627"
    }
   ],
   "linker_set_key" : "C2Event",
   "name" : "C2Event",
   "record_kind" : "class",
   "referenced_type" : "type-1626",
   "self_type" : "type-1626",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS7C2Event"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-1279"
    }
   ],
   "linker_set_key" : "C2Fence",
   "name" : "C2Fence",
   "record_kind" : "class",
   "referenced_type" : "type-1278",
   "self_type" : "type-1278",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS7C2Fence"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mType",
     "referenced_type" : "type-1124"
    },
    {
     "access" : "private",
     "field_name" : "_mExtent",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mName",
     "field_offset" : 64,
     "referenced_type" : "type-1125"
    },
    {
     "access" : "private",
     "field_name" : "_mNamedValues",
     "field_offset" : 256,
     "referenced_type" : "type-1126"
    },
    {
     "access" : "private",
     "field_name" : "_mFieldId",
     "field_offset" : 448,
     "referenced_type" : "type-1052"
    }
   ],
   "linker_set_key" : "C2FieldDescriptor",
   "name" : "C2FieldDescriptor",
   "referenced_type" : "type-1123",
   "self_type" : "type-1123",
   "size" : 64,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS17C2FieldDescriptor"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2FieldDescriptor::_NamedValuesGetter<C2EasyEnum<c2_bool_t>, true>",
   "name" : "C2FieldDescriptor::_NamedValuesGetter<C2EasyEnum<c2_bool_t>, true>",
   "referenced_type" : "type-3417",
   "self_type" : "type-3417",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "template_args" : [ "type-3118" ],
   "unique_id" : "_ZTSN17C2FieldDescriptor18_NamedValuesGetterI10C2EasyEnumI9c2_bool_tELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1224"
    },
    {
     "field_name" : "range",
     "field_offset" : 64,
     "referenced_type" : "type-1225"
    },
    {
     "field_name" : "values",
     "field_offset" : 384,
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValues",
   "name" : "C2FieldSupportedValues",
   "referenced_type" : "type-1223",
   "self_type" : "type-1223",
   "size" : 72,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS22C2FieldSupportedValues"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "type-1083"
    },
    {
     "field_name" : "max",
     "field_offset" : 64,
     "referenced_type" : "type-1083"
    },
    {
     "field_name" : "step",
     "field_offset" : 128,
     "referenced_type" : "type-1083"
    },
    {
     "field_name" : "num",
     "field_offset" : 192,
     "referenced_type" : "type-1083"
    },
    {
     "field_name" : "denom",
     "field_offset" : 256,
     "referenced_type" : "type-1083"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "C2FieldSupportedValues::(anonymous struct at frameworks/av/media/codec2/core/include/C2Param.h:1530:5) at frameworks/av/media/codec2/core/include/C2Param.h:1530:5",
   "name" : "C2FieldSupportedValues::(anonymous struct at frameworks/av/media/codec2/core/include/C2Param.h:1530:5) at frameworks/av/media/codec2/core/include/C2Param.h:1530:5",
   "referenced_type" : "type-1225",
   "self_type" : "type-1225",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN22C2FieldSupportedValuesUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mField",
     "referenced_type" : "type-1057"
    },
    {
     "access" : "private",
     "field_name" : "_mType",
     "field_offset" : 96,
     "referenced_type" : "type-1221"
    },
    {
     "field_name" : "status",
     "field_offset" : 128,
     "referenced_type" : "type-1222"
    },
    {
     "field_name" : "values",
     "field_offset" : 192,
     "referenced_type" : "type-1223"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesQuery",
   "name" : "C2FieldSupportedValuesQuery",
   "referenced_type" : "type-1220",
   "self_type" : "type-1220",
   "size" : 96,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS27C2FieldSupportedValuesQuery"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pixelFormat",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitDepth",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "subsampling",
     "field_offset" : 64,
     "referenced_type" : "type-3236"
    },
    {
     "field_name" : "layout",
     "field_offset" : 96,
     "referenced_type" : "type-3272"
    }
   ],
   "linker_set_key" : "C2FlexiblePixelFormatDescriptorStruct",
   "name" : "C2FlexiblePixelFormatDescriptorStruct",
   "referenced_type" : "type-3271",
   "self_type" : "type-3271",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS37C2FlexiblePixelFormatDescriptorStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-1649"
    },
    {
     "field_name" : "ordinal",
     "field_offset" : 64,
     "referenced_type" : "type-1641"
    },
    {
     "field_name" : "buffers",
     "field_offset" : 256,
     "referenced_type" : "type-1650"
    },
    {
     "field_name" : "configUpdate",
     "field_offset" : 448,
     "referenced_type" : "type-1651"
    },
    {
     "field_name" : "infoBuffers",
     "field_offset" : 640,
     "referenced_type" : "type-1652"
    }
   ],
   "linker_set_key" : "C2FrameData",
   "name" : "C2FrameData",
   "referenced_type" : "type-1648",
   "self_type" : "type-1648",
   "size" : 104,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS11C2FrameData"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2FrameInfoParser",
   "name" : "C2FrameInfoParser",
   "record_kind" : "class",
   "referenced_type" : "type-1791",
   "self_type" : "type-1791",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS17C2FrameInfoParser",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2FrameInfoParser"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2FrameInfoParser7getTypeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2FrameInfoParser15getParsedParamsEv"
    },
    {
     "mangled_component_name" : "_ZN17C2FrameInfoParser5resetEv"
    },
    {
     "mangled_component_name" : "_ZN17C2FrameInfoParser10parseFrameER11C2FrameData"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2FrameInfoParserD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2FrameInfoParserD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1050"
    },
    {
     "referenced_type" : "type-1128"
    },
    {
     "referenced_type" : "type-1129"
    }
   ],
   "linker_set_key" : "C2GlobalParam<C2Info, android::hardware::media::c2::V1_0::utils::C2Hidl_Range, 0, void>",
   "name" : "C2GlobalParam<C2Info, android::hardware::media::c2::V1_0::utils::C2Hidl_Range, 0, void>",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1050", "type-1128", "type-27" ],
   "unique_id" : "_ZTS13C2GlobalParamI6C2InfoN7android8hardware5media2c24V1_05utils12C2Hidl_RangeELi0EvE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1050"
    },
    {
     "referenced_type" : "type-1132"
    },
    {
     "referenced_type" : "type-1133"
    }
   ],
   "linker_set_key" : "C2GlobalParam<C2Info, android::hardware::media::c2::V1_0::utils::C2Hidl_Rect, 1, void>",
   "name" : "C2GlobalParam<C2Info, android::hardware::media::c2::V1_0::utils::C2Hidl_Rect, 1, void>",
   "referenced_type" : "type-1131",
   "self_type" : "type-1131",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1050", "type-1132", "type-27" ],
   "unique_id" : "_ZTS13C2GlobalParamI6C2InfoN7android8hardware5media2c24V1_05utils11C2Hidl_RectELi1EvE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    },
    {
     "referenced_type" : "type-3117"
    },
    {
     "referenced_type" : "type-3404"
    }
   ],
   "linker_set_key" : "C2GlobalParam<C2Tuning, C2SimpleValueStruct<C2EasyEnum<c2_bool_t> >, 16393, void>",
   "name" : "C2GlobalParam<C2Tuning, C2SimpleValueStruct<C2EasyEnum<c2_bool_t> >, 16393, void>",
   "referenced_type" : "type-3403",
   "self_type" : "type-3403",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1049", "type-3117", "type-27" ],
   "unique_id" : "_ZTS13C2GlobalParamI8C2Tuning19C2SimpleValueStructI10C2EasyEnumI9c2_bool_tEELi16393EvE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "type-3250"
    },
    {
     "field_name" : "count",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2GopLayerStruct",
   "name" : "C2GopLayerStruct",
   "referenced_type" : "type-3251",
   "self_type" : "type-3251",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS16C2GopLayerStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "C2GraphicAllocation",
   "name" : "C2GraphicAllocation",
   "record_kind" : "class",
   "referenced_type" : "type-1026",
   "self_type" : "type-1026",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS19C2GraphicAllocation",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI19C2GraphicAllocation"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN19C2GraphicAllocation3mapE6C2Rect13C2MemoryUsageP7C2FenceP14C2PlanarLayoutPPh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN19C2GraphicAllocation5unmapEPPh6C2RectP7C2Fence"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK19C2GraphicAllocation14getAllocatorIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK19C2GraphicAllocation6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK19C2GraphicAllocation6equalsERKNSt3__110shared_ptrIKS_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN19C2GraphicAllocationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN19C2GraphicAllocationD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1079"
    }
   ],
   "linker_set_key" : "C2GraphicBlock",
   "name" : "C2GraphicBlock",
   "record_kind" : "class",
   "referenced_type" : "type-1362",
   "self_type" : "type-1362",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS14C2GraphicBlock"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-551"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 192,
     "referenced_type" : "type-1161"
    }
   ],
   "linker_set_key" : "C2GraphicView",
   "name" : "C2GraphicView",
   "record_kind" : "class",
   "referenced_type" : "type-1160",
   "self_type" : "type-1160",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS13C2GraphicView"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mastering",
     "referenced_type" : "type-3248"
    },
    {
     "field_name" : "maxCll",
     "field_offset" : 320,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "maxFall",
     "field_offset" : 352,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2HdrStaticMetadataStruct",
   "name" : "C2HdrStaticMetadataStruct",
   "referenced_type" : "type-3249",
   "self_type" : "type-3249",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS25C2HdrStaticMetadataStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-981"
    }
   ],
   "linker_set_key" : "C2Info",
   "name" : "C2Info",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS6C2Info"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2InfoBuffer",
   "name" : "C2InfoBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-1637",
   "self_type" : "type-1637",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS12C2InfoBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-3255"
    },
    {
     "field_name" : "period",
     "field_offset" : 32,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2IntraRefreshStruct",
   "name" : "C2IntraRefreshStruct",
   "referenced_type" : "type-3256",
   "self_type" : "type-3256",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2IntraRefreshStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1801"
    }
   ],
   "linker_set_key" : "C2LinearAllocation",
   "name" : "C2LinearAllocation",
   "record_kind" : "class",
   "referenced_type" : "type-3146",
   "self_type" : "type-3146",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS18C2LinearAllocation",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18C2LinearAllocation"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2LinearAllocation3mapEmm13C2MemoryUsageP7C2FencePPv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2LinearAllocation5unmapEPvmP7C2Fence"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18C2LinearAllocation14getAllocatorIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18C2LinearAllocation6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18C2LinearAllocation6equalsERKNSt3__110shared_ptrIS_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18C2LinearAllocationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18C2LinearAllocationD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3540"
    }
   ],
   "linker_set_key" : "C2LinearBlock",
   "name" : "C2LinearBlock",
   "record_kind" : "class",
   "referenced_type" : "type-3883",
   "self_type" : "type-3883",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS13C2LinearBlock"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1801"
    }
   ],
   "linker_set_key" : "C2LinearCapacity",
   "name" : "C2LinearCapacity",
   "record_kind" : "class",
   "referenced_type" : "type-2601",
   "self_type" : "type-2601",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS16C2LinearCapacity"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1930"
    }
   ],
   "linker_set_key" : "C2LinearRange",
   "name" : "C2LinearRange",
   "record_kind" : "class",
   "referenced_type" : "type-2422",
   "self_type" : "type-2422",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS13C2LinearRange"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "type-3247"
    },
    {
     "field_name" : "green",
     "field_offset" : 64,
     "referenced_type" : "type-3247"
    },
    {
     "field_name" : "blue",
     "field_offset" : 128,
     "referenced_type" : "type-3247"
    },
    {
     "field_name" : "white",
     "field_offset" : 192,
     "referenced_type" : "type-3247"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2MasteringDisplayColorVolumeStruct",
   "name" : "C2MasteringDisplayColorVolumeStruct",
   "referenced_type" : "type-3248",
   "self_type" : "type-3248",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS35C2MasteringDisplayColorVolumeStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "expected",
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "C2MemoryUsage",
   "name" : "C2MemoryUsage",
   "referenced_type" : "type-1364",
   "self_type" : "type-1364",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2BufferBase.h",
   "unique_id" : "_ZTS13C2MemoryUsage"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pool",
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "usage",
     "field_offset" : 64,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "planar",
     "field_offset" : 128,
     "referenced_type" : "type-3216"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "capacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "outOfMemory",
     "field_offset" : 256,
     "referenced_type" : "type-3119"
    }
   ],
   "linker_set_key" : "C2OutOfMemoryStruct",
   "name" : "C2OutOfMemoryStruct",
   "referenced_type" : "type-3218",
   "self_type" : "type-3218",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS19C2OutOfMemoryStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mSize",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mIndex",
     "field_offset" : 32,
     "referenced_type" : "type-982"
    }
   ],
   "linker_set_key" : "C2Param",
   "name" : "C2Param",
   "referenced_type" : "type-981",
   "self_type" : "type-981",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS7C2Param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mIndex",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2Param::CoreIndex",
   "name" : "C2Param::CoreIndex",
   "referenced_type" : "type-984",
   "self_type" : "type-984",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Param9CoreIndexE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-983"
    }
   ],
   "linker_set_key" : "C2Param::Index",
   "name" : "C2Param::Index",
   "referenced_type" : "type-982",
   "self_type" : "type-982",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Param5IndexE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-984"
    }
   ],
   "linker_set_key" : "C2Param::Type",
   "name" : "C2Param::Type",
   "referenced_type" : "type-983",
   "self_type" : "type-983",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Param4TypeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mIndex",
     "referenced_type" : "type-1028"
    },
    {
     "access" : "private",
     "field_name" : "_mAttrib",
     "field_offset" : 32,
     "referenced_type" : "type-707"
    },
    {
     "access" : "private",
     "field_name" : "_mName",
     "field_offset" : 64,
     "referenced_type" : "type-369"
    },
    {
     "access" : "private",
     "field_name" : "_mDependencies",
     "field_offset" : 256,
     "referenced_type" : "type-1212"
    }
   ],
   "linker_set_key" : "C2ParamDescriptor",
   "name" : "C2ParamDescriptor",
   "referenced_type" : "type-1211",
   "self_type" : "type-1211",
   "size" : 56,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS17C2ParamDescriptor"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mIndex",
     "referenced_type" : "type-982"
    },
    {
     "access" : "private",
     "field_name" : "_mFieldId",
     "field_offset" : 32,
     "referenced_type" : "type-1052"
    }
   ],
   "linker_set_key" : "C2ParamField",
   "name" : "C2ParamField",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS12C2ParamField"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "paramOrField",
     "referenced_type" : "type-1057"
    },
    {
     "field_name" : "values",
     "field_offset" : 128,
     "referenced_type" : "type-1204"
    }
   ],
   "linker_set_key" : "C2ParamFieldValues",
   "name" : "C2ParamFieldValues",
   "referenced_type" : "type-1203",
   "self_type" : "type-1203",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS18C2ParamFieldValues"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2ParamReflector",
   "name" : "C2ParamReflector",
   "record_kind" : "class",
   "referenced_type" : "type-1326",
   "self_type" : "type-1326",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS16C2ParamReflector",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16C2ParamReflector"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ParamReflector8describeEN7C2Param9CoreIndexE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ParamReflectorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ParamReflectorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2PictureSizeStruct",
   "name" : "C2PictureSizeStruct",
   "referenced_type" : "type-3216",
   "self_type" : "type-3216",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS19C2PictureSizeStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "C2PlanarCapacity",
   "name" : "C2PlanarCapacity",
   "record_kind" : "class",
   "referenced_type" : "type-921",
   "self_type" : "type-921",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS16C2PlanarCapacity"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "numPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rootPlanes",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 96,
     "referenced_type" : "type-262"
    }
   ],
   "linker_set_key" : "C2PlanarLayout",
   "name" : "C2PlanarLayout",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 188,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS14C2PlanarLayout"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-376"
    }
   ],
   "linker_set_key" : "C2PlanarSection",
   "name" : "C2PlanarSection",
   "record_kind" : "class",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS15C2PlanarSection"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channel",
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "colInc",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "rowInc",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "colSampling",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowSampling",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "allocatedDepth",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitDepth",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rightShift",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 256,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "rootIx",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2PlaneInfo",
   "name" : "C2PlaneInfo",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 44,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2PlaneInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "profile",
     "referenced_type" : "type-3179"
    },
    {
     "field_name" : "level",
     "field_offset" : 32,
     "referenced_type" : "type-3180"
    }
   ],
   "linker_set_key" : "C2ProfileLevelStruct",
   "name" : "C2ProfileLevelStruct",
   "referenced_type" : "type-3181",
   "self_type" : "type-3181",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2ProfileLevelStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1801"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 64,
     "referenced_type" : "type-3628"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2ReadView",
   "name" : "C2ReadView",
   "record_kind" : "class",
   "referenced_type" : "type-3627",
   "self_type" : "type-3627",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS10C2ReadView"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "left",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "top",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2Rect",
   "name" : "C2Rect",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS6C2Rect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-377"
    }
   ],
   "linker_set_key" : "C2RectStruct",
   "name" : "C2RectStruct",
   "referenced_type" : "type-3226",
   "self_type" : "type-3226",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS12C2RectStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flip",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "C2RotationStruct",
   "name" : "C2RotationStruct",
   "referenced_type" : "type-3230",
   "self_type" : "type-3230",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS16C2RotationStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2Segment",
   "name" : "C2Segment",
   "referenced_type" : "type-1633",
   "self_type" : "type-1633",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS9C2Segment"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-981"
    }
   ],
   "linker_set_key" : "C2Setting",
   "name" : "C2Setting",
   "referenced_type" : "type-1047",
   "self_type" : "type-1047",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS9C2Setting"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "failure",
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "field",
     "field_offset" : 64,
     "referenced_type" : "type-1203"
    },
    {
     "field_name" : "conflicts",
     "field_offset" : 256,
     "referenced_type" : "type-1205"
    }
   ],
   "linker_set_key" : "C2SettingResult",
   "name" : "C2SettingResult",
   "referenced_type" : "type-1201",
   "self_type" : "type-1201",
   "size" : 56,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS15C2SettingResult"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-3118"
    }
   ],
   "linker_set_key" : "C2SimpleValueStruct<C2EasyEnum<c2_bool_t> >",
   "name" : "C2SimpleValueStruct<C2EasyEnum<c2_bool_t> >",
   "referenced_type" : "type-3117",
   "self_type" : "type-3117",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3118" ],
   "unique_id" : "_ZTS19C2SimpleValueStructI10C2EasyEnumI9c2_bool_tEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "C2SimpleValueStruct<unsigned long>",
   "name" : "C2SimpleValueStruct<unsigned long>",
   "referenced_type" : "type-3528",
   "self_type" : "type-3528",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-221" ],
   "unique_id" : "_ZTS19C2SimpleValueStructImE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "capacity",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "heapMask",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "allocFlags",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "minAlignment",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2StoreIonUsageStruct",
   "name" : "C2StoreIonUsageStruct",
   "referenced_type" : "type-3269",
   "self_type" : "type-3269",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS21C2StoreIonUsageStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1050"
    },
    {
     "referenced_type" : "type-3216"
    },
    {
     "access" : "private",
     "referenced_type" : "type-3682"
    }
   ],
   "linker_set_key" : "C2StreamParam<C2Info, C2PictureSizeStruct, 6144, void>",
   "name" : "C2StreamParam<C2Info, C2PictureSizeStruct, 6144, void>",
   "referenced_type" : "type-3681",
   "self_type" : "type-3681",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1050", "type-3216", "type-27" ],
   "unique_id" : "_ZTS13C2StreamParamI6C2Info19C2PictureSizeStructLi6144EvE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1050"
    },
    {
     "referenced_type" : "type-3216"
    },
    {
     "referenced_type" : "type-3684"
    }
   ],
   "linker_set_key" : "C2StreamParam<C2Info, C2PictureSizeStruct, 6144, void>::input",
   "name" : "C2StreamParam<C2Info, C2PictureSizeStruct, 6144, void>::input",
   "referenced_type" : "type-3683",
   "self_type" : "type-3683",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTSN13C2StreamParamI6C2Info19C2PictureSizeStructLi6144EvE5inputE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    },
    {
     "referenced_type" : "type-3528"
    },
    {
     "access" : "private",
     "referenced_type" : "type-3674"
    }
   ],
   "linker_set_key" : "C2StreamParam<C2Tuning, C2SimpleValueStruct<unsigned long>, 2076, void>",
   "name" : "C2StreamParam<C2Tuning, C2SimpleValueStruct<unsigned long>, 2076, void>",
   "referenced_type" : "type-3673",
   "self_type" : "type-3673",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1049", "type-3528", "type-27" ],
   "unique_id" : "_ZTS13C2StreamParamI8C2Tuning19C2SimpleValueStructImELi2076EvE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    },
    {
     "referenced_type" : "type-3528"
    },
    {
     "referenced_type" : "type-3679"
    }
   ],
   "linker_set_key" : "C2StreamParam<C2Tuning, C2SimpleValueStruct<unsigned long>, 2076, void>::input",
   "name" : "C2StreamParam<C2Tuning, C2SimpleValueStruct<unsigned long>, 2076, void>::input",
   "referenced_type" : "type-3678",
   "self_type" : "type-3678",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTSN13C2StreamParamI8C2Tuning19C2SimpleValueStructImELi2076EvE5inputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mType",
     "referenced_type" : "type-993"
    },
    {
     "access" : "private",
     "field_name" : "_mFields",
     "field_offset" : 64,
     "referenced_type" : "type-1187"
    }
   ],
   "linker_set_key" : "C2StructDescriptor",
   "name" : "C2StructDescriptor",
   "referenced_type" : "type-1186",
   "self_type" : "type-1186",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS18C2StructDescriptor"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "type-3188"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-3123"
    }
   ],
   "linker_set_key" : "C2SupplementalDataStruct",
   "name" : "C2SupplementalDataStruct",
   "referenced_type" : "type-3189",
   "self_type" : "type-3189",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS24C2SupplementalDataStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layerCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLayerCount",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitrateRatios",
     "field_offset" : 64,
     "referenced_type" : "type-1519"
    }
   ],
   "linker_set_key" : "C2TemporalLayeringStruct",
   "name" : "C2TemporalLayeringStruct",
   "referenced_type" : "type-3253",
   "self_type" : "type-3253",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS24C2TemporalLayeringStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tile",
     "referenced_type" : "type-3216"
    },
    {
     "field_name" : "columnCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowCount",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "order",
     "field_offset" : 128,
     "referenced_type" : "type-3258"
    }
   ],
   "linker_set_key" : "C2TileLayoutStruct",
   "name" : "C2TileLayoutStruct",
   "referenced_type" : "type-3259",
   "self_type" : "type-3259",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS18C2TileLayoutStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "enabled",
     "referenced_type" : "type-3119"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 64,
     "referenced_type" : "type-196"
    }
   ],
   "linker_set_key" : "C2TimedControlStruct",
   "name" : "C2TimedControlStruct",
   "referenced_type" : "type-3273",
   "self_type" : "type-3273",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2TimedControlStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-3276"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "C2TimestampGapAdjustmentStruct",
   "name" : "C2TimestampGapAdjustmentStruct",
   "referenced_type" : "type-3275",
   "self_type" : "type-3275",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS30C2TimestampGapAdjustmentStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1047"
    }
   ],
   "linker_set_key" : "C2Tuning",
   "name" : "C2Tuning",
   "referenced_type" : "type-1049",
   "self_type" : "type-1049",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS8C2Tuning"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mType",
     "referenced_type" : "type-1082"
    },
    {
     "access" : "private",
     "field_name" : "_mValue",
     "field_offset" : 64,
     "referenced_type" : "type-1083"
    }
   ],
   "linker_set_key" : "C2Value",
   "name" : "C2Value",
   "record_kind" : "class",
   "referenced_type" : "type-1081",
   "self_type" : "type-1081",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS7C2Value"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "u64",
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "c64",
     "referenced_type" : "type-1084"
    },
    {
     "field_name" : "u32",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "i32",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "c32",
     "referenced_type" : "type-1085"
    },
    {
     "field_name" : "fp",
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "C2Value::Primitive",
   "name" : "C2Value::Primitive",
   "record_kind" : "union",
   "referenced_type" : "type-1083",
   "self_type" : "type-1083",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Value9PrimitiveE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chainInfo",
     "referenced_type" : "type-1701"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-1648"
    },
    {
     "field_name" : "worklets",
     "field_offset" : 960,
     "referenced_type" : "type-1702"
    },
    {
     "field_name" : "workletsProcessed",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "result",
     "field_offset" : 1184,
     "referenced_type" : "type-1222"
    }
   ],
   "linker_set_key" : "C2Work",
   "name" : "C2Work",
   "referenced_type" : "type-1700",
   "self_type" : "type-1700",
   "size" : 152,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS6C2Work"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-1084"
    },
    {
     "field_name" : "frameIndex",
     "field_offset" : 64,
     "referenced_type" : "type-1084"
    },
    {
     "field_name" : "customOrdinal",
     "field_offset" : 128,
     "referenced_type" : "type-1084"
    }
   ],
   "linker_set_key" : "C2WorkOrdinalStruct",
   "name" : "C2WorkOrdinalStruct",
   "referenced_type" : "type-1641",
   "self_type" : "type-1641",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS19C2WorkOrdinalStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ordinal",
     "referenced_type" : "type-1641"
    },
    {
     "field_name" : "chain",
     "field_offset" : 192,
     "referenced_type" : "type-1727"
    }
   ],
   "linker_set_key" : "C2WorkOutline",
   "name" : "C2WorkOutline",
   "referenced_type" : "type-1726",
   "self_type" : "type-1726",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS13C2WorkOutline"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "component",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tunings",
     "field_offset" : 64,
     "referenced_type" : "type-1686"
    },
    {
     "field_name" : "failures",
     "field_offset" : 256,
     "referenced_type" : "type-1687"
    },
    {
     "field_name" : "output",
     "field_offset" : 448,
     "referenced_type" : "type-1648"
    }
   ],
   "linker_set_key" : "C2Worklet",
   "name" : "C2Worklet",
   "referenced_type" : "type-1685",
   "self_type" : "type-1685",
   "size" : 160,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS9C2Worklet"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2721"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 128,
     "referenced_type" : "type-3687"
    }
   ],
   "linker_set_key" : "C2WriteView",
   "name" : "C2WriteView",
   "record_kind" : "class",
   "referenced_type" : "type-3686",
   "self_type" : "type-3686",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2WriteView"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "type-2248"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "referenced_type" : "type-2250",
   "self_type" : "type-2250",
   "size" : 1025,
   "source_file" : "/system/core/base/include/android-base/file.h",
   "unique_id" : "_ZTS12TemporaryDir"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "type-2248"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "referenced_type" : "type-2247",
   "self_type" : "type-2247",
   "size" : 1032,
   "source_file" : "/system/core/base/include/android-base/file.h",
   "unique_id" : "_ZTS13TemporaryFile"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1801"
    }
   ],
   "linker_set_key" : "_C2CircularBlockSegment",
   "name" : "_C2CircularBlockSegment",
   "record_kind" : "class",
   "referenced_type" : "type-3937",
   "self_type" : "type-3937",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS23_C2CircularBlockSegment"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3525"
    }
   ],
   "linker_set_key" : "_C2Comparable<C2PictureSizeStruct>",
   "name" : "_C2Comparable<C2PictureSizeStruct>",
   "referenced_type" : "type-3524",
   "self_type" : "type-3524",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3216" ],
   "unique_id" : "_ZTS13_C2ComparableI19C2PictureSizeStructE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3116"
    }
   ],
   "linker_set_key" : "_C2Comparable<C2SimpleValueStruct<C2EasyEnum<c2_bool_t> > >",
   "name" : "_C2Comparable<C2SimpleValueStruct<C2EasyEnum<c2_bool_t> > >",
   "referenced_type" : "type-3115",
   "self_type" : "type-3115",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3117" ],
   "unique_id" : "_ZTS13_C2ComparableI19C2SimpleValueStructI10C2EasyEnumI9c2_bool_tEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3527"
    }
   ],
   "linker_set_key" : "_C2Comparable<C2SimpleValueStruct<unsigned long> >",
   "name" : "_C2Comparable<C2SimpleValueStruct<unsigned long> >",
   "referenced_type" : "type-3526",
   "self_type" : "type-3526",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3528" ],
   "unique_id" : "_ZTS13_C2ComparableI19C2SimpleValueStructImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1192"
    }
   ],
   "linker_set_key" : "_C2Comparable<android::hardware::media::c2::V1_0::utils::C2Hidl_Range>",
   "name" : "_C2Comparable<android::hardware::media::c2::V1_0::utils::C2Hidl_Range>",
   "referenced_type" : "type-1191",
   "self_type" : "type-1191",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1128" ],
   "unique_id" : "_ZTS13_C2ComparableIN7android8hardware5media2c24V1_05utils12C2Hidl_RangeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1194"
    }
   ],
   "linker_set_key" : "_C2Comparable<android::hardware::media::c2::V1_0::utils::C2Hidl_Rect>",
   "name" : "_C2Comparable<android::hardware::media::c2::V1_0::utils::C2Hidl_Rect>",
   "referenced_type" : "type-1193",
   "self_type" : "type-1193",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1132" ],
   "unique_id" : "_ZTS13_C2ComparableIN7android8hardware5media2c24V1_05utils11C2Hidl_RectEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2Comparable_impl",
   "name" : "_C2Comparable_impl",
   "referenced_type" : "type-3134",
   "self_type" : "type-3134",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS18_C2Comparable_impl"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2CoreIndexHelper_impl",
   "name" : "_C2CoreIndexHelper_impl",
   "referenced_type" : "type-3135",
   "self_type" : "type-3135",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS23_C2CoreIndexHelper_impl"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1930"
    }
   ],
   "linker_set_key" : "_C2EditableLinearRangeAspect",
   "name" : "_C2EditableLinearRangeAspect",
   "record_kind" : "class",
   "referenced_type" : "type-2721",
   "self_type" : "type-2721",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS28_C2EditableLinearRangeAspect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-376"
    }
   ],
   "linker_set_key" : "_C2EditablePlanarSectionAspect",
   "name" : "_C2EditablePlanarSectionAspect",
   "record_kind" : "class",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS30_C2EditablePlanarSectionAspect"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2EnumUtils",
   "name" : "_C2EnumUtils",
   "record_kind" : "class",
   "referenced_type" : "type-1347",
   "self_type" : "type-1347",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Enum.h",
   "unique_id" : "_ZTS12_C2EnumUtils"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mOffset",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mSize",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_C2FieldId",
   "name" : "_C2FieldId",
   "referenced_type" : "type-1052",
   "self_type" : "type-1052",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS10_C2FieldId"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<C2ChromaOffsetStruct [], void>",
   "name" : "_C2FlexHelper<C2ChromaOffsetStruct [], void>",
   "referenced_type" : "type-3127",
   "self_type" : "type-3127",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3128", "type-27" ],
   "unique_id" : "_ZTS13_C2FlexHelperIA_20C2ChromaOffsetStructvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<C2ChromaOffsetStruct, void>",
   "name" : "_C2FlexHelper<C2ChromaOffsetStruct, void>",
   "referenced_type" : "type-3130",
   "self_type" : "type-3130",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3129", "type-27" ],
   "unique_id" : "_ZTS13_C2FlexHelperI20C2ChromaOffsetStructvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<float [], void>",
   "name" : "_C2FlexHelper<float [], void>",
   "referenced_type" : "type-3131",
   "self_type" : "type-3131",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1519", "type-27" ],
   "unique_id" : "_ZTS13_C2FlexHelperIA_fvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<float, void>",
   "name" : "_C2FlexHelper<float, void>",
   "referenced_type" : "type-3132",
   "self_type" : "type-3132",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-264", "type-27" ],
   "unique_id" : "_ZTS13_C2FlexHelperIfvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<unsigned char [], void>",
   "name" : "_C2FlexHelper<unsigned char [], void>",
   "referenced_type" : "type-3122",
   "self_type" : "type-3122",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3123", "type-27" ],
   "unique_id" : "_ZTS13_C2FlexHelperIA_hvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<unsigned char, void>",
   "name" : "_C2FlexHelper<unsigned char, void>",
   "referenced_type" : "type-3124",
   "self_type" : "type-3124",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3", "type-27" ],
   "unique_id" : "_ZTS13_C2FlexHelperIhvE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3530"
    }
   ],
   "linker_set_key" : "_C2Flexible<C2PictureSizeStruct>",
   "name" : "_C2Flexible<C2PictureSizeStruct>",
   "referenced_type" : "type-3529",
   "self_type" : "type-3529",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3216" ],
   "unique_id" : "_ZTS11_C2FlexibleI19C2PictureSizeStructE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3121"
    }
   ],
   "linker_set_key" : "_C2Flexible<C2SimpleValueStruct<C2EasyEnum<c2_bool_t> > >",
   "name" : "_C2Flexible<C2SimpleValueStruct<C2EasyEnum<c2_bool_t> > >",
   "referenced_type" : "type-3120",
   "self_type" : "type-3120",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3117" ],
   "unique_id" : "_ZTS11_C2FlexibleI19C2SimpleValueStructI10C2EasyEnumI9c2_bool_tEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3532"
    }
   ],
   "linker_set_key" : "_C2Flexible<C2SimpleValueStruct<unsigned long> >",
   "name" : "_C2Flexible<C2SimpleValueStruct<unsigned long> >",
   "referenced_type" : "type-3531",
   "self_type" : "type-3531",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3528" ],
   "unique_id" : "_ZTS11_C2FlexibleI19C2SimpleValueStructImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1196"
    }
   ],
   "linker_set_key" : "_C2Flexible<android::hardware::media::c2::V1_0::utils::C2Hidl_Range>",
   "name" : "_C2Flexible<android::hardware::media::c2::V1_0::utils::C2Hidl_Range>",
   "referenced_type" : "type-1195",
   "self_type" : "type-1195",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1128" ],
   "unique_id" : "_ZTS11_C2FlexibleIN7android8hardware5media2c24V1_05utils12C2Hidl_RangeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1199"
    }
   ],
   "linker_set_key" : "_C2Flexible<android::hardware::media::c2::V1_0::utils::C2Hidl_Rect>",
   "name" : "_C2Flexible<android::hardware::media::c2::V1_0::utils::C2Hidl_Rect>",
   "referenced_type" : "type-1198",
   "self_type" : "type-1198",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1132" ],
   "unique_id" : "_ZTS11_C2FlexibleIN7android8hardware5media2c24V1_05utils11C2Hidl_RectEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2Flexible_impl",
   "name" : "_C2Flexible_impl",
   "referenced_type" : "type-3141",
   "self_type" : "type-3141",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS16_C2Flexible_impl"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mStatus",
     "referenced_type" : "type-1222"
    }
   ],
   "linker_set_key" : "_C2InnateStatus",
   "name" : "_C2InnateStatus",
   "referenced_type" : "type-1628",
   "self_type" : "type-1628",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS15_C2InnateStatus"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCapacity",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_C2LinearCapacityAspect",
   "name" : "_C2LinearCapacityAspect",
   "record_kind" : "class",
   "referenced_type" : "type-1801",
   "self_type" : "type-1801",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS23_C2LinearCapacityAspect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1801"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_C2LinearRangeAspect",
   "name" : "_C2LinearRangeAspect",
   "record_kind" : "class",
   "referenced_type" : "type-1930",
   "self_type" : "type-1930",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS20_C2LinearRangeAspect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mWidth",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "_mHeight",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_C2PlanarCapacityAspect",
   "name" : "_C2PlanarCapacityAspect",
   "record_kind" : "class",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS23_C2PlanarCapacityAspect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-6"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCrop",
     "field_offset" : 64,
     "referenced_type" : "type-377"
    }
   ],
   "linker_set_key" : "_C2PlanarSectionAspect",
   "name" : "_C2PlanarSectionAspect",
   "record_kind" : "class",
   "referenced_type" : "type-376",
   "self_type" : "type-376",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS22_C2PlanarSectionAspect"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<C2PictureSizeStruct, 6144, 3254779904>",
   "name" : "_C2StructCheck<C2PictureSizeStruct, 6144, 3254779904>",
   "referenced_type" : "type-3684",
   "self_type" : "type-3684",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3216" ],
   "unique_id" : "_ZTS14_C2StructCheckI19C2PictureSizeStructLi6144ELj3254779904EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<C2PictureSizeStruct, 6144, 4060086272>",
   "name" : "_C2StructCheck<C2PictureSizeStruct, 6144, 4060086272>",
   "referenced_type" : "type-3682",
   "self_type" : "type-3682",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3216" ],
   "unique_id" : "_ZTS14_C2StructCheckI19C2PictureSizeStructLi6144ELj4060086272EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<C2SimpleValueStruct<C2EasyEnum<c2_bool_t> >, 16393, 1610612736>",
   "name" : "_C2StructCheck<C2SimpleValueStruct<C2EasyEnum<c2_bool_t> >, 16393, 1610612736>",
   "referenced_type" : "type-3404",
   "self_type" : "type-3404",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3117" ],
   "unique_id" : "_ZTS14_C2StructCheckI19C2SimpleValueStructI10C2EasyEnumI9c2_bool_tEELi16393ELj1610612736EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<C2SimpleValueStruct<unsigned long>, 2076, 1107296256>",
   "name" : "_C2StructCheck<C2SimpleValueStruct<unsigned long>, 2076, 1107296256>",
   "referenced_type" : "type-3679",
   "self_type" : "type-3679",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3528" ],
   "unique_id" : "_ZTS14_C2StructCheckI19C2SimpleValueStructImELi2076ELj1107296256EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<C2SimpleValueStruct<unsigned long>, 2076, 1912602624>",
   "name" : "_C2StructCheck<C2SimpleValueStruct<unsigned long>, 2076, 1912602624>",
   "referenced_type" : "type-3674",
   "self_type" : "type-3674",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-3528" ],
   "unique_id" : "_ZTS14_C2StructCheckI19C2SimpleValueStructImELi2076ELj1912602624EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<android::hardware::media::c2::V1_0::utils::C2Hidl_Range, 0, 3758096384>",
   "name" : "_C2StructCheck<android::hardware::media::c2::V1_0::utils::C2Hidl_Range, 0, 3758096384>",
   "referenced_type" : "type-1129",
   "self_type" : "type-1129",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1128" ],
   "unique_id" : "_ZTS14_C2StructCheckIN7android8hardware5media2c24V1_05utils12C2Hidl_RangeELi0ELj3758096384EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2StructCheck<android::hardware::media::c2::V1_0::utils::C2Hidl_Rect, 1, 3758096384>",
   "name" : "_C2StructCheck<android::hardware::media::c2::V1_0::utils::C2Hidl_Rect, 1, 3758096384>",
   "referenced_type" : "type-1133",
   "self_type" : "type-1133",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-1132" ],
   "unique_id" : "_ZTS14_C2StructCheckIN7android8hardware5media2c24V1_05utils11C2Hidl_RectELi1ELj3758096384EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2ValueArrayHelper",
   "name" : "_C2ValueArrayHelper",
   "referenced_type" : "type-3142",
   "self_type" : "type-3142",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS19_C2ValueArrayHelper"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_cntr_compat_helper<unsigned int>",
   "name" : "_c2_cntr_compat_helper<unsigned int>",
   "referenced_type" : "type-976",
   "self_type" : "type-976",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTS22_c2_cntr_compat_helperIjE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_cntr_compat_helper<unsigned long>",
   "name" : "_c2_cntr_compat_helper<unsigned long>",
   "referenced_type" : "type-975",
   "self_type" : "type-975",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "template_args" : [ "type-221" ],
   "unique_id" : "_ZTS22_c2_cntr_compat_helperImE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-1553"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 960,
     "referenced_type" : "type-1607"
    },
    {
     "field_name" : "free",
     "field_offset" : 1024,
     "referenced_type" : "type-1611"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1088,
     "referenced_type" : "type-1613"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1152,
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "alloc_device_t",
   "name" : "alloc_device_t",
   "referenced_type" : "type-1606",
   "self_type" : "type-1606",
   "size" : 200,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "alloc_device_t"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mID",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 192,
     "referenced_type" : "type-2242"
    },
    {
     "access" : "private",
     "field_name" : "mVerboseStats",
     "field_offset" : 320,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mMessageCounter",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMessages",
     "field_offset" : 384,
     "referenced_type" : "type-2182"
    }
   ],
   "linker_set_key" : "android::AHandler",
   "name" : "android::AHandler",
   "referenced_type" : "type-2241",
   "self_type" : "type-2241",
   "size" : 88,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AHandler.h",
   "unique_id" : "_ZTSN7android8AHandlerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8AHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AHandlerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8AHandler17onMessageReceivedERKNS_2spINS_8AMessageEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 128,
     "referenced_type" : "type-2087"
    },
    {
     "access" : "private",
     "field_name" : "mQueueChangedCondition",
     "field_offset" : 448,
     "referenced_type" : "type-2218"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 832,
     "referenced_type" : "type-2176"
    },
    {
     "access" : "private",
     "field_name" : "mEventQueue",
     "field_offset" : 1024,
     "referenced_type" : "type-2189"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 1152,
     "referenced_type" : "type-2233"
    },
    {
     "access" : "private",
     "field_name" : "mRunningLocally",
     "field_offset" : 1216,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesLock",
     "field_offset" : 1248,
     "referenced_type" : "type-2087"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesCondition",
     "field_offset" : 1568,
     "referenced_type" : "type-2218"
    }
   ],
   "linker_set_key" : "android::ALooper",
   "name" : "android::ALooper",
   "referenced_type" : "type-2232",
   "self_type" : "type-2232",
   "size" : 248,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7ALooperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mWhenUs",
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-2193"
    }
   ],
   "linker_set_key" : "android::ALooper::Event",
   "name" : "android::ALooper::Event",
   "referenced_type" : "type-2192",
   "self_type" : "type-2192",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooper5EventE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2038"
    },
    {
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "name" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "record_kind" : "class",
   "referenced_type" : "type-2037",
   "self_type" : "type-2037",
   "size" : 184,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ANativeObjectBase.h",
   "template_args" : [ "type-2038", "type-2029", "type-13", "type-2039" ],
   "unique_id" : "_ZTSN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "type-1581"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "android::AString",
   "name" : "android::AString",
   "referenced_type" : "type-2176",
   "self_type" : "type-2176",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h",
   "unique_id" : "_ZTSN7android7AStringE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1364"
    }
   ],
   "linker_set_key" : "android::C2AndroidMemoryUsage",
   "name" : "android::C2AndroidMemoryUsage",
   "referenced_type" : "type-1618",
   "self_type" : "type-1618",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/android-C2Buffer.h",
   "unique_id" : "_ZTSN7android20C2AndroidMemoryUsageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "type-2166"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "type-2167"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "type-2168"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "type-2169"
    }
   ],
   "linker_set_key" : "android::ColorAspects",
   "name" : "android::ColorAspects",
   "referenced_type" : "type-2165",
   "self_type" : "type-2165",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android12ColorAspectsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-2020",
   "self_type" : "type-2020",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-2219"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-2218",
   "self_type" : "type-2218",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2026"
    },
    {
     "referenced_type" : "type-2024"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFenceFd",
     "field_offset" : 32,
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "android::Fence",
   "name" : "android::Fence",
   "record_kind" : "class",
   "referenced_type" : "type-2025",
   "self_type" : "type-2025",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Fence.h",
   "unique_id" : "_ZTSN7android5FenceE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mState",
     "referenced_type" : "type-2140"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-2142"
    },
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 384,
     "referenced_type" : "type-2049"
    },
    {
     "access" : "private",
     "field_name" : "mSignalTime",
     "field_offset" : 448,
     "referenced_type" : "type-2143"
    }
   ],
   "linker_set_key" : "android::FenceTime",
   "name" : "android::FenceTime",
   "record_kind" : "class",
   "referenced_type" : "type-2139",
   "self_type" : "type-2139",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTimeE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2046"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-2048"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "type-2049"
    },
    {
     "field_name" : "signalTime",
     "field_offset" : 128,
     "referenced_type" : "type-196"
    }
   ],
   "linker_set_key" : "android::FenceTime::Snapshot",
   "name" : "android::FenceTime::Snapshot",
   "referenced_type" : "type-2047",
   "self_type" : "type-2047",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTime8SnapshotE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-2150"
    },
    {
     "access" : "private",
     "field_name" : "mQueue",
     "field_offset" : 320,
     "referenced_type" : "type-2151"
    }
   ],
   "linker_set_key" : "android::FenceTimeline",
   "name" : "android::FenceTimeline",
   "record_kind" : "class",
   "referenced_type" : "type-2149",
   "self_type" : "type-2149",
   "size" : 88,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android13FenceTimelineE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-2153"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-2154"
    }
   ],
   "linker_set_key" : "android::FenceToFenceTimeMap",
   "name" : "android::FenceToFenceTimeMap",
   "record_kind" : "class",
   "referenced_type" : "type-2152",
   "self_type" : "type-2152",
   "size" : 80,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android19FenceToFenceTimeMapE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::BufferItem>",
   "name" : "android::Flattenable<android::BufferItem>",
   "record_kind" : "class",
   "referenced_type" : "type-2059",
   "self_type" : "type-2059",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2060" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_10BufferItemEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-2024",
   "self_type" : "type-2024",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2025" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FenceTime::Snapshot>",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "type-2046",
   "self_type" : "type-2046",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2047" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_9FenceTime8SnapshotEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "name" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-2053",
   "self_type" : "type-2053",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2054" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22FrameEventHistoryDeltaEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FrameEventsDelta>",
   "name" : "android::Flattenable<android::FrameEventsDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-2051",
   "self_type" : "type-2051",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2052" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_16FrameEventsDeltaEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::GraphicBuffer>",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-2028",
   "self_type" : "type-2028",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2029" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "record_kind" : "class",
   "referenced_type" : "type-2055",
   "self_type" : "type-2055",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2056" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22IGraphicBufferProducer16QueueBufferInputEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "record_kind" : "class",
   "referenced_type" : "type-2057",
   "self_type" : "type-2057",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2058" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22IGraphicBufferProducer17QueueBufferOutputEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-2021",
   "self_type" : "type-2021",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "android::FloatRect",
   "name" : "android::FloatRect",
   "record_kind" : "class",
   "referenced_type" : "type-2099",
   "self_type" : "type-2099",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FloatRect.h",
   "unique_id" : "_ZTSN7android9FloatRectE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2037"
    },
    {
     "referenced_type" : "type-2028"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 1472,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mBufferMapper",
     "field_offset" : 1536,
     "referenced_type" : "type-2030"
    },
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 1600,
     "referenced_type" : "type-196"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumFds",
     "field_offset" : 1664,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumInts",
     "field_offset" : 1696,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mId",
     "field_offset" : 1728,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mBufferId",
     "field_offset" : 1792,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mGenerationNumber",
     "field_offset" : 1824,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDeathCallbacks",
     "field_offset" : 1856,
     "referenced_type" : "type-2035"
    },
    {
     "access" : "private",
     "field_name" : "mBufferHubBuffer",
     "field_offset" : 2048,
     "referenced_type" : "type-2036"
    }
   ],
   "linker_set_key" : "android::GraphicBuffer",
   "name" : "android::GraphicBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-2029",
   "self_type" : "type-2029",
   "size" : 264,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBuffer.h",
   "unique_id" : "_ZTSN7android13GraphicBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13GraphicBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2034"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "referenced_type" : "type-2032"
    },
    {
     "access" : "private",
     "field_name" : "mMapperVersion",
     "field_offset" : 64,
     "referenced_type" : "type-2033"
    }
   ],
   "linker_set_key" : "android::GraphicBufferMapper",
   "name" : "android::GraphicBufferMapper",
   "record_kind" : "class",
   "referenced_type" : "type-2031",
   "self_type" : "type-2031",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBufferMapper.h",
   "unique_id" : "_ZTSN7android19GraphicBufferMapperE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "type-2172"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "type-2173"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "type-2171",
   "self_type" : "type-2171",
   "size" : 25,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "type-2174"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "record_kind" : "union",
   "referenced_type" : "type-2173",
   "self_type" : "type-2173",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoUt_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Primaries1",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "type-2175",
   "self_type" : "type-2175",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo10Primaries1E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "type-2175"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "type-2175"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "type-2175"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "type-2175"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Type1",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "type-2174",
   "self_type" : "type-2174",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo5Type1E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1997"
    }
   ],
   "linker_set_key" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> >",
   "name" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> >",
   "record_kind" : "class",
   "referenced_type" : "type-2187",
   "self_type" : "type-2187",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-19", "type-2188" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1995"
    }
   ],
   "linker_set_key" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> >",
   "name" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> >",
   "record_kind" : "class",
   "referenced_type" : "type-2185",
   "self_type" : "type-2185",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-19", "type-2186" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1990"
    }
   ],
   "linker_set_key" : "android::KeyedVector<unsigned int, unsigned int>",
   "name" : "android::KeyedVector<unsigned int, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-2182",
   "self_type" : "type-2182",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::HdrMetadata>",
   "name" : "android::LightFlattenable<android::HdrMetadata>",
   "record_kind" : "class",
   "referenced_type" : "type-2067",
   "self_type" : "type-2067",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2068" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_11HdrMetadataEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Point>",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-2061",
   "self_type" : "type-2061",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2062" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Rect>",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-2003",
   "self_type" : "type-2003",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2000" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Region>",
   "name" : "android::LightFlattenable<android::Region>",
   "record_kind" : "class",
   "referenced_type" : "type-2065",
   "self_type" : "type-2065",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2066" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_6RegionEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2061"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Point>",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-2063",
   "self_type" : "type-2063",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2062" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2003"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Rect>",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-2002",
   "self_type" : "type-2002",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2000" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_4RectEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-2027"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::Fence>",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-2026",
   "self_type" : "type-2026",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-2025" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-55" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-52" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "type-2201"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 256,
     "referenced_type" : "type-2199"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 320,
     "referenced_type" : "type-2199"
    }
   ],
   "linker_set_key" : "android::List<VideoBuffer>::_Node",
   "name" : "android::List<VideoBuffer>::_Node",
   "record_kind" : "class",
   "referenced_type" : "type-2200",
   "self_type" : "type-2200",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "unique_id" : "_ZTSN7android4ListINS_19GraphicBufferSource11VideoBufferEE5_NodeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-2190"
    }
   ],
   "linker_set_key" : "android::List<android::ALooper::Event>",
   "name" : "android::List<android::ALooper::Event>",
   "record_kind" : "class",
   "referenced_type" : "type-2189",
   "self_type" : "type-2189",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-2192" ],
   "unique_id" : "_ZTSN7android4ListINS_7ALooper5EventEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7ALooper5EventEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-2212"
    }
   ],
   "linker_set_key" : "android::List<android::GraphicBufferSource::ActionItem>",
   "name" : "android::List<android::GraphicBufferSource::ActionItem>",
   "record_kind" : "class",
   "referenced_type" : "type-2211",
   "self_type" : "type-2211",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-2214" ],
   "unique_id" : "_ZTSN7android4ListINS_19GraphicBufferSource10ActionItemEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_19GraphicBufferSource10ActionItemEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_19GraphicBufferSource10ActionItemEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_19GraphicBufferSource10ActionItemEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-2199"
    }
   ],
   "linker_set_key" : "android::List<android::GraphicBufferSource::VideoBuffer>",
   "name" : "android::List<android::GraphicBufferSource::VideoBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-2198",
   "self_type" : "type-2198",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-2202" ],
   "unique_id" : "_ZTSN7android4ListINS_19GraphicBufferSource11VideoBufferEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_19GraphicBufferSource11VideoBufferEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_19GraphicBufferSource11VideoBufferEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_19GraphicBufferSource11VideoBufferEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-2209"
    }
   ],
   "linker_set_key" : "android::List<int>",
   "name" : "android::List<int>",
   "record_kind" : "class",
   "referenced_type" : "type-2208",
   "self_type" : "type-2208",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android4ListIiEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListIiEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListIiED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListIiED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-2156"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 160,
     "referenced_type" : "type-2157"
    }
   ],
   "linker_set_key" : "android::MediaImage",
   "name" : "android::MediaImage",
   "referenced_type" : "type-2155",
   "self_type" : "type-2155",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImageE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-2161"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mBitDepthAllocated",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 192,
     "referenced_type" : "type-2162"
    }
   ],
   "linker_set_key" : "android::MediaImage2",
   "name" : "android::MediaImage2",
   "referenced_type" : "type-2160",
   "self_type" : "type-2160",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage2E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::MediaImage2::PlaneInfo",
   "name" : "android::MediaImage2::PlaneInfo",
   "referenced_type" : "type-2163",
   "self_type" : "type-2163",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage29PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::MediaImage::PlaneInfo",
   "name" : "android::MediaImage::PlaneInfo",
   "referenced_type" : "type-2158",
   "self_type" : "type-2158",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImage9PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-2088"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-2087",
   "self_type" : "type-2087",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-2091"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-2090",
   "self_type" : "type-2090",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-53"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-56"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2063"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "android::Point",
   "name" : "android::Point",
   "record_kind" : "class",
   "referenced_type" : "type-2062",
   "self_type" : "type-2062",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Point.h",
   "unique_id" : "_ZTSN7android5PointE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-2223"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-2222",
   "self_type" : "type-2222",
   "size" : 56,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-2226"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-2225",
   "self_type" : "type-2225",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-2226"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-2228",
   "self_type" : "type-2228",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2001"
    },
    {
     "referenced_type" : "type-2002"
    }
   ],
   "linker_set_key" : "android::Rect",
   "name" : "android::Rect",
   "record_kind" : "class",
   "referenced_type" : "type-2000",
   "self_type" : "type-2000",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Rect.h",
   "unique_id" : "_ZTSN7android4RectE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-2245",
   "self_type" : "type-2245",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2065"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "referenced_type" : "type-1999"
    }
   ],
   "linker_set_key" : "android::Region",
   "name" : "android::Region",
   "record_kind" : "class",
   "referenced_type" : "type-2066",
   "self_type" : "type-2066",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Region.h",
   "unique_id" : "_ZTSN7android6RegionE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Singleton<android::GraphicBufferMapper>",
   "name" : "android::Singleton<android::GraphicBufferMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-2034",
   "self_type" : "type-2034",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Singleton.h",
   "template_args" : [ "type-2031" ],
   "unique_id" : "_ZTSN7android9SingletonINS_19GraphicBufferMapperEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1989"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> > >",
   "record_kind" : "class",
   "referenced_type" : "type-1997",
   "self_type" : "type-1997",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-1998" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1989"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> > >",
   "record_kind" : "class",
   "referenced_type" : "type-1995",
   "self_type" : "type-1995",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-1996" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1989"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int> >",
   "record_kind" : "class",
   "referenced_type" : "type-1990",
   "self_type" : "type-1990",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-1991" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1986"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-1989",
   "self_type" : "type-1989",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-3306"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-3305",
   "self_type" : "type-3305",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-348"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-3266",
   "self_type" : "type-3266",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 64,
     "referenced_type" : "type-276"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 128,
     "referenced_type" : "type-1467"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "type-2087"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 512,
     "referenced_type" : "type-2218"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 896,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 928,
     "referenced_type" : "type-2230"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 936,
     "referenced_type" : "type-2230"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 960,
     "referenced_type" : "type-2394"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 1024,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-2396",
   "self_type" : "type-2396",
   "size" : 152,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1986"
    }
   ],
   "linker_set_key" : "android::Vector<android::Rect>",
   "name" : "android::Vector<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-1999",
   "self_type" : "type-1999",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-2000" ],
   "unique_id" : "_ZTSN7android6VectorINS_4RectEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_4RectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_4RectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_4RectEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-1467"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "type-707"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "type-1461"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-1986",
   "self_type" : "type-1986",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<unsigned int, unsigned int>",
   "name" : "android::aggregate_traits<unsigned int, unsigned int>",
   "referenced_type" : "type-2440",
   "self_type" : "type-2440",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-2009",
   "self_type" : "type-2009",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, char *>",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "type-4038",
   "self_type" : "type-4038",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-1581", "type-1581" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, const char *>",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "type-3951",
   "self_type" : "type-3951",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-1581", "type-348" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcPKcEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, char *>",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "type-3911",
   "self_type" : "type-3911",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-348", "type-1581" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcPcEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, const char *>",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "type-3310",
   "self_type" : "type-3310",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-348", "type-348" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcS3_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "type-4316",
   "self_type" : "type-4316",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-30", "type-30" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaS3_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "type-4413",
   "self_type" : "type-4413",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-30", "type-28" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaPaEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "type-4051",
   "self_type" : "type-4051",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-3730", "type-3730" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhS3_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "type-4150",
   "self_type" : "type-4150",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-3730", "type-398" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhPhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-28", "type-30" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaPKaEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-28", "type-28" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "type-4203",
   "self_type" : "type-4203",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-398", "type-3730" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhPKhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "type-4280",
   "self_type" : "type-4280",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-398", "type-398" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "type-291"
    }
   ],
   "linker_set_key" : "android::base::ErrnoRestorer",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "type-1402",
   "self_type" : "type-1402",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base13ErrnoRestorerE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-138"
    }
   ],
   "linker_set_key" : "android::base::LogMessage",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogMessageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "type-4091"
    }
   ],
   "linker_set_key" : "android::base::LogdLogger",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "type-4315",
   "self_type" : "type-4315",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogdLoggerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "android::base::ScopedLogSeverity",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base17ScopedLogSeverityE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-2010",
   "self_type" : "type-2010",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-2009" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3677"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 128,
     "referenced_type" : "type-3676"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 192,
     "referenced_type" : "type-1467"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-3675",
   "self_type" : "type-3675",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "type-3696"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "type-2244"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "type-3698"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-3695",
   "self_type" : "type-3695",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mEfWordNeedsUnmapping",
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mEfWordPtr",
     "field_offset" : 64,
     "referenced_type" : "type-1860"
    }
   ],
   "linker_set_key" : "android::hardware::EventFlag",
   "name" : "android::hardware::EventFlag",
   "referenced_type" : "type-1859",
   "self_type" : "type-1859",
   "size" : 16,
   "source_file" : "/system/libfmq/include/fmq/EventFlag.h",
   "unique_id" : "_ZTSN7android8hardware9EventFlagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-339"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 64,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-3677",
   "self_type" : "type-3677",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-3369",
   "self_type" : "type-3369",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-3719",
   "self_type" : "type-3719",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDesc",
     "referenced_type" : "type-2075"
    },
    {
     "access" : "private",
     "field_name" : "mRing",
     "field_offset" : 64,
     "referenced_type" : "type-398"
    },
    {
     "access" : "private",
     "field_name" : "mReadPtr",
     "field_offset" : 128,
     "referenced_type" : "type-1955"
    },
    {
     "access" : "private",
     "field_name" : "mWritePtr",
     "field_offset" : 192,
     "referenced_type" : "type-1955"
    },
    {
     "access" : "private",
     "field_name" : "mEvFlagWord",
     "field_offset" : 256,
     "referenced_type" : "type-1860"
    },
    {
     "access" : "private",
     "field_name" : "mEventFlag",
     "field_offset" : 320,
     "referenced_type" : "type-1957"
    }
   ],
   "linker_set_key" : "android::hardware::MessageQueue<android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage, android::hardware::kUnsynchronizedWrite>",
   "name" : "android::hardware::MessageQueue<android::hardware::media::bufferpool::V2_0::BufferInvalidationMessage, android::hardware::kUnsynchronizedWrite>",
   "referenced_type" : "type-2074",
   "self_type" : "type-2074",
   "size" : 48,
   "source_file" : "/system/libfmq/include/fmq/MessageQueue.h",
   "template_args" : [ "type-2076" ],
   "unique_id" : "_ZTSN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_025BufferInvalidationMessageELNS0_8MQFlavorE2EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDesc",
     "referenced_type" : "type-1954"
    },
    {
     "access" : "private",
     "field_name" : "mRing",
     "field_offset" : 64,
     "referenced_type" : "type-398"
    },
    {
     "access" : "private",
     "field_name" : "mReadPtr",
     "field_offset" : 128,
     "referenced_type" : "type-1955"
    },
    {
     "access" : "private",
     "field_name" : "mWritePtr",
     "field_offset" : 192,
     "referenced_type" : "type-1955"
    },
    {
     "access" : "private",
     "field_name" : "mEvFlagWord",
     "field_offset" : 256,
     "referenced_type" : "type-1860"
    },
    {
     "access" : "private",
     "field_name" : "mEventFlag",
     "field_offset" : 320,
     "referenced_type" : "type-1957"
    }
   ],
   "linker_set_key" : "android::hardware::MessageQueue<android::hardware::media::bufferpool::V2_0::BufferStatusMessage, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MessageQueue<android::hardware::media::bufferpool::V2_0::BufferStatusMessage, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-1953",
   "self_type" : "type-1953",
   "size" : 48,
   "source_file" : "/system/libfmq/include/fmq/MessageQueue.h",
   "template_args" : [ "type-628" ],
   "unique_id" : "_ZTSN7android8hardware12MessageQueueINS0_5media10bufferpool4V2_019BufferStatusMessageELNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 64,
     "referenced_type" : "type-3725"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 256,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 320,
     "referenced_type" : "type-398"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 384,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 448,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 512,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 576,
     "referenced_type" : "type-3726"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 640,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 704,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 768,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 832,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 896,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 904,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 912,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 960,
     "referenced_type" : "type-3727"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 1024,
     "referenced_type" : "type-1467"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-3724",
   "self_type" : "type-3724",
   "size" : 136,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-252"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "type-252"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-3753",
   "self_type" : "type-3753",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 288,
     "referenced_type" : "type-608"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::media::c2::V1_0::Status>",
   "name" : "android::hardware::Return<android::hardware::media::c2::V1_0::Status>",
   "record_kind" : "class",
   "referenced_type" : "type-3625",
   "self_type" : "type-3625",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-608" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_5media2c24V1_06StatusEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-2323"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer> >",
   "record_kind" : "class",
   "referenced_type" : "type-3358",
   "self_type" : "type-3358",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-2323" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_8graphics11bufferqueue4V2_022IGraphicBufferProducerEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-1261"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::media::bufferpool::V2_0::IClientManager> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::media::bufferpool::V2_0::IClientManager> >",
   "record_kind" : "class",
   "referenced_type" : "type-2423",
   "self_type" : "type-2423",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1261" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5media10bufferpool4V2_014IClientManagerEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-2313"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::media::c2::V1_0::IComponentInterface> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::media::c2::V1_0::IComponentInterface> >",
   "record_kind" : "class",
   "referenced_type" : "type-4472",
   "self_type" : "type-4472",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-2313" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5media2c24V1_019IComponentInterfaceEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-3572"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::media::c2::V1_0::IConfigurable> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::media::c2::V1_0::IConfigurable> >",
   "record_kind" : "class",
   "referenced_type" : "type-4436",
   "self_type" : "type-4436",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-3572" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5media2c24V1_013IConfigurableEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::media::c2::V1_0::IInputSink> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::media::c2::V1_0::IInputSink> >",
   "record_kind" : "class",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5media2c24V1_010IInputSinkEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::Return<unsigned int>",
   "name" : "android::hardware::Return<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-2669",
   "self_type" : "type-2669",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIjEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 64,
     "referenced_type" : "type-3799"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 320,
     "referenced_type" : "type-3800"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 512,
     "referenced_type" : "type-3801"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-3798",
   "self_type" : "type-3798",
   "size" : 88,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<int, 4>",
   "name" : "android::hardware::details::const_accessor<int, 4>",
   "referenced_type" : "type-720",
   "self_type" : "type-720",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIiLm4EJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-706"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "name" : "android::hardware::details::const_accessor<unsigned int, 10>",
   "referenced_type" : "type-705",
   "self_type" : "type-705",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIjLm10EJEEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-624"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<BaseBlock>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<BaseBlock>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_09BaseBlockEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-545"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<Block>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<Block>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_05BlockEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-557"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<Buffer>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<Buffer>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_06BufferEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-2260"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<ComponentTraits>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<ComponentTraits>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-2259",
   "self_type" : "type-2259",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015IComponentStore15ComponentTraitsEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<FieldDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<FieldDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-497",
   "self_type" : "type-497",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015FieldDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<FieldSupportedValues>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<FieldSupportedValues>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_020FieldSupportedValuesEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-2532"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<FieldSupportedValuesQuery>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<FieldSupportedValuesQuery>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-2531",
   "self_type" : "type-2531",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_025FieldSupportedValuesQueryEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-2644"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<FieldSupportedValuesQueryResult>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<FieldSupportedValuesQueryResult>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-2643",
   "self_type" : "type-2643",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_031FieldSupportedValuesQueryResultEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-654"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<FrameEventsDelta>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<FrameEventsDelta>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-567"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<InfoBuffer>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<InfoBuffer>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_010InfoBufferEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-2891"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<InputBuffer>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<InputBuffer>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-2890",
   "self_type" : "type-2890",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_018IComponentListener11InputBufferEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-471"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<NamedValue>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<NamedValue>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015FieldDescriptor10NamedValueEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-2633"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<ParamDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<ParamDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-2632",
   "self_type" : "type-2632",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015ParamDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<ParamFieldValues>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<ParamFieldValues>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_016ParamFieldValuesEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-647"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<Rect>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<Rect>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-646",
   "self_type" : "type-646",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media4V1_04RectEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-679"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<RenderedFrame>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<RenderedFrame>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_018IComponentListener13RenderedFrameEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-585"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<SettingResult>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<SettingResult>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_013SettingResultEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-2269"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<StructDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<StructDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-2268",
   "self_type" : "type-2268",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_016StructDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-606"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<Work>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<Work>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_04WorkEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-595"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<Worklet>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<Worklet>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_07WorkletEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-389" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-653"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta>",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-655" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<int, 4> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<int, 4> >",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-664" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIiLm4EJEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-638"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-345" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-646"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::V1_0::Rect>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::V1_0::Rect>",
   "referenced_type" : "type-645",
   "self_type" : "type-645",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-648" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media4V1_04RectEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-623"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::BaseBlock>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::BaseBlock>",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-625" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_09BaseBlockEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Block>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Block>",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-546" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_05BlockEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Buffer>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Buffer>",
   "referenced_type" : "type-555",
   "self_type" : "type-555",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-558" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_06BufferEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-470"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldDescriptor::NamedValue>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldDescriptor::NamedValue>",
   "referenced_type" : "type-469",
   "self_type" : "type-469",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-472" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015FieldDescriptor10NamedValueEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-497"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldDescriptor>",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-499" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015FieldDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-435"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldSupportedValues>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldSupportedValues>",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-437" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_020FieldSupportedValuesEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-2531"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldSupportedValuesQuery>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldSupportedValuesQuery>",
   "referenced_type" : "type-2530",
   "self_type" : "type-2530",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-888" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_025FieldSupportedValuesQueryEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-2643"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldSupportedValuesQueryResult>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::FieldSupportedValuesQueryResult>",
   "referenced_type" : "type-2642",
   "self_type" : "type-2642",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-900" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_031FieldSupportedValuesQueryResultEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-2890"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::IComponentListener::InputBuffer>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::IComponentListener::InputBuffer>",
   "referenced_type" : "type-2889",
   "self_type" : "type-2889",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-2892" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_018IComponentListener11InputBufferEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-678"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::IComponentListener::RenderedFrame>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::IComponentListener::RenderedFrame>",
   "referenced_type" : "type-677",
   "self_type" : "type-677",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-680" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_018IComponentListener13RenderedFrameEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-2259"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::IComponentStore::ComponentTraits>",
   "referenced_type" : "type-2258",
   "self_type" : "type-2258",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-1241" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015IComponentStore15ComponentTraitsEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::InfoBuffer>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::InfoBuffer>",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_010InfoBufferEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-2632"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::ParamDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::ParamDescriptor>",
   "referenced_type" : "type-2631",
   "self_type" : "type-2631",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-840" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_015ParamDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::ParamFieldValues>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::ParamFieldValues>",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-526" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_016ParamFieldValuesEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-584"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::SettingResult>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::SettingResult>",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-586" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_013SettingResultEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-2268"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::StructDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::StructDescriptor>",
   "referenced_type" : "type-2267",
   "self_type" : "type-2267",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-869" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_016StructDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-605"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Work>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Work>",
   "referenced_type" : "type-604",
   "self_type" : "type-604",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-607" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_04WorkEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-594"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Worklet>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::media::c2::V1_0::Worklet>",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-596" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_5media2c24V1_07WorkletEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-349" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-348"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-347",
   "self_type" : "type-347",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-342"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-344" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-663"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_array<int, 4> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<int, 4> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIiLm4EJEEEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-639"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-972"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-971",
   "self_type" : "type-971",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-972",
   "self_type" : "type-972",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-397"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-398"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-404"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-405"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-303"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned long>",
   "name" : "android::hardware::details::hidl_pointer<unsigned long>",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-221" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerImEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-304"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-221"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned long>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned long>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerImEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<int, 4>",
   "name" : "android::hardware::details::std_array<int, 4>",
   "referenced_type" : "type-699",
   "self_type" : "type-699",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIiLm4EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned int, 10>",
   "name" : "android::hardware::details::std_array<unsigned int, 10>",
   "referenced_type" : "type-690",
   "self_type" : "type-690",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIjLm10EJEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer",
   "referenced_type" : "type-2521",
   "self_type" : "type-2521",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer13requestBufferEiNSt3__18functionIFviRKNS0_5media4V1_09AnwBufferEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer13dequeueBufferEjjNS1_6common4V1_011PixelFormatEjbNSt3__18functionIFviiRKNS0_11hidl_handleERKNS4_22FrameEventHistoryDeltaEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16detachNextBufferENSt3__18functionIFviRKNS0_5media4V1_09AnwBufferERKNS0_11hidl_handleEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12attachBufferERKNS0_5media4V1_09AnwBufferENSt3__18functionIFviiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer11queueBufferEiRKNS4_16QueueBufferInputENSt3__18functionIFviRKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer12cancelBufferEiRKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer5queryEiNSt3__18functionIFviiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer7connectERKNS_2spINS3_17IProducerListenerEEEibNSt3__18functionIFviRKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer10disconnectEiNS4_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17setSidebandStreamERKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer15allocateBuffersEjjNS1_6common4V1_011PixelFormatEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer15getConsumerNameENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17setDequeueTimeoutEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer19getLastQueuedBufferENSt3__18functionIFviRKNS0_5media4V1_09AnwBufferERKNS0_11hidl_handleERKNS0_10hidl_arrayIfLm16EJEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer18getFrameTimestampsENSt3__18functionIFvRKNS4_22FrameEventHistoryDeltaEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer11getUniqueIdENSt3__18functionIFvimEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deadlineNs",
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "intervalNs",
     "field_offset" : 64,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "presentLatencyNs",
     "field_offset" : 128,
     "referenced_type" : "type-196"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming",
   "referenced_type" : "type-2497",
   "self_type" : "type-2497",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16CompositorTimingE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-657"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "type-340"
    },
    {
     "field_name" : "signalTimeNs",
     "field_offset" : 192,
     "referenced_type" : "type-196"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17FenceTimeSnapshotE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deltas",
     "referenced_type" : "type-651"
    },
    {
     "field_name" : "compositorTiming",
     "field_offset" : 128,
     "referenced_type" : "type-2497"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta",
   "referenced_type" : "type-2498",
   "self_type" : "type-2498",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer22FrameEventHistoryDeltaE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "frameNumber",
     "field_offset" : 64,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "addPostCompositeCalled",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "addRetireCalled",
     "field_offset" : 136,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "addReleaseCalled",
     "field_offset" : 144,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "postedTimeNs",
     "field_offset" : 192,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "requestedPresentTimeNs",
     "field_offset" : 256,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "latchTimeNs",
     "field_offset" : 320,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "firstRefreshStartTimeNs",
     "field_offset" : 384,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "lastRefreshStartTimeNs",
     "field_offset" : 448,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "dequeueReadyTime",
     "field_offset" : 512,
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "gpuCompositionDoneFence",
     "field_offset" : 576,
     "referenced_type" : "type-656"
    },
    {
     "field_name" : "displayPresentFence",
     "field_offset" : 832,
     "referenced_type" : "type-656"
    },
    {
     "field_name" : "displayRetireFence",
     "field_offset" : 1088,
     "referenced_type" : "type-656"
    },
    {
     "field_name" : "releaseFence",
     "field_offset" : 1344,
     "referenced_type" : "type-656"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta",
   "referenced_type" : "type-655",
   "self_type" : "type-655",
   "size" : 200,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16FrameEventsDeltaE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "isAutoTimestamp",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-2295"
    },
    {
     "field_name" : "crop",
     "field_offset" : 128,
     "referenced_type" : "type-648"
    },
    {
     "field_name" : "scalingMode",
     "field_offset" : 256,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "transform",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stickyTransform",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fence",
     "field_offset" : 384,
     "referenced_type" : "type-340"
    },
    {
     "field_name" : "surfaceDamage",
     "field_offset" : 512,
     "referenced_type" : "type-644"
    },
    {
     "field_name" : "getFrameTimestamps",
     "field_offset" : 640,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput",
   "referenced_type" : "type-2515",
   "self_type" : "type-2515",
   "size" : 88,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer16QueueBufferInputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformHint",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numPendingBuffers",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nextFrameNumber",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "bufferReplaced",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "frameTimestamps",
     "field_offset" : 256,
     "referenced_type" : "type-2498"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput",
   "referenced_type" : "type-2519",
   "self_type" : "type-2519",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_022IGraphicBufferProducer17QueueBufferOutputE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V1_0::IProducerListener",
   "name" : "android::hardware::graphics::bufferqueue::V1_0::IProducerListener",
   "referenced_type" : "type-2238",
   "self_type" : "type-2238",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/1.0/android.hardware.graphics.bufferqueue@1.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/1.0/IProducerListener.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V1_017IProducerListener8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener16onBufferReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V1_017IProducerListener18needsReleaseNotifyEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V1_017IProducerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V1_017IProducerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer",
   "referenced_type" : "type-2325",
   "self_type" : "type-2325",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13requestBufferEiNSt3__18functionIFvNS3_6StatusERKNS1_6common4V1_214HardwareBufferEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer13dequeueBufferERKNS4_18DequeueBufferInputENSt3__18functionIFvNS3_6StatusEiRKNS4_19DequeueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer16detachNextBufferENSt3__18functionIFvNS3_6StatusERKNS1_6common4V1_214HardwareBufferERKNS0_11hidl_handleEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12attachBufferERKNS1_6common4V1_214HardwareBufferEjNSt3__18functionIFvNS3_6StatusEibEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11queueBufferEiRKNS4_16QueueBufferInputENSt3__18functionIFvNS3_6StatusERKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer12cancelBufferEiRKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer5queryEiNSt3__18functionIFviiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer7connectERKNS_2spINS3_17IProducerListenerEEENS3_14ConnectionTypeEbNSt3__18functionIFvNS3_6StatusERKNS4_17QueueBufferOutputEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer10disconnectENS3_14ConnectionTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer15allocateBuffersEjjjm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer17setDequeueTimeoutEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer11getUniqueIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer15getConsumerNameENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput",
   "referenced_type" : "type-2773",
   "self_type" : "type-2773",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer18DequeueBufferInputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufferAge",
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "bufferNeedsReallocation",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "releaseAllBuffers",
     "field_offset" : 72,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "fence",
     "field_offset" : 128,
     "referenced_type" : "type-340"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput",
   "referenced_type" : "type-2776",
   "self_type" : "type-2776",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer19DequeueBufferOutputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "isAutoTimestamp",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "crop",
     "field_offset" : 128,
     "referenced_type" : "type-664"
    },
    {
     "field_name" : "transform",
     "field_offset" : 256,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "stickyTransform",
     "field_offset" : 288,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fence",
     "field_offset" : 320,
     "referenced_type" : "type-340"
    },
    {
     "field_name" : "surfaceDamage",
     "field_offset" : 448,
     "referenced_type" : "type-660"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput",
   "referenced_type" : "type-2786",
   "self_type" : "type-2786",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer16QueueBufferInputE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformHint",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "numPendingBuffers",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nextFrameNumber",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "bufferReplaced",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput",
   "referenced_type" : "type-2817",
   "self_type" : "type-2817",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IGraphicBufferProducer.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_022IGraphicBufferProducer17QueueBufferOutputE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::bufferqueue::V2_0::IProducerListener",
   "name" : "android::hardware::graphics::bufferqueue::V2_0::IProducerListener",
   "referenced_type" : "type-2570",
   "self_type" : "type-2570",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/bufferqueue/2.0/android.hardware.graphics.bufferqueue@2.0_genc++_headers/gen/android/hardware/graphics/bufferqueue/2.0/IProducerListener.h",
   "unique_id" : "_ZTSN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware8graphics11bufferqueue4V2_017IProducerListener8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware8graphics11bufferqueue4V2_017IProducerListener17onBuffersReleasedEj"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware8graphics11bufferqueue4V2_017IProducerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware8graphics11bufferqueue4V2_017IProducerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "description",
     "referenced_type" : "type-729"
    },
    {
     "field_name" : "nativeHandle",
     "field_offset" : 320,
     "referenced_type" : "type-340"
    }
   ],
   "linker_set_key" : "android::hardware::graphics::common::V1_2::HardwareBuffer",
   "name" : "android::hardware::graphics::common::V1_2::HardwareBuffer",
   "referenced_type" : "type-2715",
   "self_type" : "type-2715",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/1.2/android.hardware.graphics.common@1.2_genc++_headers/gen/android/hardware/graphics/common/1.2/types.h",
   "unique_id" : "_ZTSN7android8hardware8graphics6common4V1_214HardwareBufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-665"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<int, 4>",
   "name" : "android::hardware::hidl_array<int, 4>",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIiLm4EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-730"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned int, 10>",
   "name" : "android::hardware::hidl_array<unsigned int, 10>",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIjLm10EJEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3369"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRecipient",
     "field_offset" : 64,
     "referenced_type" : "type-3830"
    },
    {
     "access" : "private",
     "field_name" : "mCookie",
     "field_offset" : 192,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 256,
     "referenced_type" : "type-3831"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_binder_death_recipient",
   "name" : "android::hardware::hidl_binder_death_recipient",
   "referenced_type" : "type-3829",
   "self_type" : "type-3829",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/HidlBinderSupport.h",
   "unique_id" : "_ZTSN7android8hardware27hidl_binder_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
