{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "FLAC__Subframe [8]",
   "name" : "FLAC__Subframe [8]",
   "referenced_type" : "type-107",
   "self_type" : "type-106",
   "size" : 2560,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [129]",
   "name" : "char [129]",
   "referenced_type" : "type-21",
   "self_type" : "type-20",
   "size" : 129,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [13]",
   "name" : "char [13]",
   "referenced_type" : "type-21",
   "self_type" : "type-25",
   "size" : 13,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "linker_set_key" : "const char *[]",
   "name" : "const char *[]",
   "referenced_type" : "type-30",
   "self_type" : "type-151",
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const int *[8]",
   "name" : "const int *[8]",
   "referenced_type" : "type-41",
   "self_type" : "type-159",
   "size" : 64,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [32]",
   "name" : "int [32]",
   "referenced_type" : "type-1",
   "self_type" : "type-96",
   "size" : 128,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [4]",
   "name" : "int [4]",

   "linker_set_key" : "void (*)(const FLAC__StreamEncoder *, const FLAC__StreamMetadata *, void *)",
   "name" : "void (*)(const FLAC__StreamEncoder *, const FLAC__StreamMetadata *, void *)",
   "referenced_type" : "type-132",
   "self_type" : "type-133",
   "size" : 8,
   "source_file" : "/external/flac/include/FLAC/stream_encoder.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(const FLAC__StreamEncoder *, unsigned long, unsigned long, unsigned int, unsigned int, void *)",
   "name" : "void (*)(const FLAC__StreamEncoder *, unsigned long, unsigned long, unsigned int, unsigned int, void *)",
   "referenced_type" : "type-139",
   "self_type" : "type-140",
   "size" : 8,
   "source_file" : "/external/flac/include/FLAC/stream_encoder.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-44",
   "self_type" : "type-66",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__EntropyCodingMethod_PartitionedRiceContents",
   "name" : "const FLAC__EntropyCodingMethod_PartitionedRiceContents",
   "referenced_type" : "type-7",
   "self_type" : "type-6",
   "size" : 24,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__Frame",
   "name" : "const FLAC__Frame",
   "referenced_type" : "type-101",
   "self_type" : "type-100",
   "size" : 2608,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__StreamDecoder",
   "name" : "const FLAC__StreamDecoder",
   "referenced_type" : "type-47",
   "self_type" : "type-46",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/stream_decoder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__StreamEncoder",
   "name" : "const FLAC__StreamEncoder",
   "referenced_type" : "type-119",
   "self_type" : "type-118",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/stream_encoder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__StreamMetadata",
   "name" : "const FLAC__StreamMetadata",
   "referenced_type" : "type-54",
   "self_type" : "type-53",
   "size" : 176,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__StreamMetadata_CueSheet",
   "name" : "const FLAC__StreamMetadata_CueSheet",
   "referenced_type" : "type-19",
   "self_type" : "type-18",
   "size" : 160,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__StreamMetadata_Picture",
   "name" : "const FLAC__StreamMetadata_Picture",
   "referenced_type" : "type-33",
   "self_type" : "type-32",
   "size" : 56,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const FLAC__StreamMetadata_SeekTable",
   "name" : "const FLAC__StreamMetadata_SeekTable",
   "referenced_type" : "type-12",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::FLACDecoder",
   "name" : "const android::FLACDecoder",
   "referenced_type" : "type-156",
   "self_type" : "type-162",
   "size" : 224,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-21",
   "self_type" : "type-31",
   "size" : 1,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const char *const[]",
   "name" : "const char *const[]",
   "referenced_type" : "type-151",
   "self_type" : "type-160",
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-1",
   "self_type" : "type-42",
   "size" : 4,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const int *const",
   "name" : "const int *const",
   "referenced_type" : "type-41",
   "self_type" : "type-112",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-24",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-3",
   "self_type" : "type-164",
   "size" : 4,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-15",
   "self_type" : "type-152",
   "size" : 8,
   "source_file" : "/external/flac/include/FLAC/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[4]",
   "name" : "unsigned char const[4]",
   "referenced_type" : "type-61",
   "self_type" : "type-153",
   "size" : 4,
   "source_file" : "/external/flac/include/FLAC/format.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "FLAC__EntropyCodingMethod",
   "name" : "FLAC__EntropyCodingMethod",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 24,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__EntropyCodingMethod"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "partitioned_rice",
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "FLAC__EntropyCodingMethod::(anonymous union at external/flac/include/FLAC/format.h:257:2) at external/flac/include/FLAC/format.h:257:2",
   "name" : "FLAC__EntropyCodingMethod::(anonymous union at external/flac/include/FLAC/format.h:257:2) at external/flac/include/FLAC/format.h:257:2",
   "record_kind" : "union",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__EntropyCodingMethod::(anonymous union at external/flac/include/FLAC/format.h:257:2)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "order",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "contents",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "FLAC__EntropyCodingMethod_PartitionedRice",
   "name" : "FLAC__EntropyCodingMethod_PartitionedRice",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__EntropyCodingMethod_PartitionedRice"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "parameters",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "raw_bits",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "capacity_by_order",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "FLAC__EntropyCodingMethod_PartitionedRiceContents",
   "name" : "FLAC__EntropyCodingMethod_PartitionedRiceContents",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 24,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__EntropyCodingMethod_PartitionedRiceContents"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "subframes",
     "field_offset" : 320,
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "footer",
     "field_offset" : 20800,
     "referenced_type" : "type-109"
    }
   ],
   "linker_set_key" : "FLAC__Frame",
   "name" : "FLAC__Frame",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 2608,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Frame"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "crc",
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "FLAC__FrameFooter",
   "name" : "FLAC__FrameFooter",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 2,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__FrameFooter"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "blocksize",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "channels",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "channel_assignment",
     "field_offset" : 96,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "bits_per_sample",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "number_type",
     "field_offset" : 160,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "number",
     "field_offset" : 192,
     "referenced_type" : "type-105"
    },
    {
     "field_name" : "crc",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "FLAC__FrameHeader",
   "name" : "FLAC__FrameHeader",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 40,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__FrameHeader"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frame_number",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sample_number",
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "FLAC__FrameHeader::(anonymous union at external/flac/include/FLAC/format.h:432:2) at external/flac/include/FLAC/format.h:432:2",
   "name" : "FLAC__FrameHeader::(anonymous union at external/flac/include/FLAC/format.h:432:2) at external/flac/include/FLAC/format.h:432:2",
   "record_kind" : "union",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 8,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__FrameHeader::(anonymous union at external/flac/include/FLAC/format.h:432:2)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "protected_",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "private_",
     "field_offset" : 64,
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "FLAC__StreamDecoder",
   "name" : "FLAC__StreamDecoder",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/stream_decoder.h",
   "unique_id" : "FLAC__StreamDecoder"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "protected_",
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "private_",
     "field_offset" : 64,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "FLAC__StreamEncoder",
   "name" : "FLAC__StreamEncoder",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/stream_encoder.h",
   "unique_id" : "FLAC__StreamEncoder"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "is_last",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "data",
     "field_offset" : 128,
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata",
   "name" : "FLAC__StreamMetadata",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 176,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream_info",
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "application",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "seek_table",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vorbis_comment",
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "cue_sheet",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "picture",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "unknown",
     "referenced_type" : "type-65"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "FLAC__StreamMetadata::(anonymous union at external/flac/include/FLAC/format.h:846:2) at external/flac/include/FLAC/format.h:846:2",
   "name" : "FLAC__StreamMetadata::(anonymous union at external/flac/include/FLAC/format.h:846:2) at external/flac/include/FLAC/format.h:846:2",
   "record_kind" : "union",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 160,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata::(anonymous union at external/flac/include/FLAC/format.h:846:2)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_Application",
   "name" : "FLAC__StreamMetadata_Application",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_Application"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "media_catalog_number",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "lead_in",
     "field_offset" : 1088,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "is_cd",
     "field_offset" : 1152,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "num_tracks",
     "field_offset" : 1184,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "tracks",
     "field_offset" : 1216,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_CueSheet",
   "name" : "FLAC__StreamMetadata_CueSheet",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 160,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_CueSheet"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "number",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_CueSheet_Index",
   "name" : "FLAC__StreamMetadata_CueSheet_Index",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_CueSheet_Index"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "number",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "isrc",
     "field_offset" : 72,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "type",
     "field_offset" : 176,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pre_emphasis",
     "field_offset" : 177,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "num_indices",
     "field_offset" : 184,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "indices",
     "field_offset" : 192,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_CueSheet_Track",
   "name" : "FLAC__StreamMetadata_CueSheet_Track",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 32,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_CueSheet_Track"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dummy",
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_Padding",
   "name" : "FLAC__StreamMetadata_Padding",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 4,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_Padding"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "mime_type",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "description",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "width",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "height",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "depth",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "colors",
     "field_offset" : 288,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "data_length",
     "field_offset" : 320,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "data",
     "field_offset" : 384,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_Picture",
   "name" : "FLAC__StreamMetadata_Picture",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 56,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_Picture"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sample_number",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "stream_offset",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "frame_samples",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_SeekPoint",
   "name" : "FLAC__StreamMetadata_SeekPoint",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 24,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_SeekPoint"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "points",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_SeekTable",
   "name" : "FLAC__StreamMetadata_SeekTable",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_SeekTable"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "min_blocksize",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "max_blocksize",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "min_framesize",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "max_framesize",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "channels",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bits_per_sample",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "total_samples",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "md5sum",
     "field_offset" : 320,
     "referenced_type" : "type-58"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_StreamInfo",
   "name" : "FLAC__StreamMetadata_StreamInfo",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 56,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_StreamInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_Unknown",
   "name" : "FLAC__StreamMetadata_Unknown",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 8,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_Unknown"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vendor_string",
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "num_comments",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "comments",
     "field_offset" : 192,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_VorbisComment",
   "name" : "FLAC__StreamMetadata_VorbisComment",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 32,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_VorbisComment"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "entry",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "FLAC__StreamMetadata_VorbisComment_Entry",
   "name" : "FLAC__StreamMetadata_VorbisComment_Entry",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 16,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__StreamMetadata_VorbisComment_Entry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "wasted_bits",
     "field_offset" : 2496,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "FLAC__Subframe",
   "name" : "FLAC__Subframe",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 320,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Subframe"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "constant",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "fixed",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "lpc",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "verbatim",
     "referenced_type" : "type-40"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "FLAC__Subframe::(anonymous union at external/flac/include/FLAC/format.h:346:2) at external/flac/include/FLAC/format.h:346:2",
   "name" : "FLAC__Subframe::(anonymous union at external/flac/include/FLAC/format.h:346:2) at external/flac/include/FLAC/format.h:346:2",
   "record_kind" : "union",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 304,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Subframe::(anonymous union at external/flac/include/FLAC/format.h:346:2)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "FLAC__Subframe_Constant",
   "name" : "FLAC__Subframe_Constant",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 4,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Subframe_Constant"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "entropy_coding_method",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "order",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "warmup",
     "field_offset" : 224,
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "residual",
     "field_offset" : 384,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "FLAC__Subframe_Fixed",
   "name" : "FLAC__Subframe_Fixed",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 56,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Subframe_Fixed"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "entropy_coding_method",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "order",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "qlp_coeff_precision",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "quantization_level",
     "field_offset" : 256,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "qlp_coeff",
     "field_offset" : 288,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "warmup",
     "field_offset" : 1312,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "residual",
     "field_offset" : 2368,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "FLAC__Subframe_LPC",
   "name" : "FLAC__Subframe_LPC",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 304,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Subframe_LPC"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "FLAC__Subframe_Verbatim",
   "name" : "FLAC__Subframe_Verbatim",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 8,
   "source_file" : "/external/flac/include/FLAC/format.h",
   "unique_id" : "FLAC__Subframe_Verbatim"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDecoder",
     "field_offset" : 64,
     "referenced_type" : "type-157"
    },
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "access" : "private",
     "field_name" : "mBufferLen",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mBufferPos",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mBufferDataSize",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mStreamInfo",
     "field_offset" : 384,
     "referenced_type" : "type-57"
    },
    {
     "access" : "private",
     "field_name" : "mStreamInfoValid",
     "field_offset" : 832,
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mWriteRequested",
     "field_offset" : 840,
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mWriteCompleted",
     "field_offset" : 848,
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mWriteHeader",
     "field_offset" : 896,
     "referenced_type" : "type-102"
    },
    {
     "access" : "private",
     "field_name" : "mWriteBuffer",
     "field_offset" : 1216,
     "referenced_type" : "type-159"
    },
    {
     "access" : "private",
     "field_name" : "mErrorStatus",
     "field_offset" : 1728,
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::FLACDecoder",
   "name" : "android::FLACDecoder",
   "record_kind" : "class",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 224,
   "source_file" : "/frameworks/av/media/libstagefright/flac/dec/FLACDecoder.h",
   "unique_id" : "_ZTSN7android11FLACDecoderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11FLACDecoderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11FLACDecoderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11FLACDecoderD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" : []
}
