{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [16]",
   "name" : "char [16]",
   "referenced_type" : "type-42",
   "self_type" : "type-70",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [1024]",
   "name" : "int [1024]",
   "referenced_type" : "type-7",
   "self_type" : "type-103",
   "size" : 4096,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [1026]",
   "name" : "int [1026]",
   "referenced_type" : "type-7",
   "self_type" : "type-32",
   "size" : 4104,
   "source_file" : "/external/tremolo/Tremolo/mdct_lookup.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [128]",
   "name" : "int [128]",
   "referenced_type" : "type-7",
   "self_type" : "type-97",
   "size" : 512,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [129]",
   "name" : "int [129]",
   "referenced_type" : "type-7",
   "self_type" : "type-19",
   "size" : 516,
   "source_file" : "/external/tremolo/Tremolo/lsp_lookup.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [2048]",
   "name" : "int [2048]",
   "referenced_type" : "type-7",
   "self_type" : "type-105",
   "size" : 8192,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [256]",
   "name" : "int [256]",

   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-14",
   "self_type" : "type-13",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/ogg.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned short *",
   "name" : "unsigned short *",
   "referenced_type" : "type-76",
   "self_type" : "type-75",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-37",
   "self_type" : "type-36",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/ivorbiscodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void **",
   "name" : "void **",
   "referenced_type" : "type-36",
   "self_type" : "type-88",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vorbis_comment *",
   "name" : "vorbis_comment *",
   "referenced_type" : "type-39",
   "self_type" : "type-38",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/ivorbiscodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vorbis_dsp_state *",
   "name" : "vorbis_dsp_state *",
   "referenced_type" : "type-56",
   "self_type" : "type-55",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vorbis_info *",
   "name" : "vorbis_info *",
   "referenced_type" : "type-35",
   "self_type" : "type-57",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vorbis_info_mapping *",
   "name" : "vorbis_info_mapping *",
   "referenced_type" : "type-81",
   "self_type" : "type-87",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vorbis_info_mode *",
   "name" : "vorbis_info_mode *",
   "referenced_type" : "type-78",
   "self_type" : "type-86",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vorbis_info_residue *",
   "name" : "vorbis_info_residue *",
   "referenced_type" : "type-77",
   "self_type" : "type-89",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-7",
   "self_type" : "type-30",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/mdct.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[1024]",
   "name" : "int const[1024]",
   "referenced_type" : "type-103",
   "self_type" : "type-104",
   "size" : 4096,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[1026]",
   "name" : "int const[1026]",
   "referenced_type" : "type-32",
   "self_type" : "type-33",
   "size" : 4104,
   "source_file" : "/external/tremolo/Tremolo/mdct_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[128]",
   "name" : "int const[128]",
   "referenced_type" : "type-97",
   "self_type" : "type-98",
   "size" : 512,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[129]",
   "name" : "int const[129]",
   "referenced_type" : "type-19",
   "self_type" : "type-20",
   "size" : 516,
   "source_file" : "/external/tremolo/Tremolo/lsp_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[2048]",
   "name" : "int const[2048]",
   "referenced_type" : "type-105",
   "self_type" : "type-106",
   "size" : 8192,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[256]",
   "name" : "int const[256]",
   "referenced_type" : "type-99",
   "self_type" : "type-100",
   "size" : 1024,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[32]",
   "name" : "int const[32]",
   "referenced_type" : "type-93",
   "self_type" : "type-94",
   "size" : 128,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[4096]",
   "name" : "int const[4096]",
   "referenced_type" : "type-107",
   "self_type" : "type-108",
   "size" : 16384,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[512]",
   "name" : "int const[512]",
   "referenced_type" : "type-101",
   "self_type" : "type-102",
   "size" : 2048,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[64]",
   "name" : "int const[64]",
   "referenced_type" : "type-95",
   "self_type" : "type-96",
   "size" : 256,
   "source_file" : "/external/tremolo/Tremolo/window_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "long const[64]",
   "name" : "long const[64]",
   "referenced_type" : "type-17",
   "self_type" : "type-18",
   "size" : 256,
   "source_file" : "/external/tremolo/Tremolo/lsp_lookup.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "long const[65]",
   "name" : "long const[65]",
   "referenced_type" : "type-15",
   "self_type" : "type-16",
   "size" : 260,
   "source_file" : "/external/tremolo/Tremolo/lsp_lookup.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "datasource",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "seekable",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "end",
     "field_offset" : 128,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "oy",
     "field_offset" : 192,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "links",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "offsets",
     "field_offset" : 256,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "dataoffsets",
     "field_offset" : 288,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "serialnos",
     "field_offset" : 320,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "pcmlengths",
     "field_offset" : 352,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "vi",
     "field_offset" : 384,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "vc",
     "field_offset" : 640,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "pcm_offset",
     "field_offset" : 768,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "ready_state",
     "field_offset" : 832,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "current_serialno",
     "field_offset" : 864,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "current_link",
     "field_offset" : 896,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bittrack",
     "field_offset" : 960,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "samptrack",
     "field_offset" : 1024,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "os",
     "field_offset" : 1088,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "vd",
     "field_offset" : 1120,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "callbacks",
     "field_offset" : 1152,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "OggVorbis_File",
   "name" : "OggVorbis_File",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 160,
   "source_file" : "/external/tremolo/Tremolo/ivorbisfile.h",
   "unique_id" : "OggVorbis_File"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dec_maxlength",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "dec_table",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "dec_method",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "dec_type",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_bits",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "dim",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "q_delp",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_minp",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_del",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_min",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_seq",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_pack",
     "field_offset" : 352,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "q_val",
     "field_offset" : 384,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "used_entries",
     "field_offset" : 416,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "dec_buf",
     "field_offset" : 448,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "dec_nodeb",
     "field_offset" : 480,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "dec_leafw",
     "field_offset" : 512,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "entries",
     "field_offset" : 544,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "codebook",
   "name" : "codebook",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 72,
   "source_file" : "/external/tremolo/Tremolo/codebook.h",
   "unique_id" : "codebook"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "blocksizes",
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "modes",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "maps",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "floors",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "residues",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "books",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mode_param",
     "field_offset" : 224,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "map_param",
     "field_offset" : 256,
     "referenced_type" : "type-87"
    },
    {
     "field_name" : "floor_type",
     "field_offset" : 288,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "floor_param",
     "field_offset" : 320,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "residue_param",
     "field_offset" : 352,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "book_param",
     "field_offset" : 384,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "codec_setup_info",
   "name" : "codec_setup_info",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 52,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "codec_setup_info"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mag",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "ang",
     "field_offset" : 8,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "coupling_step",
   "name" : "coupling_step",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 2,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "coupling_step"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "class_dim",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "class_subs",
     "field_offset" : 8,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "class_book",
     "field_offset" : 16,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "class_subbook",
     "field_offset" : 24,
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "floor1class",
   "name" : "floor1class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 11,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "floor1class"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "refcount",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 96,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "ogg_buffer",
   "name" : "ogg_buffer",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_buffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "owner",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "next",
     "referenced_type" : "type-2"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ogg_buffer::(anonymous union at external/tremolo/Tremolo/ogg.h:62:3) at external/tremolo/Tremolo/ogg.h:62:3",
   "name" : "ogg_buffer::(anonymous union at external/tremolo/Tremolo/ogg.h:62:3) at external/tremolo/Tremolo/ogg.h:62:3",
   "record_kind" : "union",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 4,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_buffer::(anonymous union at external/tremolo/Tremolo/ogg.h:62:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "unused_buffers",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "unused_references",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "outstanding",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "shutdown",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "ogg_buffer_state",
   "name" : "ogg_buffer_state",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_buffer_state"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "packet",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "b_o_s",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "e_o_s",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "granulepos",
     "field_offset" : 128,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "packetno",
     "field_offset" : 192,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "ogg_packet",
   "name" : "ogg_packet",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 32,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_packet"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "header_len",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "body",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "body_len",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "ogg_page",
   "name" : "ogg_page",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_page"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "begin",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "next",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "ogg_reference",
   "name" : "ogg_reference",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_reference"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "header_head",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "header_tail",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "body_head",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "body_tail",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_o_s",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "b_o_s",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "serialno",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pageno",
     "field_offset" : 224,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "packetno",
     "field_offset" : 256,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "granulepos",
     "field_offset" : 320,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "lacing_fill",
     "field_offset" : 384,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "body_fill",
     "field_offset" : 416,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "holeflag",
     "field_offset" : 448,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "spanflag",
     "field_offset" : 480,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "clearflag",
     "field_offset" : 512,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "laceptr",
     "field_offset" : 544,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "body_fill_next",
     "field_offset" : 576,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "ogg_stream_state",
   "name" : "ogg_stream_state",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 80,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_stream_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bufferpool",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "fifo_head",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "fifo_tail",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "fifo_fill",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "unsynced",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "headerbytes",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bodybytes",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "ogg_sync_state",
   "name" : "ogg_sync_state",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 28,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "ogg_sync_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "baseref",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "ref",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pos",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "end",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "oggbyte_buffer",
   "name" : "oggbyte_buffer",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 20,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "oggbyte_buffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitsLeftInSegment",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "bitsLeftInWord",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "head",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "tail",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "count",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "oggpack_buffer",
   "name" : "oggpack_buffer",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 24,
   "source_file" : "/external/tremolo/Tremolo/ogg.h",
   "unique_id" : "oggpack_buffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "read_func",
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "seek_func",
     "field_offset" : 32,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "close_func",
     "field_offset" : 64,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "tell_func",
     "field_offset" : 96,
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "ov_callbacks",
   "name" : "ov_callbacks",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/ivorbisfile.h",
   "unique_id" : "ov_callbacks"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "floor",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "residue",
     "field_offset" : 8,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "submap",
   "name" : "submap",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 2,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "submap"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "user_comments",
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "comment_lengths",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "comments",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "vendor",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "vorbis_comment",
   "name" : "vorbis_comment",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 16,
   "source_file" : "/external/tremolo/Tremolo/ivorbiscodec.h",
   "unique_id" : "vorbis_comment"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vi",
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "opb",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "work",
     "field_offset" : 224,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "mdctright",
     "field_offset" : 256,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "out_begin",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "out_end",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "lW",
     "field_offset" : 352,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "W",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "granulepos",
     "field_offset" : 448,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "sequence",
     "field_offset" : 512,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "sample_count",
     "field_offset" : 576,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "vorbis_dsp_state",
   "name" : "vorbis_dsp_state",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 80,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "vorbis_dsp_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "channels",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rate",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bitrate_upper",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bitrate_nominal",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bitrate_lower",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bitrate_window",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "codec_setup",
     "field_offset" : 224,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "vorbis_info",
   "name" : "vorbis_info",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 32,
   "source_file" : "/external/tremolo/Tremolo/ivorbiscodec.h",
   "unique_id" : "vorbis_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "order",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "barkmap",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ampbits",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ampdB",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "numbooks",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "books",
     "field_offset" : 192,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "vorbis_info_floor0",
   "name" : "vorbis_info_floor0",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 40,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "vorbis_info_floor0"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "klass",
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "partitionclass",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "postlist",
     "field_offset" : 64,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "forward_index",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hineighbor",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "loneighbor",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "partitions",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "posts",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mult",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "vorbis_info_floor1",
   "name" : "vorbis_info_floor1",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 36,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "vorbis_info_floor1"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "submaps",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "chmuxlist",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "submaplist",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "coupling_steps",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "coupling",
     "field_offset" : 128,
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "vorbis_info_mapping",
   "name" : "vorbis_info_mapping",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 20,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "vorbis_info_mapping"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "blockflag",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "mapping",
     "field_offset" : 8,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "vorbis_info_mode",
   "name" : "vorbis_info_mode",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 2,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "vorbis_info_mode"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "stagemasks",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "stagebooks",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "begin",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "end",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "partitions",
     "field_offset" : 192,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "groupbook",
     "field_offset" : 200,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "stages",
     "field_offset" : 208,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "vorbis_info_residue",
   "name" : "vorbis_info_residue",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 28,
   "source_file" : "/external/tremolo/Tremolo/codec_internal.h",
   "unique_id" : "vorbis_info_residue"
  }
 ],
 "rvalue_reference_types" : []
}
