{
 "array_types" :
 [
  {
   "linker_set_key" : "const short *[]",
   "name" : "const short *[]",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/bitno_tab.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [16]",
   "name" : "int [16]",
   "referenced_type" : "type-1",
   "self_type" : "type-67",
   "size" : 64,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad2.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "short [10]",
   "name" : "short [10]",
   "referenced_type" : "type-6",
   "self_type" : "type-26",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/q_plsf.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "short [16]",
   "name" : "short [16]",
   "referenced_type" : "type-6",
   "self_type" : "type-66",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad2.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "short [2]",
   "name" : "short [2]",
   "referenced_type" : "type-6",
   "self_type" : "type-63",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad1.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "short [3][2]",
   "name" : "short [3][2]",
   "referenced_type" : "type-63",
   "self_type" : "type-62",
   "size" : 12,

   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/bitreorder_tab.h"
  },
  {
   "linker_set_key" : "reorderBits_MR795",
   "name" : "reorderBits_MR795",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/bitreorder_tab.h"
  },
  {
   "linker_set_key" : "sqrt_l_tbl",
   "name" : "sqrt_l_tbl",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/sqrt_l.h"
  },
  {
   "linker_set_key" : "table_gain_highrates",
   "name" : "table_gain_highrates",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/qua_gain_tbl.h"
  },
  {
   "linker_set_key" : "table_gain_lowrates",
   "name" : "table_gain_lowrates",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/qua_gain_tbl.h"
  },
  {
   "linker_set_key" : "window_160_80",
   "name" : "window_160_80",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/window_tab.h"
  },
  {
   "linker_set_key" : "window_200_40",
   "name" : "window_200_40",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/window_tab.h"
  },
  {
   "linker_set_key" : "window_232_8",
   "name" : "window_232_8",
   "referenced_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/window_tab.h"
  }
 ],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "Q_plsfState *",
   "name" : "Q_plsfState *",
   "referenced_type" : "type-25",
   "self_type" : "type-28",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/lsp.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "Q_plsfState **",
   "name" : "Q_plsfState **",
   "referenced_type" : "type-28",
   "self_type" : "type-43",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/q_plsf.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "const short *",
   "name" : "const short *",
   "referenced_type" : "type-5",
   "self_type" : "type-4",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/bitno_tab.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "gc_predState *",
   "name" : "gc_predState *",
   "referenced_type" : "type-12",
   "self_type" : "type-14",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/gc_pred.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int *",
   "name" : "int *",
   "referenced_type" : "type-1",
   "self_type" : "type-8",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/basic_op_c_equivalent.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "lspState *",
   "name" : "lspState *",
   "referenced_type" : "type-27",
   "self_type" : "type-29",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/lsp.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "lspState **",
   "name" : "lspState **",
   "referenced_type" : "type-29",
   "self_type" : "type-30",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/lsp.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "short *",
   "name" : "short *",
   "referenced_type" : "type-6",
   "self_type" : "type-15",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/az_lsp.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "short **",
   "name" : "short **",
   "referenced_type" : "type-15",
   "self_type" : "type-24",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/lsp.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vadState1 *",
   "name" : "vadState1 *",
   "referenced_type" : "type-60",
   "self_type" : "type-68",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad1.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "vadState1 **",
   "name" : "vadState1 **",
   "referenced_type" : "type-68",
   "self_type" : "type-69",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad1.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "size" : 2,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/bitno_tab.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const short *const[]",
   "name" : "const short *const[]",
   "referenced_type" : "type-3",
   "self_type" : "type-7",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/bitno_tab.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "short const[]",
   "name" : "short const[]",
   "referenced_type" : "type-9",
   "self_type" : "type-10",
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/az_lsp.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "past_rq",
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "Q_plsfState",
   "name" : "Q_plsfState",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/q_plsf.h",
   "unique_id" : "Q_plsfState"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "past_qua_en",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "past_qua_en_MR122",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "gc_predState",
   "name" : "gc_predState",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/gc_pred.h",
   "unique_id" : "gc_predState"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsp_old",
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "lsp_old_q",
     "field_offset" : 160,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "qSt",
     "field_offset" : 320,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "lspState",
   "name" : "lspState",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 44,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/lsp.h",
   "unique_id" : "lspState"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "bckr_est",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "ave_level",
     "field_offset" : 144,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "old_level",
     "field_offset" : 288,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "sub_level",
     "field_offset" : 432,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "a_data5",
     "field_offset" : 576,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "a_data3",
     "field_offset" : 672,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "burst_count",
     "field_offset" : 752,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hang_count",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "stat_count",
     "field_offset" : 784,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "vadreg",
     "field_offset" : 800,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pitch",
     "field_offset" : 816,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tone",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "complex_high",
     "field_offset" : 848,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "complex_low",
     "field_offset" : 864,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "oldlag_count",
     "field_offset" : 880,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "oldlag",
     "field_offset" : 896,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "complex_hang_count",
     "field_offset" : 912,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "complex_hang_timer",
     "field_offset" : 928,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "best_corr_hp",
     "field_offset" : 944,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "speech_vad_decision",
     "field_offset" : 960,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "complex_warning",
     "field_offset" : 976,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sp_burst_count",
     "field_offset" : 992,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "corr_hp_fast",
     "field_offset" : 1008,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "vadState1",
   "name" : "vadState1",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 128,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad1.h",
   "unique_id" : "vadState1"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pre_emp_mem",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "update_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hyster_cnt",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "last_update_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ch_enrg_long_db",
     "field_offset" : 64,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "Lframe_cnt",
     "field_offset" : 320,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "Lch_enrg",
     "field_offset" : 352,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "Lch_noise",
     "field_offset" : 864,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "last_normb_shift",
     "field_offset" : 1376,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tsnr",
     "field_offset" : 1392,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hangover",
     "field_offset" : 1408,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "burstcount",
     "field_offset" : 1424,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "fupdate_flag",
     "field_offset" : 1440,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "negSNRvar",
     "field_offset" : 1456,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "negSNRbias",
     "field_offset" : 1472,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "shift_state",
     "field_offset" : 1488,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "L_R0",
     "field_offset" : 1504,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "L_Rmax",
     "field_offset" : 1536,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "LTP_flag",
     "field_offset" : 1568,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "vadState2",
   "name" : "vadState2",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 200,
   "source_file" : "/frameworks/av/media/libstagefright/codecs/amrnb/common/include/vad2.h",
   "unique_id" : "vadState2"
  }
 ],
 "rvalue_reference_types" : []
}
